{"crc":2065078918, "lines":["*temp nefertariPrisoner false","*temp knowBereniceQueen false","*temp pirateFail false","*comment The organization here is hierarchical.  \"Boat, city, palace\"","*comment is the main order you see below \"Chapter 1\", and each of these","*comment breaks down into further subdivisions.  The idea is to be able","*comment to see the high level structure at a glance, then go deeper;","*comment also, we want to be able to rearrange stuff at will.","*comment —————Chapter 1——————","","*image chap1.png center Chapter One: The Light of Alexandria","","[b]245 B.C.E.[/b]","","*gosub onTheBoat","","*page_break","","*gosub inTheCity","","*finish Chapter 2: The Price of Progress","","*comment ————-On the Boat——————","","*label onTheBoat","*temp sawNefertari false","*gosub intro","","*gosub motivation","","*gosub sosibius","","*gosub piratesBoarding","","*gosub restOfPiratesChoice","","*if not(sawNefertari)","    *bug Path without seeing Nefertari.","","*return","","*comment ——-Boat subroutines——-","","*label intro","There is a light on the horizon that outshines the stars and moon, peeking","above the dark waters of the Mediterranean.  It is the Lighthouse of Alexandria, a bright","beacon on a dark night.  You remember its construction when you were young:  ","[i]as tall as forty houses[/i], they said, shaking their heads in disbelief at the hubris","of Ptolemy II.  But now, it shines in the distance on this night, guiding","your vessel closer with every swish of the rowers' oars.  The lighthouse is proof","that anything is possible in Alexandria.","*return","","*label motivation","Why did you decide to go to Alexandria?","*choice","    #I have always wanted to know everything.","        *set techne +1","        *set rhetoric +1","        *set medicine +1","        Since you were young, you have been in awe of Alexandria, a center of learning","        like no other. Scholars from all over the world have been drawn there like moths to","        a brilliant flame, but only a select few have been invited by King Ptolemy himself.","        When you received the letter with Ptolemy's seal, your heart leapt.","        How could you ever refuse?  This is your destiny.","","        The letter also said something about becoming a tutor to the young Ptolemy IV,","        who will one day inherit the throne.  Child care is not something you've ever paid","        much attention to, but you suppose it will be a learning experience like any other.","        *return","    #I can provide the education that will make the prince a great ruler.","        *set ptolemy_4_rel %+20","        *set rhetoric +2","        You can hardly believe your good fortune:  Ptolemy III has selected you to be his unborn son's","        tutor.  Alexandria is one of the most promising young empires to have arisen","        from the ashes of Alexander the Great's empire.  Young Ptolemy IV will probably","        one day be declared a god, like his father before him.  When he does become king,","        your sage advice will be what shaped him.  Through your influence, you can shape an empire.","","        In addition to your duties as the young Ptolemy's advisor, the letter mentioned that you","        will also be expected to contribute to the management of the Great Library.  That","        is all well and good, but you must not become too distracted.  The Great Library can","        only be as great as its benefactor.  The reminders of old, fallen empires abound in","        Egypt—may they remind you that a civilization is always one terrible ruler away","        from decline.","        *return","    #I miss my old friend, Archimedes.  We built some amazing things together.","        You befriended Archimedes while you were a student at the Musaeum of Alexandria.","        You bonded over the creation of inventions together, neglecting your studies in","        rhetoric so that you could make the perfect catapult, the tallest crane, and the","        most accurate water clock.  While the other students attended because their patrician","        parents wanted them to comport themselves more regally, you and Archimedes were grubby","        masters of techne, and proud of it.","        *set arch_rel %+30","        *set techne +2","","        For the last fifteen years, the two of you have lived far apart—Archimedes on the island","        of Sicily to the west, and you in the city of Cyrene to the east.  ","        But that will change when you live in Alexandria, and you look forward to once again","        coming up with brilliant inventions with your old friend.  He already makes frequent","        trips to Alexandria, and you think you could convince him to stay if you really tried.","","        Your new jobs are also exciting, no question:  by the request of Ptolemy III himself, you","        will be both a librarian at the Great Library and a tutor to young Ptolemy IV.  But","        foolishly or not, you are moving because you were lonely in Cyrene, and your excitement","        to work in the library and Ptolemy's court are secondary to your happiness at once","        again being in the presence of genius.","","        *return","    #I plan to manipulate the royal family until they are dead and I rule Alexandria.","        *set evil true","        When Ptolemy III summoned you, he never realized he was summoning a devil.","","        You have heard that Ptolemy III and his wife Berenice are somewhat poor","        judges of character.  They already have at least one leech attached to","        them, a social climber named Sosi-something who has managed to transcend his","        low birth just by sucking up and doing odd jobs.  Apparently Ptolemy III","        puts great faith in mathematicians such as yourself, and he still consults","        the now-ancient Euclid, who advised his father and grandfather as well.","","        When Ptolemy III offered to make you the unborn prince's future tutor,","        you thought about these propositions and what you could deduce from them,","        and you formed a plan.  You will take advantage of the trust that","        Ptolemy III puts in his scholars.  And you will teach Ptolemy IV.  But in teaching","        the young prince, you will make him just a little soft.  He won't want to think","        hard about things; he'll ask you what to do.  Oh yes, you'll build up his trust,","        too; you'll make him trust you even more than his parents.","","        Next step: get rid of the parents.  Maybe you can convince Ptolemy IV to off them;","        maybe you'll build up your skill in Medicine to poison them; or maybe some other","        schemer will do the dirty work for you.  When Ptolemy IV ascends the throne, you","        will be the person he trusts most, and he will do whatever you say.  Once he has","        a child, he will name you regent, and you will finally have no more use for him at all.","","        But your plan will take a long time to come to fruition, so for now, you play the","        loyal scholar, doing scholarly things at the library until the prince is born.","        *set medicine +2","        *set rhetoric +1","        *set petty %+ 10","        *set arch_rel %- 10","        *set berenice_rel %- 5","        *set ptolemy_3_rel %- 5","        *set ptolemy_4_rel %+ 5","","        *return","*label nameChoice","*choice","    #\"Eratosthenes.\"  (Male)","        *set male true","        *set name \"Eratosthenes\"","        *return","    #\"Sophia.\" (Female)","        *set male false","        *set name \"Sophia\"","        *return","    #I'm a man by a different name.","        *set male true","        *gosub nameEntry","        *return","    #I'm a woman by a different name.","        *set male false","        *gosub nameEntry","        *return","","*label nameEntry","What is your name?","*input_text name","${name}, is that right?","*choice","    #Yes.","        *return","    #No, let me try again.","        *goto nameEntry","","*label sosibius","As you look out on the ocean, a gaunt, bearded man wearing a fine purple chiton","comes to join you at the ship's prow.  He gives you a tight, disdainful smile.","\"You are the one who will be young Ptolemy's tutor, correct?\"","","You nod.  \"That's me.  And you are…?\"","","\"Sosibius,\" he says with a scoff, as if you should have known better.  He looks you","up and down.  \"Aren't you a little young to be the prince's tutor?\"","","\"I don't believe my age is relevant.\"  You turn your gaze again to the lighthouse in the distance, hoping","this annoying man might get the hint and leave.","","\"Hmph,\" Sosibius says, and he looks out to sea.  \"But you are young for someone with such an","illustrious post.  Ptolemy III was tutored by Head Librarian Apollonius,","and even then he was much older than you are now.\"","","\"I'm not certain why you're telling me this,\" you say.","","\"You should simply understand that you cannot expect much advancement yet,\"","Sosibius says.  \"So when someone like myself, a man of no particular","advantages or talents, is offered a position of power ahead","of you, remember that I have at least been working a long time for it.  If","I become the prince's caretaker, do not attempt to deny me the influence","that is my due.\"","","*label sosibiusAnswers","*fake_choice","    *hide_reuse #\"And what will you do with that influence?\"","        \"All I ask is a fine lifestyle, taking part in the riches of the treasury,\"","        Sosibius says.  \"Surely that is not too much to ask.\"","        *goto sosibiusAnswers","    #\"I will stay out of your way.\"","        \"Excellent.\"","    #\"The prince deserves to have true friends.  Are you ready to be one?\"","        *set idealist %+10","        Sosibius laughs.  \"You are an idealist, I see.  Good luck with that.\"","    #\"The prince can be our joint creation.  What do you say?\"","        *set idealist %-10","        Sosibius laughs.  \"Sorry, I work alone.\"","    #\"It is I who will win power in this court.  I suggest you stay out of my way.\"","        *set idealist %- 20","        \"Tough words!\" Sosibius says.  \"Fine then, let this be a contest.  We shall","        see who gains more power over the young prince, the courtier or the librarian.\"","","Sosibius looks behind him, then whispers, \"The queen comes.","Remember, she thinks highly of me, so you would do well to treat me with respect.\"","","*if evil","    Respect?  Fine.  On the surface, you will be gracious to Sosibius.","    But you came to Alexandria with a plan:  build influence with the prince until","    he trusts you utterly, then orchestrate his parents' deaths and take control of Alexandria.","    If Sosibius has the same plan, then he must die as well.  But these plans of yours","    will take years…so you will play the loyal subject for now.","","\"Greetings, both of you.\" Queen Berenice II joins you at the ship's prow.  Despite her regal","title, Berenice prefers to dress like an athlete; her tunic doesn't even cover her knees.","Such a chiton would have been scandalous in Cyrene, but you've","heard women dress and act more like men in Alexandria.  Berenice's muscular build","and the bronze dagger tucked into her belt suggest that she can protect herself just","fine without a bodyguard, and indeed, she has none on this trip.","","As your queen back in Cyrene, Berenice had gained a somewhat fearsome reputation, including ","a rumor that she killed her previous husband, Demetrius the Fair.  But now the people of","Alexandria talk only about their queen's legendary romance with Ptolemy III.","You hear that in Alexandria, they love instead of fear her.  The twenty-odd oarsmen are from","Cyrene, however, and they carefully avert their gaze from the queen to avoid drawing her attention.","","\"I see you two are getting to know each other,\" Berenice says lightly.","","\"My companion has remarkable wit; I can tell already,\" Sosibius says, bowing low to you in a","way you're sure he would not have done minutes ago.  \"But, I lack a name for this fine sage.\"","","*gosub nameChoice","*if male","    *set phim \"him\"","*else","    *set phim \"her\"","","\"${name}, I am very pleased to make your acquaintance,\" Sosibius says, again all obsequiousness.","","\"Is that what you like to be called?\" Berenice asks with a polite smile.","","\"Well, I do have a nickname,\" you say.","*temp noNickChoice false","*gosub nicknameChoice","","*if noNickChoice","    *comment \"Ghoul\", cadavers","    \"How ghastly,\" Sosibius says, hand to his mouth.","","*else","    \"${nickname}, huh,\" Sosibius says dubiously.","","*if nickname = \"Beta\"","    Berenice grins a little.  \"You're humble.  I like that.\"","","    \"Well, it's hard to be first at things when you're classmates with Archimedes.\"","*elseif noNickChoice","    Berenice, however, seems unphased.  \"You did what with cadavers, now?\" she says lightly,","    as if discussing carpentry.","","    \"Just examining the interior bits in an effort to figure out how the body","    works,\" you say.  \"I was very much","    influenced by the advice of my friend Archimedes, who suggested that the body may well operate","    on the same principles as simple machines.\"","","*else","    Berenice gives you a skeptical look, drawing your attention to the fact that her eyebrows","    have been shaved and replaced with kohl, in the Egyptian style.  \"Your friends must","    think very highly of you.\"","","    \"Unless you're the only person who calls yourself that,\" Sosibius adds with a grin.","","    \"No, even Archimedes calls me that,\" you say.  \"And he's not one for nicknames.\"","","Berenice looks surprised.  \"Archimedes, the inventor?  You know him?\"","","\"We were students at the Musaeum at the same time.\"  You nod in the direction of the lighthouse.","\"In between classes, we would run off together to watch the lighthouse being built.\"","","Berenice follows your gaze to the lighthouse and smiles at some private memory.","\"And what do you think of my husband's lighthouse?\"","","*choice","    #\"A granary for the Egyptians might have been a better plan.\"","        *set elitist %-10","        *set berenice_rel %-10","        *set egypt_unrest %-10","        Berenice's expression turns cold.","        \"There will always be poor in the streets,\" she says.  \"Ptolemy wants Alexandria","        to be a city of wonders.  Bread for all is a nice thought, but I don't think you","        would appreciate it if we took your stipend as librarian and used it to buy that","        bread.\"","","        Sosibius grins, as if he has just scored a point.  \"I agree completely, Your","        Majesty.  Alexandria is about wonders.\"","","        Despite her tone, you hope Berenice will think on your advice.","","        *return","    #\"I'm eager to perform some measurements from the top.  I want to test a hypothesis.\"","        \"What hypothesis?\" Berenice asks.","","        \"I think the world might be round,\" you say.","","        *set techne +1","","        \"Round?\" Berenice says, surprised.  \"What do you mean?\"","","        \"I mean…\"","","        *return","    #\"Like Alexandria itself, it's a beacon of hope in a dark world.\"","        Sosibius rolls his eyes.","","        *set berenice_rel %+10","        *set idealist %+10","        Berenice smiles.  \"I think so too,\" she says.  \"The lighthouse doesn't just","        guide ships.  It guides people, beckoning the best and the brightest.  It says, 'Here,","        we work wonders.'\"","        *return","","*label piratesBoarding","Your conversation with Berenice is interrupted by a terrified yell","from the rear of the vessel.  Two Egyptians, one man and one woman,","have crawled over the side and boarded the vessel next to the helmsman.","You look around for the pirates' ship, but you only see a trireme darkly lurking on the","horizon behind the boat.  They must have used a smaller dinghy, low to the water, to make the approach","undetected.","","\"Pirates!\" Berenice says, drawing her dagger.  \"Stay back, ${nickname} and Sosibius.\"","","\"Gladly,\" Sosibius says, and he flees belowdecks.","","The two pirates draw their curved swords, and the woman makes an aggressive gesture toward the helmsman.","The old Greek sailor gets the point and backs away from the giant steering oar.","","\"We're just here for your cargo,\" the woman says.  \"Stay right","where you are.  We'll be gone soon enough.\"","","The oarsmen look uneasily at each other, and give a kind of collective shrug.","","*choice","    #I happen to have installed some anti-pirate traps on this ship.","        Luckily, the two Egyptian pirates already happen to be standing near the helm,","        where you've installed your trap.  You","        stomp on a lever, releasing a taut string that had been","        restraining a spring-loaded section of the deck.","        The trap dumps the pirates overboard into the Mediterranean","        before they can think to yelp.","        *set techne +1","","        Berenice slowly sheathes her dagger.  \"I admit, I'm impressed,\" she tells you.","        *set berenice_rel %+10","","        *return","    #With my Rhetoric skills, I convince the oarsmen to stand up to the pirates.","        \"You have underestimated the crew of this vessel,\" you tell the pirates.  \"They","        are not slaves, but have chosen to serve the captain.  They","        are Greeks of honor who would never run away from a fight in which they outnumber","        their attackers.  All you men of honor, stand with me now.\"","","        Roughly half the oarsmen stand immediately, followed belatedly by the other half.","        Thankfully, none of them seem to mind that you stand behind them all, on the opposite","        end of the boat.","","        \"I suggest you find easier pickings,\" you tell the pirates.","        ","        The pirates visibly hesitate, and it's enough of an opening for the two closest oarsmen","        to rush the Egyptians and push them over the side of the boat.  The man drops his khopesh sword,","        which an oarsman picks up and brandishes in triumph.  A cheer goes up all around.","        *set rhetoric +1","","        \"Well done,\" Berenice says.  \"I admit, I'm impressed.\"","        *set berenice_rel %+10","","        *return","    #Berenice can fight them; I will stand ready if she is injured.","        *set medicine +2","        *set berenice_rel %+ 10","        Berenice runs down the center of the ship","        toward the pirates.  The Egyptians ready themselves for her charge, but at the last moment,","        she stops and throws her dagger at the hand of the woman, who drops her khopesh","        sword in surprise. As the other pirate takes a swing at Berenice, the queen","        ducks under his weapon to pick up the woman's dropped blade.  Still close to the ground,","        Berenice slashes both Egyptians' legs with her new sword. Hamstrung and bent","        over, they are momentarily stunned, long enough for Berenice to push the pirates overboard.","","        \"Impressive,\" you say faintly.  \"Are you…hurt at all?\"","","        \"No, but I was glad to have you here,\" Berenice said.  \"I've heard of your","        skill in healing, and I think I was bolder because of it.\"","","        The other oarsmen, still more impressed, let go of their oars to prostrate themselves","        before her.  \"All hail Queen Berenice!\" one shouts.","","        \"All hail Queen Berenice,\" the others say.","","        Berenice smiles to herself as she picks up her dagger to put it back in her belt.","","        *return","","","*label restOfPiratesChoice","You may have taken care of the initial boarding party, but the pirate ship is drawing","ever nearer to your ship.  Archers gather at the rails of the enemy trireme,","drawing their bows and waiting for the vessel to close in.  You","notice the pirate crew is a mix of men and women, Egyptians and Greeks.","","At the back of the trireme, an Egyptian woman wearing a large gold-leaf headdress appears to","be in command.  Her flowing white robe and long ankh-topped spear mimic the dress of an","Egyptian priestess, while her headdress reminds you of the old pharaohs.  She lifts","her staff to give a \"full speed ahead\" motion.","*set sawNefertari true","","\"That's Nefertari,\" Berenice says.  \"The so-called Pirate Queen Nefertari.  A hero to downtrodden","Egyptians, and a menace to Greek merchants.\"  She turns to you.","\"I'm more of an athlete than a diplomat.  Do you think you","could talk these pirates into working for Alexandria?","We could give them free rein to attack ships that aren't ours,","in exchange for a small share of their plunder.\"","","\"Won't they just shoot us if we try to get close?\" you say.","","\"Nefertari has been known to recognize the black flag of parley,\" Berenice says.","\"And I don't think she would anger my husband by killing me.  Or you.  At worst, we'd be","ransomed.\"  She seems remarkably unfazed by this unnerving possibility.","","You consider for a moment whether you're good enough at Rhetoric to convince the pirates","to work for Alexandria.","*choice","    #\"This doesn't seem like the time.  Let's test some weapons I invented instead.\"","        Berenice shrugs.  \"I suppose you're right—these aren't the ideal","        circumstances for negotiation.\"","","        Along each side of the ship, you've installed three large ballistae","        capable of hurling large bolts at the enemy.  You briefly explain your","        plan to the captain, who gives orders to approach the enemy vessel.","        Crew scramble to operate the machines, and you quickly bark out orders","        to keep them from losing fingers.","","        [i]Thunk thunk thunk![/i]  All three bolts hit the pirate ship cleanly, ","        smashing holes in the side of the vessel.  You hear Nefertari shout an order,","        and the pirate ship gives up the chase, turning away to find easier prey.","        *set techne +1","        *return","    #\"Yes, let's raise the black flag of parley.\"","        You raise a black flag, indicating to the other ship that you wish to parley.","        The enemy archers keep their bows nocked as the other ship draws closer,","        but they do not let their arrows fly.  ","","        Finally, the large enemy ship comes alongside your smaller vessel, and a plank","        with a large spike comes down onto your ship, linking the two.  The pirates","        strike a torch, and you can see now that Nefertari is wearing all kinds of jewelry","        that glints in the torchlight—a golden torque about her neck, a golden circlet,","        and assorted rings.","","        \"You wish to discuss something?\" Nefertari says.  \"Speak.\"","","        *if rhetoric >= 2","            \"We offer an alliance between two nations,\" you say.  \"Your small","            nation of the sea, and great Alexandria.\"","","            \"I'm listening,\" Nefertari says.","","            You proceed to describe Nefertari's tiny pirate fleet in as flowery terms as possible, ","            as an aquatic nation beloved","            of Poseidon.  If peace could be achieved between the Egyptians","            of the land, in Alexandria, and those of the sea, ruled","            by Nefertari, the gods of all peoples would rejoice.","","            Nefertari laughs.  \"Ah, you are a charming one, you scholarly","            nobody.  I could not think you serious, except Berenice herself","            stands beside you, and she did not silence your claptrap.\"","","            \"${name} speaks with my authority, and the offer is genuine,\"","            Berenice says.  \"Come, our nations have been at war too long.\" ","","            \"Nation!\" Nefertari repeats with delight.  \"You flatter me.","            But if you promise to speak of me to your people in such glowing","            terms, I can hardly refuse.\"","","            You broker the deal with Nefertari then and there, wherein","            Nefertari is made an official privateer for Alexandria.  The terms","            of the deal include a special clause for the collection of books:","            Nefertari must sell books only to the Great Library,","            and in exchange, the library agrees to pay a fixed fee no matter","            what the book.  You think this could ultimately turn out quite","            well for the Great Library.","            ","            You just hope you haven't given this Nefertari woman delusions of","            grandeur.","            *set nefertari_deal true","            *set alexandria_knowledge +2","            *set egypt_unrest %+10","            *set nefertari_rel %+ 20","            ","            *return","        *else","            \"We were wondering if you would be interested in working for","            Alexandria,\" you tell Nefertari. Your proposal","            sounds off to you as soon as you begin—[i]working for Alexandria[/i] does not sound like","            something this regal woman would like to do.  If only you'd","            studied Rhetoric a little harder….","            ","            \"I work for no one,\" Nefertari says.  \"And you are in no position","            to bargain.  Here's a counteroffer:  stay right where you are, and","            you will live.\"","","            *set pirateFail true","            As Nefertari's archers keep their arrows trained on you, the","            other pirates relieve your ship of its cargo.","            *if techne > 0","                Sadly, this includes one of your better books on the art","                of techne, which even the pirates seem to realize","                is old enough to be valuable.","                *set techne -1","            The pirates then let you go, leaving you thankful that they've decided","            not to hold you for ransom.","            ","            *return","    #\"Let's race past them.  Our men may get hurt, but I can help them with their injuries later.\"","        You know a little of everything, and that includes sailing.","        You take the steering oar.","","        Knowing that the pirates' large vessel will have difficulty turning about,","        you angle toward the pirate ship, then urge your rowers to row with","        all their might.  The wind is on your side for this maneuver,","        so you order the sailors to unfurl your small ship's sail.","","        As you hoped, the large vessel has difficulty turning to catch you.  At your","        closest point of passage, the archers on the other ship let their arrows","        fly.  One arrow catches a sailor in the arm, but the other shots go wide, ","        and you are safe.","","        *set medicine +1","        You remove the arrow from the sailor's arm and bandage the man as best","        you can, using scraps of his own chiton.  ","        Berenice watches approvingly.  \"You do know a little of everything.\"","        *set berenice_rel %+10","","        *return","        ","*label nicknameChoice","\"My friends call me…","*choice","    #…Beta, because I am always second-best at everything.\"","        *set nickname \"Beta\"","        *set techne +1","        *set rhetoric +1","        *set medicine +1","        *return","    *if (not(male)) #…Athena, because my inventions help defend Athens.\"","        *set nickname \"Athena\"","        *set techne +3","        *return","    *if (male) #…Zeus, because I can create thunder and lightning with my inventions.\"","        *set nickname \"Zeus\"","        *set techne +3","        *return","    *if (not(male)) #…Pythia, because they always come to me for advice.\"","        *set nickname \"Pythia\"","        *set rhetoric +3","        *set ptolemy_3_rel %+10","        *return","    *if (male) #…Apollo, because they always came to me for advice.\"","        *set nickname \"Apollo\"","        *set rhetoric +3","        *set ptolemy_3_rel %+10","        *return","    *if (male) #…Plato, since I ran my own academy back home.\"","        *set nickname \"Plato\"","        *set rhetoric +2","        *set ptolemy_4_rel %+10","        *if evil","            *set petty %+ 10","        *else","            *set petty %-10","        *return","    *if (not(male)) #…Sophist, since I taught many would-be politicians back home.\"","        *set nickname \"Sophist\"","        *set rhetoric +2","        *set ptolemy_4_rel %+10","        *if evil","            *set petty %+ 10","        *else","            *set petty %-10","        *return","    *if (male) #…Prometheus, since I tend to get in a little trouble as I spread knowledge.\"","        *set nickname \"Prometheus\"","        *set techne +1","        *set rhetoric +1","        *set petty %+5","        *set ptolemy_4_rel %+15","        *set nefertari_rel %+15","        *return","    *if (not(male)) #…Eris, since I enjoy causing a bit of clever chaos now and then.\"","        *set nickname \"Eris\"","        *set techne +1","        *set rhetoric +1","        *set petty %+5","        *set ptolemy_4_rel %+15","        *set nefertari_rel %+15","        *return","    #\"…by my real name, though, because my unflattering nickname had to do with how I've dissected cadavers.\"","        *set noNickChoice true","        *set nickname name","        *set medicine +3","        *return","*comment ————In the City—————-","","*label inTheCity","The next morning, your ship docks at Alexandria.  The harbor behind the lighthouse","is busy with ships: Alexandria","is a trade center for the whole Mediterranean. Shipments of grain from the fertile Nile delta stop at this port","before delivery to the cities that were once united under Alexander.  ","As the sole supplier of papyrus, Alexandria also does regular trade with centers of learning","the world over.  Many ships also stop over in Alexandria because they must use the canal","connecting the Nile and the Red Sea; as a result, exotic goods from as far east as India and China","find their way to Alexandrian markets.  The unusually","still and deep waters of the Alexandrian harbor can support truly giant ships.","","On the wharf, ","an honor guard awaits you and Berenice to escort you both to the palace.  Their copper helmets and shields reflect the bright sun overhead, leaving an afterimage if you look too long.  You were surprised Berenice had no such guard on your vessel, but perhaps","Ptolemy's reach extends only so far.","","\"I shall see you both around the palace,\" Sosibius says.  \"Farewell.\"","","What do you say to Berenice when Sosibius departs?","*choice","    #I try to explain that Sosibius plans to manipulate the unborn prince.","        \"'Manipulate' is a strong word,\" Berenice says.  \"Sosibius has always been helpful","        in volunteering for what is needed around court.  Now you say he has a grand plan?","        If desiring influence were a crime, the whole court would need locking up.\"","        She regards you coolly.  \"Do I detect some jealousy?  Some rivalry for the","        royal family's affection?\"","","        \"Not at all,\" you say, with more irritation in your voice than you intended.","","        \"Hmm,\" Berenice says, a twinkle in her eye.  \"Well, if any more ambitious men want influence","        at my court, you let me know right away.\"","","        \"Now you're just mocking me,\" you say.","","        \"Indeed.\"","","        Berenice seems more relaxed in the conversation that follows—it seems she has","        decided you are a bit naive when it comes to matters of the court, and she trusts you","        more as a result.  You suppose the consequences of your accusation could have been worse,","        but you think you did little to make Berenice distrust Sosibius.","","        *set berenice_rel %+5","        *set petty %-5","    #I indirectly imply that she should be on her guard against Sosibius.","        \"Sosibius is an interesting fellow,\" you say.  \"I wonder what it is he is really","        after.\"","","        \"Why?\" Berenice says.  \"Do you have evidence that he should not be trusted?\"","","        \"Just speculating aloud,\" you say, gesturing a concession.  \"I meant nothing by it.\"","","        Berenice frowns, but says nothing more.  You have gotten her to wonder about Sosibius","        herself—perhaps that will prove more effective in the end than a direct accusation.","        *set petty %-10","    #I say nothing about Sosibius, but chat about our mutual hometown of Cyrene instead.","        You change the subject to your mutual hometown of Cyrene, where Berenice grew up a princess.","        Though you intended to try to find common ground with Berenice, you find that","        your experiences of Cyrene were very different; you were poor while she was wealthy,","        and you spent all your time in the library while she spent all her time on horseback.","        You think you liked your hometown more than she did; she speaks of \"escaping\" Cyrene","        when she married Ptolemy.","        ","        \"Does it bother you that Cyrenaica is no longer independent?\" Berenice asks.","        \"You must have been very young when my father seceded from Alexandria.  ","        As a Cyrenaican, how do you feel about my marrying Ptolemy and reuniting the two kingdoms?\"","","        *choice","            #\"I am excited to be a part of the Alexandrian empire now.\"","                \"Good,\" Berenice says with a satisfied nod.  \"Right answer.\"","                *set berenice_rel %+10","            #\"I admit, I do not yet think of myself as Alexandrian.\"","                \"Hmm,\" Berenice says with a tilt of her head.  \"I'm honestly not sure what","                you see in old Cyrene, but I suppose there was much of it I never had the","                freedom to see.\"","                *set idealist %+10","                *set elitist %-10","            #\"I admit, I don't particularly care when cities change hands.\"","                \"Spoken like a true librarian,\" Berenice says wryly.  \"Well, you should see","                the differences between the two cities soon enough.\"","                *set idealist %-10","                *set elitist %+10","","You, Berenice, and the honor guard proceed toward the palace down a broad","avenue lined by great colonnades and bustling with people:","Greeks, Egyptians, Nubians, and even some Persians, Gauls, and Chinese.","You find the mathematical precision of the streets' perfect right angles","appealing; every other city you know is a chaotic tangle of streets.","","The vendors on the street sell a huge variety of goods.  One vendor sells olives, dates, spices,","local fruits and vegetables, bread, and salt.  A butcher sells beef, goat, mutton, chicken,","and even crocodile and ostrich (or so he claims).  An Egyptian vendor sells a huge variety","of perfumes and oils.  An art dealer sells painted urns and pots, panel paintings, and","painted marble sculpture.  Goldsmiths, blacksmiths, and tinsmiths have their own","row of stalls, noisy with hammering.  Fashions for sale","include traditional Greek chitons and himatia, shorter tunics more fit for Egypt,","Roman togas (which are like chitons but simply draped instead of fastened—how crude!) and ","even saris and other garb from Eastern lands.  Anything you may desire","can be had for a price in Alexandria.","","Your eye is drawn to the exotic first, but as you take in more of the city, you see that","it is not so dissimilar to your hometown of Cyrene.  Like Cyrene, Alexandria is a Greek","city, and the faces in the windows of the houses you pass are Greek:  dark and often curly hair,","olive skin, and dressed mostly in conservative, long chitons, despite the heat of summer.","","But there are hints that these Greeks have become a little different from their peers","in Athens.  There are more women on the streets, suggesting their greater freedom.  ","Both men and women wear chitons that are draped over just","one shoulder instead of two, possibly because of the heat, though the women still preserve their modesty","through the careful use of pins.  The cuts for both genders are above the knee, which would","be scandalous on a woman back home.  The women wear more makeup than the women back in Cyrene—many of","the Greek women you pass have dark rings of kohl around their eyes.","You are also somewhat surprised to see Greeks entering the Egyptian Temple of Isis—you","had heard that Egyptian mysticism was popular with some Greeks, but you had not yet seen it firsthand.","","You also see Egyptians on the street bearing palanquins and running messages.  ","Though not so dark as the Nubians', their skin is dark enough that there could be no mistaking them","for Greek.","Some wear Greek chitons and himatia, but many continue to wear their traditional garb:","a simple linen wrap about the waist for men, and a dress with straps for women.","The Egyptian women wear heavy makeup, and the men often shave their heads.","You have heard that most of the Egyptians live in a slum in the western part of the city, where","the old Egyptian village of Rhacotis once stood.  You wonder how they feel about their","conquest by Alexander now—whether the added prosperity can make up for their subjugation.","Probably not.","*page_break","","Tensions with the Egyptians aside, Alexandria has always struck you as remarkable","and full of promise.   It is hard to believe that such a huge metropolis was founded less than","a hundred years ago.  Had Alexander the Great envisioned just how popular the city would become,","as his workers drew the outlines of its wide and straight boulevards in flour along the ground?","When birds came to eat the flour, Alexander's soothsayer claimed it was a sign that","Alexandria would feed the world; whether prophecy or astute analysis, this is certainly coming","to pass.  But had the soothsayer or Alexander ever foreseen that the city would become","Alexander's final resting place, or that his death would come at such an early age?  And did Alexander's clever general","Ptolemy know how valuable the city was","when he decided to hole up in Alexandria and let the rest of Alexander's former generals fight","over the rest of the empire?","","\"What do you think?\" Berenice asks as the honor guard leads you to the palace.","","\"Oh, I've been here before,\" you say.  \"When I studied at the Musaeum.","But I have always loved Alexandria.\"","","Berenice grins at your answer.  \"All right.  Why?\"","","*fake_choice","    #\"This is the one place in the world where people of all nations seem to get along.\"","        *set idealist %+10","        \"They seem to get along, yes,\" Berenice says.  \"But make no mistake, there is","        still plenty of bile that could one day turn into blood in the streets.  We","        are careful to appease the Egyptians in what ways we can.\"","    #\"This is the center of all knowledge in the world.\"","        *set elitist %+10","        \"Ah, fair enough,\" Berenice says.  \"I had thought something about the city might","        impress you, but of course you care only for knowledge.\"","    #\"This is the beginning of a great empire.\"","        *set idealist %-10","        \"A great empire? Perhaps,\" Berenice says.  \"But even the great Alexander's empire","        fell to pieces without its great leader to sustain it.  We are one of those pieces,","        and we don't forget that we could fall even further in stature.  That is why","        it's so important that you tutor my son when he is born.\"","","Berenice stops for a moment, forcing the honor guard to stop as well.  \"Listen, this is","important,\" she tells you.  \"Once my son is born, your opinions will no longer be idle","chatter.  He must learn from you how to be a good ruler.  Whether you favor the elites","or the populace, whether you are an idealist or a pragmatist, he may come to mirror","the opinions of his tutor.  So choose wisely.\"","","*fake_choice","    #\"I will.\"","        Berenice nods.  \"Good.\"","    #\"I should hope I will teach him to think independently enough to have a mind of his own.\"","        Berenice nods.  \"True enough.\"","    #\"If he hangs on my every word, I will be pleasantly surprised.\"","        Berenice sighs.  \"True.  I imagine him an obedient son, but he could well ignore","        much of what either of us says.\"","","You continue with Berenice and your guard to the palace, a giant marble building with","columns in the Greek style supporting a portico with an elaborate frieze.","Coming closer, you see that the frieze depicts some kind of elaborate story involving","both Egyptian and Greek gods founding the city.  It seems early to create such myths, with","the city less than a hundred years old, but so be it.  You walk through a large","courtyard, between pools stocked with exotic fish.","","What do you think of this palace?","*fake_choice","    #When wealth creates beauty and knowledge, I approve.","        *set elitist %+10","        You have no problem with a society that creates wonders.","    #The wealth that built this place should have been used to feed the poor.","        *set elitist %-10","        You're skeptical of Ptolemy III's priorities—surely there were more important","        matters to spend the treasury on than this giant building.  You may not","        be able to bring it up to Ptolemy, but perhaps you could mention it to his son.","    #Honestly, I'm thinking about math and have trouble paying attention to my surroundings.","        You often daydream about mathematics when nothing else grabs your attention","        in your environment, and this is what you're doing even now, imagining ways to","        calculate whether numbers are prime.  It's good mental exercise, if nothing else.","        *set techne +1","    *if (evil) #One day, all this will be mine.","        You smile to yourself.  [i]Patience, ${name}.  Patience.[/i]","","You enter the palace through giant copper doors three times the height of a human being, a","marvel of engineering.  Inside, you find Ptolemy III seated on his golden throne, an","empty golden throne beside him.  Ptolemy is a lean, strong-looking king, and he wears ","a golden laurel wreath and an indigo chiton, remarkably simple for such a powerful man.","The thrones are flanked by two impassive royal guards bearing spears and shields.","","When he sees Berenice, Ptolemy III breaks into a wide smile and gets up from his throne.","\"Berenice!\"  He opens his arms, and Berenice runs to him.  They embrace, and he whirls her","around as if she were no weight at all.","","\"Thank you for coming, ${name},\" Ptolemy III says as the two monarchs take their seats.","*if (not(pirateFail))","    \"My guards will see that your possessions reach the right place.\"","*else","    \"I would instruct the guards to move your possessions to your room, but it seems you","    come with just the clothes on your back.  As does my wife.\"  He seems displeased.","","    \"We had trouble with pirates,\" you say.","","    \"It was my fault,\" Berenice says.  \"I suggested we parley.\"","","    Ptolemy frowns.  \"I suppose negotiation is not our new librarian's strong point, then.\"","*gosub space","\"You mentioned in your letter that I could name anything and you would do it,","if I agreed to be your unborn son's tutor,\" you say.","","\"Yes,\" Ptolemy says.  \"What is it you wish?\"","","*fake_choice","    #\"I accept on the condition that you provide a stipend for Archimedes to come visit.\"","        *set arch_rel %+20","        *set techne +2","        \"Archimedes?\" Ptolemy says.  \"The inventor from Syracuse?\"","","        \"We have been friends for a long time, and I hope to see more of him.\"","","    #\"I accept on the condition that you make it very clear to your son that my word is law.\"","        *set ptolemy_4_rel %+20","        \"He must ultimately take orders from me,\" Ptolemy III says, suddenly suspicious.","","        \"Of course,\" you say.","        *if (not(evil)) ","            *set petty %-15","            \"But you will also want to spoil him, because you are","            a loving father.  You will want to give him everything.  So when I say he","            must not overindulge, it will be important that he believes me.\"","        *else","            *set petty %+ 5","            \"I would never question your authority.\"  [i]Only undermine it.[/i]","    #\"I accept on the condition that I get plenty of time and resources for my own studies.\"","        \"What sort of studies?\" Ptolemy asks.  \"What do you need?\"","        *fake_choice","            #\"Inventions.  I would like my own workshop.\"","                *set techne +2","            #\"I would like access to cadavers, to further my knowledge of medicine.\"","                *set medicine +2","            #\"I want a small private library with copies of the great orators' works.\"","                *set rhetoric +2","    #\"I accept on the condition that you change the laws that treat Egyptians unequally.\"","        \"We mostly allow the Egyptians to operate by their own laws,\" Ptolemy III says, looking skeptical.","        \"They are the laws of Rhacotis, the village that stood here before Alexandria.\"","","        \"The laws of Rhacotis do not serve them well in Alexandria,\" you say.","        \"Let them hire lawyers.  Let them gather on the same hills as the Greeks for jobs.","        Reduce their tithes to the temples.  You will find this all is for the good of the city,","        I guarantee it.\"","        *comment +2 for stat of choice is a big deal, so this should be good.","        *set egypt_unrest %- 25","","\"Very well, it will be done,\" Ptolemy says.  \"The guards will show you to your quarters.","Welcome to Alexandria.\"","*return","","*comment ————Utilities———-","","*label space","","*return",""], "labels":{"ontheboat":24,"intro":43,"motivation":53,"namechoice":145,"nameentry":164,"sosibius":174,"sosibiusanswers":200,"piratesboarding":337,"restofpirateschoice":418,"nicknamechoice":558,"inthecity":626,"space":902}}