{"crc":59754316, "lines":["*image chap4.png center Chapter Four: The Education of a Prince","","*if (not (primary_caretaker = \"you\"))","    Though you managed to avoid taking full responsibility for Ptolemy IV when he was young,","*else","    Though you already take care of Ptolemy IV for much of the day,","it eventually becomes clear that he is old enough","to begin a proper education.  You begin to spend many more hours","with the boy, who approaches his schooling with","*if (ptolemy_4_rel < 50) or (petty > 50)","    trepidation and loathing.","*else","    eagerness and delight.","","*comment Leap Day - P4 is 7","*set year 238","Regarding his son, Ptolemy III is both loving and aloof—he enjoys summoning you and the boy","into the throne room to watch the proceedings, but he then proceeds to mostly ignore his son","as he deals with matters of state, leaving you to whisper explanations to the child.","For his own part, the young Ptolemy IV never speaks to his father directly unless spoken to,","but instead watches the man in awe.","","Occasionally, Ptolemy III tests you a bit to see what kind of education you are giving his","child.","","\"I declare you guilty of counterfeiting,\" Ptolemy III tells a kneeling Egyptian man, \"and","you shall make reparations by becoming indentured to my mints for one year.","You may be paid for your work thereafter.  You are skilled, but you will use that skill","for me now.  Repeat your crime and you will be executed.","Dismissed!\"  As the shaven-headed man bows and departs, Ptolemy III signals","to his guards to hold up the Greek petitioner at the entrance to the throne room.  \"${name}, your turn.  Come forth.\"","","You come before the throne.  Ptolemy IV hesitates, but you signal to the boy that he may follow.","The seven-year-old hides behind you.","","\"I have read your proposal for adding an extra day to the year every four years,\" Ptolemy III","says.  \"Your explanation makes perfect sense to me.  But I am curious:  how would you suggest","I convince the people of this plan?  A year that changes its length—it's a very strange idea,","don't you think?\"","","\"Well—\"","","Ptolemy holds up his hand.  \"Don't try to convince me,\" he says.  \"Tell my son why this is","necessary.  If he understands you, it is an explanation the people will understand.","If he doesn't, well…I shall try some different approach.\"","[i]And I'll consider hiring a more clever tutor[/i], seems to be his","unspoken implication.","","You look down to young Ptolemy IV, who gives you a pleading look:  he surely wants you to go","easy on him.  Ptolemy III, meanwhile, watches you with the keen interest of a Musaeum scholar","watching an experiment.","","Ptolemy IV has not yet shown any aptitude for understanding the natural world.  And he is only seven.","You can think of some clever things to say that don't involve complex explanations.","*choice","    #I explain to Ptolemy IV that the length of a day does not divide the length of a year evenly.","        *set idealist %+10","        *if rhetoric >= 4","            You explain to young Ptolemy IV that the natural year is 365 1/4 days long, and that","            there is no reason that the length of a day, which is the time from noon to noon,","            should divide the length of the year, which is the time from solstice to solstice.","            (You consider relating these concepts to the movement of the earth through space,","            and explaining Aristarchus's heliocentric theory, but decide that would be a bit","            too much for a seven-year-old.)  You spend some time explaining the concept of","            \"evenly divides,\" which is core to your argument and advanced for the young boy.","            You are a skilled teacher, able to convey these complex ideas","            in simple metaphors, and Ptolemy IV nods with genuine understanding.","","            \"So you understand what ${name} has told you?\" Ptolemy III says.","","            \"Yes, Father,\" Ptolemy IV says, and the child begins to launch into the same","            explanation you gave.","","            Ptolemy III waves this away.  \"That's very good, son,\" he says, and Ptolemy IV","            falls silent, beaming at the praise.  \"Well, ${nickname}, it looks","            as though I have underestimated my son, and probably the people as well.  Scribe","            that explanation on a scroll for me within the month, and I will decree","            the longer year on a stele that will stand until the empire falls.\"","            ","            From that point forward, Ptolemy III tests you less and trusts you more.","            *set ptolemy_3_rel %+20","            *set ptolemy_4_rel %+10","        *else","            \"Well, the length of the year is determined by how long it takes for the Earth","            to go around the sun—or for the sun to go around the Earth, but that is","            probably not how it works,\" you say, and you realize from Ptolemy's petrified","            expression that you have already lost him.  You press on:  \"Whereas a day","            is how long it takes for the earth to make one revolution on its axis, like this.\"","            You spin in place, but Ptolemy's blank look suggests this move on your part","            only comes across as bizarre.","","            \"Did you follow any of that, Four?\" Ptolemy III asks with an arched eyebrow.","","            Ptolemy IV says nothing, desperation and fear in his eyes.","","            \"Enough,\" Ptolemy III says, waving away this waste of his time.  \"It is as I thought:","            impossible to convey to the general public.  We shall just invoke the gods.","            Serapis said it must be so, Dionysus and Osirus agreed, and so forth.","            It is still a necessary and good idea.\"","","            Ptolemy III seems only mildly disappointed in you, as he did not really expect","            a lucid explanation.  But Ptolemy IV is sullen for weeks afterwards","            because you humiliated him in front of his father.  Chastened, you resolve to spend more","            time working on your skill at explaining complex concepts.","            *set ptolemy_3_rel %-5","            *set ptolemy_4_rel %-10","            *set techne +1","            ","    #I tell Ptolemy IV that the length of the year shall change because Ptolemy III wishes it, and that his father is wise.","        *set elitist %+5","        \"Your father is changing the length of the year itself,\" you tell Ptolemy IV.","        \"If all obey him, they will find that their harvests are better timed year after year,","        and the seasons will come more regularly.  All this because Ptolemy III is a wise man","        who knows the will of the gods.\"","","        Wide-eyed Ptolemy IV nods, eager to accept an explanation that portrays his father","        as wise and all-powerful.","","        Ptolemy III chuckles.  \"Clever, ${name}.\"","","        \"As you say, explanations must be aimed at what the audience is ready to hear,\"","        you say.","","        Your flattery pleases the elder Ptolemy, and avoids any humiliation for the seven-year-old.","        *set ptolemy_3_rel %+10","    #I tell Ptolemy IV that I have suggested adding a new day to the calendar every four years in his honor.","        *set idealist %-5","        \"We are adding a new day to the calendar in your honor,\" you tell Ptolemy IV.","        \"As you are the fourth Ptolemy, we shall celebrate it every four years.\"","","        Ptolemy IV beams.  \"Really?\"","","        \"It was ${name}'s suggestion,\" Ptolemy III says drily.","","        Ptolemy IV looks at you admiringly.  \"I get my own day?\"","","        \"Assuming the king approves,\" you say.","","        \"Why not?\" Ptolemy III says airily.  \"I can deny my son nothing.\"","","        It may well go to Ptolemy IV's head to think that the leap day was invented for him.","        But he loves you for it.  You also think he may be more likely to","        continue the observation of the extra day when his father is gone if he thinks it","        is about him.","        *set petty %+5","        *set ptolemy_4_rel %+20","","        Ptolemy III now thinks that you spoil his son—but he does the same, and he can't fault you","        for it.","","*page_break","","*comment Zoo - P4 is 9","*set year 236","","More years pass, and your education of Ptolemy IV continues.  You aren't the only one","intent on educating Ptolemy IV: Sosibius often insists","on holding \"lessons\" of his own for the now nine-year-old child.  Sosibius's lessons have included","wine tastings, fittings for fancy tunics, and how to properly eat oysters.","*if petty < 50","    Ptolemy IV often complains ","    *if ptolemy_4_rel > 50","        that, even though he likes you,","    *else","        that","    your lessons are not nearly as entertaining as Sosibius's lessons.","*else","    Ptolemy IV accepts Sosibius's attention politely, but his tastes don't seem to naturally","    tilt toward the Epicurean in the way Sosibius's do.","","You decide that your own lessons could be a little bit more enjoyable, so one","lovely summer day, you take young Ptolemy IV to Alexandria's zoo,","accompanied by a pair of royal guards. ","Elephants, baboons, giraffes, rhinos, and ostriches loaf in the midday sun, in large hay-strewn pits surrounded by low stone walls.","Travelers from foreign lands marvel at the beasts, murmuring to each other in Latin,","Aramaic, and Hebrew, along with other languages you can't identify.  Other","children run rampant throughout the zoo, chased by tired-looking Greek mothers.","","Ptolemy IV loves the trip, and he especially seems in awe of the crocodile, which sits","at the bottom of a particularly deep and muddy pit.  Bones are strewn about the animal's","messy lair, suggesting that feeding time consists of lobbing whole animals into the pit.","You recall hearing that a Musaeum scholar died the previous year in his attempt to collect","crocodile tears.  You think someone from the Musaeum probably collected the scholar's bones, but ","perhaps not; perhaps some of those bones are his.","","\"I want it,\" Ptolemy IV says, all agog as he leans over the low stone wall.  \"Can I have it?\"","","As if vaguely aware it is being talked about, the crocodile flicks its eyes up at you,","then yawns toothily.","","\"Well, it belongs to the zoo, which belongs to the Musaeum, which belongs to ","your father,\" you say.  \"So in a sense, it is yours already.\"","","\"I want it to be all mine,\" Ptolemy IV says.  \"I don't want to have to leave the palace to","see it.\"","","That could no doubt be arranged.  In fact, you personally could probably buy the crocodile from ","the Musaeum, which will probably part with it readily after the unfortunate eaten-scholar","incident, and present the crocodile to the prince as a gift.  Such a move would ingratiate","you to Ptolemy IV. On the other hand, if the young prince wanted to pull strings, perhaps he","could get the crocodile for free, and get you an animal as well.","","Or perhaps it would be nice to continue to let the public enjoy this crocodile, which does seem","content where it is.","*choice","    #I will buy the crocodile from the zoo, and present it to Ptolemy IV as a gift.","        \"I think that can be arranged, young prince,\" you say.  \"Let's talk to some people.\"","","        *gosub zookeepers","","        With Ptolemy IV in tow, you ask how much it would be to take the crocodile,","        whose name is apparently Sobek, off the Musaeum's hands.  The price is steep,","        but you can afford it, and you make a deal then and there.  You think of it as","        an investment; it would be good to be more highly regarded by the heir.","","        It takes about a week for royal slaves to dig a pit at the palace that can hold Sobek,","        and a brave royal guardsman loses his life in trying to extract the beast from","        its pit at the zoo.","        But eventually, Ptolemy IV has a crocodile of his own, and he has you to thank for","        it.  Let's see Sosibius top that!","        *set petty %+5","        *set ptolemy_4_rel %+20","","    #I encourage the prince to commandeer some zoo animals for us—one for him, one for me.","        *set elitist %+10","        \"You know, I would like an animal as well, young prince,\" you say.  \"Let's go ask","        for some animals.\"","","        *gosub zookeepers","","        \"The prince wants a crocodile,\" you say.  \"The prince would like that very, very","        much.\"  You give the","        *if head_librarian","            director","        *else","            zookeeper","        a meaningful look.","","        \"I see,\" says the","        *if head_librarian","            director,","        *else","            zookeeper,","        frowning.  \"I suppose the prince should have what he wants, shouldn't he.\"","","        Encouraged, you continue, \"And I would like…\"","        *choice","            #\"…a monkey.\"","                *set pet \"monkey\"","            #\"…a peacock.\"","                *set pet \"peacock\"","            #\"…a giraffe.\"","                *set pet \"giraffe\"","        \"As you wish,\" says the","        *if head_librarian","            director of the Musaeum.","        *else","            zookeeper.","","        Soon, the crocodile, whose name is Sobek, and your ${pet} take up residence at the","        royal palace.  Ptolemy IV enjoys his new pet, and often feeds Sobek himself,","        throwing small rabbits down the pit that was made for the beast in the courtyard.","        *set petty %+10","        *set ptolemy_4_rel %+5","","        You are very glad to have your pet ${pet} as well.  What did you want it for, exactly?","        *choice","            #I use it as an audience to practice speeches on.","                Indeed, your ${pet} is a very willing audience,","                *if pet = \"monkey\"","                    and it only rarely throws poop at you.","                *elseif pet = \"peacock\"","                    and you enjoy imagining that the eyes of its plumage are in fact","                    the eyes of an adoring crowd.","                *elseif pet = \"giraffe\"","                    and you always feed it a treat as a reward for poking its head in your","                    window.","                *set rhetoric +1","","                What do you name your pet?","","                *input_text pet_name","","                Though you suspect ${pet_name} cannot understand your speeches, you think","                your pet is affected a little by your body language, and that is important","                to practice, too.","","            #I was actually planning to dissect it to examine its anatomy.","                Your ${pet} proves highly instructional:","                *if pet = \"monkey\"","                    its body is very similar to a human's, and its dissection is far less","                    controversial.","                *elseif pet = \"peacock\"","                    you disprove the myth that peacock flesh does not rot after death,","                    and the grisly proof gains you more connections among the Musaeum's","                    anatomists and natural philosophers.","                *elseif pet = \"giraffe\"","                    you find that the beast has very thick heart walls, which presumably","                    help in pumping the blood all the way to its head.","                Though others might have simply used this opportunity to gain a pet,","                you feel you have gained valuable medical knowledge.","                *set medicine +1","                *set pet \"none\"","            #It's my pet!  I just play with it.","                Like the prince, you just want to have fun with your animal.  What do you","                name your ${pet}?","","                *input_text pet_name","","                You don't really ask anything of ${pet_name}, whom you allow to roam","                the grounds of the library dorms freely.  The beast especially likes","                *if pet = \"monkey\"","                    swinging on the branches outside your window and throwing poop at","                    passing scholars. ","                *elseif pet = \"peacock\"","                    seeing its own reflection in the pools outside the library as it struts","                    and fans its plumage.","                *elseif pet = \"giraffe\"","                    munching the leaves of the sycamore tree just outside your window, where","                    you can reach out and give its head a good scratch.","","                Now whenever Ptolemy IV begins one of his tutoring lessons, he first asks","                about ${pet_name}, and you ask about Sobek; and in this way, you bond.","                *set ptolemy_4_rel %+10","        ","    #I tell the prince that it would be better to share the crocodile with the public.","        *set elitist %-20","        *set idealist %+5","        You point to another family looking over the edge of the pit—a Greek woman in","        a long pink himation dress, and two boys of Ptolemy's age wearing very coarse","        brown chitons.  The boys push each other out of the way to get a closer look","        at the crocodile.  \"Look how excited they are,\" you say.  \"You wouldn't take the","        crocodile away from them, would you, Ptolemy?\"","","        *if petty < 50","            Slowly, Ptolemy shakes his head.  \"I guess not.\"","        *else","            \"But I want it!\" Ptolemy pouts.","","            *if (not(evil))","                \"An adult does what is right, and is not simply moved by wants.\"","","        You leave the zoo without acquiring any exotic animals, either for the prince or yourself.","        You think it is valuable to teach Ptolemy IV not to simply give in to his desires.","        You have passed up an opportunity to endear yourself to the boy, but not every","        nine-year-old whim must be granted.","        *set petty %-10","","*page_break","","*comment Skip this next scene if Nefertari is dead.  The Library of Thoth is her idea.","*if nefertari_dead","    *goto end_serapeum","","*comment Serapeum - P4 is 10","*set year 235","*temp offered_gift false","When Ptolemy IV is ten, you take him to the Serapeum to show him how the common people","obtain their books.","*if invented_auto_doors","    You light the brazier next to the temple doors that provides their power, and Ptolemy","    marvels as the heavy bronze doors swing open of their own accord.","    *set ptolemy_4_rel %+ 5","","As soon as you enter the Serapeum, something seems off.  It isn't the giant statue of","Serapis in the center of the hall, although the golden basket on the marble statue's head always","did seem like one of those peculiar things that made sense only to Egyptians.  There are more","worshippers at the statue's feet than you remember, but then, it would only make sense that the","cult would grow in popularity over time.","","No, the aberration is that you're quite certain the Serapeum should have more books than when you","last visited, but it seems there are fewer scrolls on the shelves than before.","","\"What's the matter?\" young Ptolemy asks.","","*if serve_nefertari","    *comment Somewhat special case, and what follows is too complicated to modify,","    *comment so we'll pull this out into a separate choice","    *gosub two_thieves","    *page_break","    *goto end_serapeum","","*temp wanted_to_help false","\"This library is not quite what it used to be,\" you say.  \"Here, let me introduce you to the high","priest.  Perhaps a chat with him will be educational for both of us.\"","","The high priest is the same old Egyptian priest you met ten years ago.  When you see him,","he immediately looks nervous.","","\"Allow me to introduce His Highness, Prince Ptolemy IV,\" you say, and child and priest","make the necessary noises of acknowledgment.  \"Now, would you care to tell me where all the","inventory has gone?\"","*page_break","","\"It's a public library,\" the priest of Serapis says nervously.  \"Sometimes the public wanders","off with works.  There's little we can do to find them.\"","","\"Show me the logs,\" you say, and the priest nervously complies.  You note that the vast majority","of the missing books are checked out under names that sound fake, like a foreigner's idea of","what a Greek name should be:  Kolomenolos.  Aristarchades.  Hermezeus.","","\"Sir, what really happened to these missing books?\" you say, glancing up from the logs.","","*comment egypt_unrest as a proxy for whether Egyptians are friendly to MC in particular.","*comment Confession if friendly, open hostility if not","*if egypt_unrest < 50","    *if priest_talked_about_thoth","        \"I decided to do what you did not,\" the priest confesses.  \"You","        recall that Nefertari wanted books for her library, the Library","        of Thoth.  I have been providing her with those books.\"","    *else","        \"There's another library,\" the priest confesses.","        \"The Library of Thoth.  It lives on one of Nefertari's ships.  I've been giving them","        scrolls, many scrolls.  The Serapeum caters mostly to Greeks, and Nefertari dreams","        of the Egyptians being equally well educated.\"","    He implores you with open hands.  ","    *if priest_talked_about_thoth","        \"I know","    *else","        \"I have heard","    you are a friend to the Egyptian people.  Surely you can spare this knowledge for us.\"","*else","    The priest takes a moment to compose himself.","    \"It would appear some foolish Greek patrons have lost a lot of books,\" he says softly","    but firmly.  He then smiles very slightly.  \"Enough to start their own library, even.\"","    Noting your expression of surprise, he scowls.  \"Rest assured, nothing you do to [i]me[/i] can","    bring those scrolls back.\"","","\"This man is stealing from my father!\" Ptolemy says in disgust.  \"We must report him at once!\"","","You applaud the boy's perception, even though it does limit your options.","","*comment Lean toward all choices building to unrest, some more than others.","*comment Current balance gives many ways to reduce, few ways to raise.","*temp supplyText \"more scrolls\"","*if invented_copier","    *set supplyText \"one of my copying devices, so they need not steal\"","*choice","    #The penalty for theft from the temples on such a grand scale is death.  Let it be so.","        *gosub kill_that_priest","    #I will tell Ptolemy IV to stay quiet about this while I investigate why the Serapeum isn't good enough for the Egyptians.","        You separate yourself from the Egyptian priest and drag Ptolemy to the alcove","        for scrolls on mathematics, which is characteristically devoid of patrons.","        \"Don't go telling your father about this,\" you say.  \"I need to find out what's going on.\"","        *set ptolemy_4_rel %- 15","","        *if ptolemy_4_rel >= 55","            Ptolemy IV looks horrified; he's never really had to choose between trusting","            you and serving his father.  It clearly makes him uneasy.  But he silently nods.","","            Over the next few days, you research the rules of the Serapeum, and how they might","            treat Egyptians and Greeks differently.  The rules on the books appear to be the","            same for both, but the more you think about the rules, you realize that Egyptians","            in particular would frequently find themselves ineligible to check out books.  Patrons","            are expected to own property, so that they can be found when books are overdue;","            to read and write Greek; and to have deposits to leave with","            the library; all of which would be harder for Egyptians.  And of course, the","            Serapeum's holdings are mostly Greek, with the few Egyptian holdings now stolen.","","            The rules could change—you","            *if head_librarian","                are Head Librarian, ","            *else","                do have the ear of Ptolemy III,","            after all—but the idea of opening the Serapeum","            to absolutely everyone makes you a bit nervous, for one thing.  It simply isn't how things are done.","            And then there's still the question of what to do about these scroll thieves;","            given the acquisition methods of the Great Library, you feel a bit hypocritical in","            pursuing them.","            *choice","                #Change the borrowing rules, and do not punish the scroll thieves.","                    *gosub weak_rule_change","                #I tell the priest the library policies will change only if the missing scrolls come back.","                    You return to the Serapeum without Ptolemy IV.  The priest is conducting","                    a ceremony worshipping Serapis—he chants in","                    *if serapis_believed","                        ecstatic","                    *else","                        bored","                    tones while believers prostrate themselves before the giant statue.","                    He makes you wait.","","                    \"Serapis is with you, go in peace,\" he tells his followers.  \"${name},","                    what do you need?\"","                    ","                    *gosub offer_to_the_priest","                        ","                #We will not change our policies to better serve thieves.  The priest can die.","                    You decide it is time to tell Ptolemy III about the scroll thieves.","                    To show Ptolemy IV that you were going to tell his father [i]eventually[/i],","                    you let him tag along to the throne room.","                    *set ptolemy_4_rel %+ 10","","                    *if serapis_believed","                        *gosub p3_serapis_believed","                    *else","                        *gosub p3_no_serapis","","        *else","            \"You want to make me…[i]conspire[/i] with you!\" Ptolemy IV says.  \"No!  Never!","            I'm telling Father!\"","","            The prince takes off through the Serapeum and out","            *if invented_auto_doors","                your automatic doors, still slowly resetting themselves,","            *else","                the bronze double doors","            at a run.  Not wanting to get in trouble for conspiracy [i]and[/i] losing Ptolemy,","            you run after him, and you manage to convince him to slow down only on the condition that","            you immediately turn yourself in to his father.","","            When you do reach Ptolemy III in his throne room, Ptolemy IV immediately bursts in, blurting,","            \"A-priest-is-stealing-scrolls-and-${name}-told-me-not-to-tell-you!\"","","            \"Interesting,\" Ptolemy III says.  \"And what actually happened, librarian?\"","","            So much for investigation without the king's knowledge.  \"The priest there is stealing","            scrolls, perhaps for some kind of separate Egyptian library.  I thought I should","            investigate further before bringing the matter to you.\"","","            *if serapis_believed","                \"I thought that priest was a devout believer in Serapis,\" Ptolemy III says.","","                \"I believe I convinced him when I saw him ten years ago,\" you say.","","                *comment save_the_faithful above, belief in Serapis saves this guy","                *gosub save_the_faithful","            *else","                \"I believe this is the same priest from years ago who still does not truly","                believe in Serapis, correct?\" Ptolemy III says.","","                \"I can't speak to that,\" you say, \"but the man remained an unbeliever at","                the end of our first interaction, I think.\"","","                \"Well, obviously this priest cares nothing for the unity that the Serapeum","                stands for,\" Ptolemy III says.  \"His wealthy family has protected him for too","                long.  I will see him dead.\"","","                \"But we could take this opportunity to find out why the Egyptians think","                the Serapeum does not serve them well.  Egyptian renters, for example, can't—\"","","                \"I am not interested in explaining crimes,\" Ptolemy III says dismissively.  \"Crimes come from","                the evil preying upon the weak.  We shall kill the evil and strengthen the weak.","                Now, this matter is concluded.\"","","                As you walk out of the throne room, Ptolemy IV imitates his father:  \"Kill the","                evil and strengthen the weak!  Kill the evil and strengthen the weak!\"","                *set petty %- 5","","                The priest's execution a week later sends an uproar through Alexandria.  Riots","                break out in the Egyptian quarter, leading to arson and vandalism across the city.","                And the borrowed scrolls never come back.","","                *set egypt_unrest %+10","    #I am sympathetic to the Egyptians wanting their own library.  I will supply them with ${supplyText}.","        *set idealist %+ 15","        *set elitist %- 15","        *if invented_copier","            \"We'll be right back,\" you tell the priest.  \"Come, Ptolemy.  Race you to","            the Great Library.\"  You take off, hoping Ptolemy IV will follow.","","            \"But we're supposed to [i]kill[/i] thieves!\" Ptolemy IV says as he runs after you. ","            ","            As you retrieve your copying device from the Great Library, you explain your","            plan to Ptolemy.  \"The scrolls are being stolen because the Egyptians","            want their own library,\" you say.  \"But there's no need to fight over scrolls","            when they can be readily copied.  Surely the theft will cease once they","            have access to this technology.\"","","            \"Those scrolls are my father's,\" Ptolemy IV says stubbornly.  \"We're supposed to","            kill people who steal from my father.\"","","            When you return, you present your device to the priest.  \"It's to help your","            people copy scrolls, so that you need not steal them.\"","            *set offered_gift true","","            *if serapis_believed","                \"I thought I would receive a sign from Serapis today,\" the priest says.","                \"The Greeks wish to help, but they don't know how.  You are their misguided olive","                branch.\"","","                *if head_librarian","                    \"I am the head librarian,","                *else","                    \"I am an inventor,","                and I am offering you a gift.\"","","                The priest shakes his head.  \"This will not help us.  We need scrolls in","                Egyptian hieroglyphics.  Your device copies, but preserves the Greek.  It","                is useless to us.  Our translators cannot come into the city; they are","                wanted men and women, all of them, for working with Nefertari.\"  His eyes","                turn heavenward.  \"But one day, all shall be one!\"","","                \"If you want unity, must you divide the scrolls of the library?\" you say.","","                \"Only knowledge can set Egyptians and Greeks on the same footing,\" the priest says.","                \"And this library has many rules that prohibit the Egyptians from gaining that knowledge.\"","","                You suppose that is true, now that you think about it.  The Serapeum","                requires its patrons to demonstrate reading ability in Greek, in order to prohibit","                simple thieves from borrowing and reselling scrolls; borrowers must have a place of","                residence that is owned and not rented; and they must leave a deposit with","                the library.  You suppose all those things keep the Egyptians from","                borrowing.","","                \"Can we kill this guy now?\" says Ptolemy IV.","","                What will you do?","                *choice","                    #We will go to Ptolemy III and tell him everything.","                        *set ptolemy_4_rel %+ 5","                        You go to Ptolemy III and tell him everything you know about the missing","                        scrolls and the Egyptians' attempt to create their own library.","                        ","                        \"And Nefertari is involved, you said,\" Ptolemy III says, scowling on","                        his throne.","","                        \"The priest mentioned she was working with the translators,\" you say.","                        \"It seems entirely possible that this Egyptian library is her idea.\"","","                        \"Are we going to kill him, Father?\" Ptolemy IV says.","","                        \"No, we're going to kill [i]her[/i],\" Ptolemy III says.  \"I've put","                        up the delusions of grandeur of that pirate long enough.  The","                        priest can stay.  The fool may actually help to unite Nefertari's","                        former followers behind me.  But I will not suffer the existence","                        of an Egyptian queen.\"","","                        Over the next month, Alexandria goes to war against Nefertari.","                        Nefertari's fleet is small but agile, and it whittles away at","                        Alexandria's larger fleet.","                        *set alexandria_strength -1","                        Still, by the end of the month, Nefertari's ship is taken,","                        Nefertari is killed, and the books aboard—the stolen ones","                        and then some—are returned to the Serapeum.","                        The Library of Thoth is no more.","                        *set nefertari_dead true","                        *comment Extra books!","                        *set alexandria_knowledge +1","                        ","                        At the same time, Ptolemy III also orders the Serapeum","                        to adopt new policies that are friendlier to the Egyptians.","                        The priest of the Serapeum helps more Egyptians become patrons","                        of the library.  Overall, you and Ptolemy have succeeded in","                        showing the Egyptians that rebellion is not worth it.","                        *set egypt_unrest %-20","","                        ","                    #I will see to it that the Great Library and Serapeum change their rules and leave the thieves alone.","                        *gosub weak_rule_change","                    #I tell the priest that we will only change the rules if the scrolls come back.","                        You reason that the only way the scrolls will come back is through","                        bargaining.","                        *gosub offer_to_the_priest","            *else","                The priest scowls and bats the device out of your hand.  It falls to the floor with","                a clatter.","","                \"Do you think all Egyptians are ignorant?\" he says angrily.  \"Your invention is","                ten years old—do you think it is new to us?  Do you think we have no scholars?","                [i]Do you think this device translates Greek into Egyptian[/i]?\"","","                \"You are impudent,\" Ptolemy IV announces.  \"My father could have you killed.\"","","                \"I am tired of your arrogance, both of you,\" the priest says.","                \"Our culture is thousands of years old, and you condescend to us","                with your worthless inventions and made-up gods.  Do what you will.","                The [i]true[/i] gods will protect me.  All hail Thoth.\"  He says","                this loudly enough that his worshippers look up from their prostration in","                puzzlement.","","                It seems the priest's disbelief in Serapis has fermented and become","                a renewed faith in the destiny of Egypt.  What will you do about him?","                *choice","                    #I tell Ptolemy III about him.  He must die.","                        You go with Ptolemy IV to the palace, and get an audience with Ptolemy III.","","                        *gosub p3_no_serapis","                    #I try to win over the Egyptians by presenting some scrolls to the priest as a gift.","                        *gosub giving_away_scrolls","","                        *gosub p4_wins_serapeum","                        ","                    #I tell Ptolemy IV that we had best forget all this happened.","                        \"Let's just forget this ever happened,\" you tell Ptolemy IV.","                        \"Sorry to bother you, priest…you know, I never learned your name.\"","","                        \"Yes, aren't you an incurious twit,\" the priest says.  \"Goodbye.\"","","                        A week passes, and you think at first that you have heard the end of this.","                        *gosub p4_wins_serapeum","        *else","            *gosub giving_away_scrolls","","            *gosub p4_wins_serapeum","","*page_break","*label end_serapeum","","*comment Archimedes - P4 is 11","*set year 234","When Ptolemy IV is eleven, you travel with the boy to the kingdom of Syracuse on the","island of Sicily, where your friend Archimedes lives.  Ptolemy III has declared that it","would be useful for the boy to sit in on another monarch holding court, to see how things","could be done differently.","","After a long sea voyage across the Mediterranean on a boat not much larger than Ptolemy IV's","room in the palace, you arrive at Syracuse, a city-state on the eastern coast of the island of","Sicily.  Archimedes greets you on the docks with a great hug. You had wondered when","Archimedes last visited whether he looked rumpled and bedraggled on account of having","traveled so far, but you here confirm your suspicion that his tunic always looks like that, just","like when you were students at the Musaeum.  He smells clean, though.","","\"It is so good to see you, ${nickname},\" Archimedes rumbles.  \"The boy has certainly","gained some mass as well.\"","","*if petty > 50","    \"This island is dumb,\" Ptolemy IV says.  \"Syracuse looks small.  And boring.\"","","    \"Syracuse is indeed small, but there are mysteries enough in any patch of earth to last","    a lifetime,\" Archimedes says gravely.  \"Now, come along.\"","*else","    \"Hello, Archimedes,\" Ptolemy IV says.  \"Have you invented anything recently?  ${name}","    talks about your inventions all the time.\"","","    \"Some numbers,\" Archimedes says gruffly.  \"I was trying to estimate the number of grains of sand","    that would fill the universe, and there wasn't a number big enough to describe it.","    So I invented some numbers last week.\"","    ","    \"Sand in the universe…\" Ptolemy IV has a wondering expression.","    ","    \"I know, probably not what you were hoping for,\" says Archimedes.  \"Now, come along.\"","*page_break","","King Hiero's throne room is much smaller than the throne room of Alexandria—in fact, you","think the young prince's bedroom back in Alexandria may be bigger.  King Hiero II himself","reminds you of a bird—he perches on his gold-leaf throne with his knees up, and his slightly long","nose enhances the avian impression.  When you come in, he wears no crown on his balding head,","though he wears fine robes and carries a silver orb-tipped scepter.","","\"Ah, the Alexandrian prince,\" King Hiero says in a nasal voice.  He waves his scepter.","\"Welcome, welcome.  Observe and learn.  Now, Archimedes, have you solved the problem I posed","to you?\"","","Archimedes produces King Hiero's golden crown from his satchel.  \"I have, sire,\" he says,","gruffly.  \"The crown is not pure gold.\"","","\"I knew it!\" King Hiero says, waving his scepter triumphantly.  \"And how did you discover this?\"","","You think Archimedes rolls his eyes, though you can't be sure.  \"Well, I knew the density of","gold and silver would be different, so I…\"  Archimedes launches into a complex explanation of the","apparatus he used, which involved putting the crown and a reference sample of gold on some scales, then submerging the samples in bathwater.","","\"Wait, stop right there,\" King Hiero says, taking the crown from Archimedes.","\"Do you mean you were doing all this in the bath?\"","","\"Yes,\" Archimedes says.  \"I mean, as long as I was doing the experiment in my bathtub,","I thought I may as well take a bath at the same time.  That's only efficient.\"","","King Hiero laughs at this.  \"I can just imagine great Archimedes, cogitating with his machines","in the bath!  And when inspiration struck, I'm sure you leapt out of the bath and said, 'Eureka!'\"","","\"I didn't say that's what happened,\" Archimedes says gruffly.","","\"Of course,\" King Hiero says.","","\"I don't say 'eureka' that often,\" Archimedes says.  He looks to you for confirmation.  \"Do I?\"","","You shrug noncommittally.","","King Hiero grins.  \"Well, the story would be better if you said 'eureka.'  Anyway, go on.\"","","The conversation continues, and it becomes clearer that while King Hiero enjoys","teasing Archimedes, the two men have a real affection for each other.  The king asks","Archimedes about a number of official matters, such as the number of","ships to hire for the island's naval defense, or the goods that the city should ","try to obtain from merchants.  Archimedes acts as the king's advisor in everything from","agriculture to zoology.","","Near the end of the first day at court, Ptolemy IV whispers to you, \"I want an Archimedes.\"","","You wonder if you could convince Archimedes to come to Alexandria.  He does love Syracuse.","*choice","    #I will attempt to convince Archimedes to join the Alexandrian court.","        You arrange to go fishing with your old friend Archimedes so that the","        two of you can talk privately.  Your tiny dinghy goes out into the calm waters","        of the Mediterranean at dawn.  Your friend's fishing rod has a somewhat elaborate","        system of pulleys, but the rod he lends you is plain and simple.","        You cast your lines and wait.  You fidget and wonder","        how long you should wait before broaching your subject.  You find you can't wait long.","","        \"Come to Alexandria,\" you say.  \"You've been there; you've seen all the resources","        that would be available to you there!  I know this is your home, but think of","        all the good you could do if you were surrounded by like-minded scholars!\"","","        *if arch_rel >= 55","            Archimedes sighs.  \"I don't care much for scholars in general, but I've always","            liked you, ${nickname}.  I would not mind being around you more.\"","","            *if (not(euclid_dead))","                \"Euclid's nice, too, Archimedes,\" you say.  \"Did you have a chance to meet her?\"","","                \"She's a brilliant woman, but I wouldn't move to Alexandria for brilliance,\"","                Archimedes says.  \"I would for friendship.\"","","            \"You won't be disappointed, Archimedes,\" you say.","","            Archimedes regards you gravely.  \"Very well.  I will accompany you.\"","","            When Ptolemy IV's monthlong visit to Syracuse is done, Archimedes bids","            adieu to King Hiero and comes back to Alexandria with you.  Ptolemy III","            gladly hires the famous inventor, and gives him all the perks of a Musaeum","            scholar:  free room and board, access to the library, and a generous stipend.","","            At first, both Ptolemy III and Ptolemy IV are delighted with their new acquisition.","            *set ptolemy_3_rel %+5","            *set ptolemy_4_rel %+10","            *set petty %+5","            But Archimedes is only one among many of their treasures, and he never quite","            builds a relationship with the Ptolemies the way he did with King Hiero.","            You learn much about the ways of techne from Archimedes while he is in Alexandria,","            but he himself seems unhappy, and he does not produce inventions at his usual rate.","            *set techne +1","            *set arch_rel %-15","","            After a year of this, you pay a visit to Archimedes only to find that his","            dormitory room is unlocked and open.  Archimedes is gone, as are most of his","            things, though unreturned library scrolls still clutter the room.","            On his desk is a papyrus note:  \"Going home.  Sorry, ${nickname}.\"","","            You return the library scrolls for him, and it is years before you finally","            work up the nerve to write to him again.","        *else","            Archimedes sighs.  \"I don't think so, ${nickname}.  This is my home.\"","","            \"But think of the discoveries we could make together!\"","","            There's a tug on Archimedes's line, and he reels in his fish, turning a crank","            that makes all the pulleys along his line spin.  \"Plenty to discover everywhere,\"","            Archimedes says, grabbing a wriggling fish from the line.  \"I'd just as soon","            discover things at home.  Besides, you're pretty busy these days.\"","","            You think perhaps Archimedes is telling you that he is disappointed with the amount","            of time you two spent together on his last visit.  \"I'm sorry,\" you say.","            \"I could make time for you.\"","","            \"No, educating a ruler is important,\" Archimedes says.  \"You stick to that.\"","","            When you get back to the guest rooms of the palace, you tell young Ptolemy IV that","            Archimedes will not come back with you, because he loves his home of Syracuse","            too much.  Ptolemy seems a bit puzzled that such a small city-state could garner","            such loyalty from Archimedes, and at first he thinks you did not offer Archimedes","            enough money.","","            \"Archimedes doesn't care about money,\" you say.  \"This is his home.","            You are powerful, Prince Ptolemy, but you can't change that.\"","","            Ptolemy IV accepts this mild rebuke thoughtfully.","            *set petty %-10","","    #I will build an automaton Archimedes for Ptolemy IV, to impress him.","        Taking Ptolemy IV's request in a way he probably did not intend, you set out to","        make an automatic Archimedes that could impress the young prince.  You have no","        ability to make a thinking machine, of course, but you have seen other engineers","        at the Musaeum give carved statues the semblance of life through clever use of techne.","","        Using Archimedes's workshop, a former barn that is crammed with machines designed","        to help make other machines, you craft wooden arms, legs, hands, and a torso.  You","        spend rather a lot of time on the head, and the result is recognizable as Archimedes","        if only because of the giant beard.  You add joints to the arms and head, but not the legs,","        preferring stability for that part of the automaton.  Instead of walking—too hard—you","        decide the automaton will roll.","","        Then, the clever bit:  you know a technique whereby an automaton can seem to obey","        a simple series of instructions, at least for a very limited time.  Rope wrapped","        around a single axle can cause it to spin one way or the other—that is simple enough.","        What is more clever is that putting pegs at exactly the right places on the axle and","        wrapping the rope around these pegs will cause the axle to spin one way for a time,","        then the other, then the first way again.  Given a descending bag of grain that is pulling","        on the rope at a steady pace, the turning of the axle one way and then the other","        can be timed precisely.  And of course, with multiple gears, and multiple bags of","        grain pulling on multiple pulleys, a whole complex sequence of actions of an automaton","        can be performed in a programmed order.","","        When you are done, you tell Ptolemy IV you have a surprise for him, and you lead him into","        the workshop.  The Archimedes automaton, fully painted, stands in the center of the","        workshop, hunched forward a little, head bowed.  Ptolemy IV giggles, so you think","        he understands who the automaton is supposed to be.","","        \"Why does he have ropes all coming from him?\" Ptolemy IV says, his gaze following the","        ropes up to the rafters.  \"And what are those bags up there?\"","","        \"Watch,\" you say.  You give some of the ropes a tug.","","        *if techne >= 8","            The bags of grain begin to slowly descend from the rafters, and the automaton seems","            to spring to life.  It raises an arm as if to make a point, then brings its hand","            to its chin, as if lost in thought.  Then it raises its arm again: Eureka!","            Then it seems lost in thought again.","","            Ptolemy IV laughs in amazement.  \"What is this?  How…?\"","","            \"You wanted an Archimedes,\" you say with a grin.","            *page_break","","            The first sack of grain descends on a rope that tugs another sack of grain off","            a rafter, and the automatic Archimedes changes its actions.  Putting its hand","            to its chin, the wheeled automaton begins to roll one way and then the other,","            then back again—pacing.  ","","            \"It even rolls by itself!\" Ptolemy says, shocked.  \"Could you make some kind of","            automatic chariot with this?\"","","            \"Ah, no,\" you say.  \"The motive force comes from the falling sacks of grain.  You","            couldn't get very far.\"","","            A sack of grain tugs on another rope, triggering the final scene:  the Archimedes","            automaton rolls to one of Archimedes's own workbenches and begins to shove","            parts on the workbench one way, then the other, then the first way, then the second.","            Finally, a last tugged rope makes a sheet above the automaton unfurl to reveal the","            word \"EUREKA!\" painted on it.  The automaton triumphantly raises its hand one","            last time, then falls inert.","","            You imagined the sequence being longer, for all the work it took.  Still,","            Ptolemy IV seems positively thrilled.","","            \"Can you make me more of these when we get home?\" Ptolemy IV says excitedly.","","            \"Gladly,\" you tell the young prince.","","            The prince doesn't bring up trying to hire Archimedes again, which is just as","            well, because you think Archimedes loves his home.","            ","            Much of your time upon returning to Alexandria is spent on making further automata","            to amuse the prince.  Still, you think you've never succeeded so thoroughly in","            winning the prince's respect and admiration.","            *set ptolemy_4_rel %+25","            *achieve techno_archimedes","            *set invented_robo_arch true","","        *else","","            The bags of grain fall into the guide ropes in a tangle, and the weighed-down ropes","            bring the automaton crashing to the ground.  A sheet above a workbench in the corner","            unfurls, reading, \"EUREKA!\"  The head of the Archimedes automaton","            rolls up to Ptolemy IV's feet.","","            Ptolemy IV gives you a puzzled look.","","            \"That's…not what was supposed to happen,\" you say.","","            Ptolemy IV looks at the sheet, looks at the statue.  \"This was supposed to be","            a surprise party, kind of.\"","","            \"You could call it that.\"","","            \"And you messed it up.\"","","            You nod.  \"I messed it up.\"","","            *if petty > 50","                Ptolemy IV grips you by the shoulders.  \"That's why I wanted a [i]real[/i] Archimedes,","                you fool!\" he yells at you, and then he storms off.","","                Humiliated, you are left sifting through the mess of ropes, trying to figure out what","                went wrong.  And you do figure it out.  It's interesting to you, but","                too technical to describe here.","","                You decide that experience is what you get when you don't get what you want.","                *set techne +1","            *else","                Ptolemy IV pats you on the shoulder.  \"Everybody messes up sometimes,","                ${name}.\"","","                \"Yes.\"","","                \"Thanks for your weird surprise-party thing.\"","","                \"You're welcome.\"","","                The prince seems to have appreciated your gesture, even though you didn't","                quite have the skills to execute it.  He suggests going somewhere and eating","                grapes and cheese together as a substitute party, and you readily agree.","                *set ptolemy_4_rel %+10","","    #I tell Ptolemy IV that Archimedes's knowledge is available to him, too, with effort and study.","        \"There is nothing magical about my friend Archimedes,\" you whisper back to","        Ptolemy IV as King Hiero continues to hold court.  \"He knows what he does from","        studying and thinking hard.  You could be as knowledgeable as he if you apply yourself.\"","","        Ptolemy IV looks puzzled.  \"But I'm not a scholar.  I'm a prince.\"","","        \"You are allowed to be many things,\" you say.  \"Just as I am a librarian, and your","        tutor, and a natural philosopher.  If you wanted to be a scholar-prince, that","        seems like a fine thing to be.  You are born a prince, but everything else you are,","        you are by choice.\"","","        Ptolemy IV seems to take this advice to heart, because for the rest of your visit","        to Syracuse, he follows Archimedes around, peppering the man with questions.","        ","        \"What should I do to be a scholar?\" he says while Archimedes is cooking soup.","","        \"Read,\" Archimedes says, sprinkling salt in the soup.","        \"Then write something about what you read.  That's it.\"","","        \"What should I read?\" Ptolemy IV asks Archimedes while he is in the bath.","","        \"Anything you want,\" Archimedes says, playing with a floating wooden crown.","        \"You just have to love it enough that you can't stop thinking about it.\"","","        \"What should I write?\" Ptolemy IV asks Archimedes while he is out chopping wood.","","        \"What you must,\" Archimedes says, bringing his ax down to split a log.","        \"If it's the right thing to write, you won't be able to","        help yourself.  And if it's not, spare the world that garbage and just read","        some more.\"","","        By the time your monthlong stay on the island of Syracuse comes to an end,","        Ptolemy IV has not really progressed very much in either reading or writing,","        but you think the focused attitude of Archimedes has left a lasting impression","        on the boy.","","        *set petty %-15","","*page_break","","*comment Berenice - P4 is 13","*set year 232","","When Ptolemy IV is thirteen, Queen Berenice summons you to go riding with her without her son.","","You can only assume she wishes to discuss Ptolemy IV, since the queen has never shown any interest in","your work at the library.","*if (not(primary_caretaker=\"Berenice\"))","    But then, she has hardly shown any interest in Ptolemy IV since he was born,","    either.  The queen seems almost allergic to child-rearing, seemingly afraid that if she ever","    begins to act as a mother, she may be expected to never stop.  Instead, through all her","    pregnancies—and there have been a few now besides Ptolemy IV: Magas, Lysimachus,","    Alexander, Arsinoe, and tragic Berenice the Younger—Berenice has ruled until going into","    labor, then handed the child off to wet nurses and tutors and gone right back to ruling.","    But Ptolemy IV is her eldest, and perhaps Berenice finally believes the boy is old enough","    to be worthy of her attention.","*else","    Though Berenice took care of Ptolemy when he was young, she ","    has since had other children—Magas and Lysimachus, and Alexander and","    Arsinoe, and tragic Berenice the Younger—and her attention to young Ptolemy","    has been sporadic.  You wonder what is on her mind now.","","Your roan stallion and her white one travel at a trot around Lake Mareotis, south of the city.","Egyptian fishermen use poles to push their flat-bottomed boats around the lake.","The ground is marshy and dense with reeds, but there is a well-worn path.","","The conversation begins innocuously enough—you speak of horses, and athletes, and the ","library, and the difficulties of rulership—but when you have gone some ways, Berenice","finally asks, \"Have you ever heard about my first husband, ${name}?\" ","","You had heard rumors about his murder at her hands.  \"No.\"","","Berenice studies the skyline of Alexandria across the lake.  \"I killed him,\" she says distantly.","","*choice","    #\"I'm sure you must have had a good reason.\" ","        *set berenice_rel %+5","    #\"Why?\"","    #\"Please don't confess such things to me.\"","        \"It isn't exactly a secret,\" says Queen Berenice, with a grim smile.","        \"Everyone back home in Cyrene knows.\"  She nods to Alexandria, across the water.","        \"And word has spread in Alexandria, too, over the years.  But not too much,","        maybe because people know a queen who can murder is not to be crossed.  The more","        one believes the rumor, the more one doesn't wish to be caught spreading it.\"","","        You aren't sure what to say to this.  But Berenice continues, determined to share her","        story.","        ","\"He was sleeping with my mother,\" she says, and she brings her horse to a halt, forcing you","to do the same.  \"I caught them in the act, if you can believe it.\"  When she turns to you,","she bears a grin that is at once hurt and hateful, defiant and fragile.","","*choice","    #\"I really don't need to hear any more details.\"","        Berenice frowns and looks away.  \"Perhaps not,\" she says softly.  \"Let me get to","        the point.\"","        *set berenice_rel %-5","        *goto ptolemyQuestion","    #\"I'm listening.\"","        *set berenice_rel %+10","        \"I came upon them in my mother's bedroom, in the Cyrene palace,\" Berenice says.","        \"They were loud and careless.  All three of us lived there, so I was bound to discover","        them sometime.\"  She pulls a dagger from her belt.  \"Even then, I always carried","        a dagger.  I'd heard too many stories not to.  So when I saw them heedlessly groaning,","        his bare back to me…\"  Berenice runs a finger over the blade.  \"I admit there was an","        element of rage driving my decision, but at the time, it was more like the last puzzle","        piece had clicked into place, and it was finally obvious how to unlock the prison I found","        myself in.  My dagger was the key, and the back of Demetrius the Fair was the lock.\"","        She demonstrates with the dagger: \"All I had to do was insert…and twist.\"","","","    #\"I think you were right to kill him, then.\"","        *set berenice_rel %+5","        \"It wasn't about what was right,\" Berenice says, narrowing her eyes.","        \"Father had always said I would marry Ptolemy.  But when Father died, Mother ","        forced me to marry that fool Demetrius instead.  So Demetrius came to Cyrene and became king by","        marrying me.  And it was essentially all because Mother wanted the handsomest man in all the land","        to sink her talons into.\"  Berenice shakes her head.  \"Now that I'm older, I see just","        how much Demetrius was just a foolish boy.  It was Mother who jeopardized the whole kingdom","        and ruined my life, all for a pretty face.  But if you gave me the chance again, I would","        still stab him.  I knew even then that my romance with Ptolemy and the Alexandrian throne","        awaited, and all I had to do was kill a man who would screw his wife's mother.  Yes.","        I would kill him again.  Even if I feel sorry for him now.  I would put him down like a dog.\"","","At this rather astonishing statement from the queen, you can only nod your head.","","\"Which brings me to my question to you, O wise tutor of my eldest son.\"","*label ptolemyQuestion","Berenice gestures expansively to Alexandria, across the lake.  \"The city knows, effectively.","My son does not.  We have managed to keep him ignorant of this fact about me, partly by keeping","him from his peers.  No doubt every thirteen-year-old boy in Alexandria would love to inform","my boy about my past in the most insulting way possible.  So instead, we keep him","in the company of those who know better than to tell him such things, such as you and Sosibius.\"","","You blink for a moment, trying to consider the ramifications of this conspiracy to keep","Ptolemy in the company of people who would not tell him the truth.  \"And you want to know","whether it's time to let young Ptolemy know about your past.\"","","Berenice grins.  \"Precisely.  I knew you were a sharp one, librarian.\"","","*choice","    #\"Yes, you should let him know your husband died because of his lechery.\"","        *set petty %-10","        *set kill_berenice_bump true","        *if petty >= 50","            \"I have sometimes feared your son leans a little too much toward thinking","            about hedonism, instead of the Good,\" you say.","        *else","            \"I have been trying to make sure your son knows that pleasures of the flesh","            should be spurned in favor of more lasting accomplishments,\" you say.","        \"Perhaps it would be good for him to hear of how your husband met his end.\"","","        Berenice nods.  \"You're right—the last thing I would want is for my son","        to end up a fool like Demetrius.  I will tell him.  Thank you, scholar.\"","","    #\"Yes, you should let him know that even great heroines must sometimes take actions others deplore.\"","        *set petty %+10","        *set kill_berenice_bump true","        *set berenice_rel %+10","        Berenice nods thoughtfully.  \"Yes, you're right.  Why build up his idea of who I am,","        only to have it inevitably destroyed?  He probably has his own private shames, too,","        and knowing my honor is tarnished may help him come to terms with them.  You are wise,","        ${name}.  I will tell him about my past, and let him know I am human.\"","    #\"No, don't tell him now.  I can write your story for him to read later.\"","        *set rhetoric +1","        *set berenice_rel %+10","        *set ptolemy_3_rel %-15","        *set ptolemy_4_rel %+5","        Berenice frowns; apparently, she'd been hoping you would say something different.","        \"So my son will continue in ignorance, then.  Perhaps you're right, and it's still too soon","        for him to know his mother is a murderer.\"","","        \"If you give me time, I can craft a history that best explains your motives,\" you say.","        \"It is no doubt more complex than what you've told me.\"","","        Berenice's frown lifts, and she shoots you a grateful look.  \"Of course.  If I had told","        him now, I probably would have hardly said more than I told you.  And that is not nearly","        enough.  Yes.  We will meet regularly, so that you can write a book for my son.  It","        shall be so.\"","","        You spend a few months writing Berenice's book for young Ptolemy IV,","        honing your writing skills in the process.","        Unfortunately, you earn a little ire from Ptolemy III when he learns of the project,","        since he does not at all like the idea of having his wife's transgressions committed to","        book form.  But Berenice leans on him, and you finish the work and present it to Ptolemy.","            ","        Young Ptolemy seems rather shocked to learn the truth about his mother, but when you","        discuss the work with him in one of your lessons, you find that your evenhanded treatment","        has helped the boy see his mother in a sympathetic light.  You aren't certain, but you","        think this has opened the way to a relationship between the two in a way that would have","        been impossible a year ago, and for that, you are proud.","","        *goto end_of_berenice_section","","Berenice gives her horse a little kick, and as you follow,","*if berenice_rel < 60","    she turns the conversation somewhat","    forcefully to some minor chariot races coming up, as if to emphasize that you are not actually","    on as intimate terms with her as the preceding conversation might suggest.","*else","    she continues to tell you more about what it was like to live with her mother and Demetrius","    under the same roof—how she pieced it all together, clue by clue, and realized the","    magnitude of each one's betrayal.  Most of the story is clearly inappropriate for a","    thirteen-year-old, but she makes you promise not to tell Ptolemy IV anyway.","    You gather that what she will tell him will be highly abbreviated.","","How difficult it must be, you think, for young Ptolemy to understand his mother at all.","How would he really interpret the murder, when Berenice has given him so little other context?","But having seen a glimpse of the anger that Berenice carries with her still, you can hardly blame","her for being","*if berenice_rel < 60","    a closed book.","*else","    cautious.","","*label end_of_berenice_section","*page_break","","*comment Olympics - P4 is 13 (still)—this is an Olympic year if they started in 776","*set year 232","*temp winTheOlympics false","","Ptolemy IV's thirteenth year also happens to be an Olympic year.  While you are","in your office in the library, working on a treatise on ","*temp bestStat \"techne\"","*if (medicine >= techne) and (medicine >= rhetoric)","    *set bestStat \"medicine\"","    the functioning of the heart,","*elseif (rhetoric >= techne) and (rhetoric >= medicine)","    *set bestStat \"rhetoric\"","    the use of metaphor in public discourse,","*else","    the many uses of gears,","a young courier from the palace","informs you that you will be accompanying Berenice and young Ptolemy to the Olympics, so that you","can tutor Ptolemy on the journey.","","You put down your quill.  \"I was not aware young Ptolemy had any interest in athletics.\"","","\"I cannot speak to that,\" says the courier, only slightly older than Ptolemy himself,","\"but I do know he is competing.\"  ","","\"Competing!\" you say.  \"In what?\"","","\"Why, the hoplitodromos, naturally,\" the courier says, failing to suppress his grin now.","","\"That boy is going to run a race carrying a shield practically as big as he is?\"","","\"If you would like to see this spectacle, I believe he is practicing even now,\" the courier","says, still smirking in a quite improper way.  \"I will be happy to show you on my way","back to the palace.\"","","[i]No doubt[/i], you think.  You look down at the treatise you've been writing and sigh.","It seems as though you're always being pulled from your work for Ptolemy these days.","You were certain you had an interesting thought before this courier distracted you.  What was it?","*temp sympathetic true","*choice","    #\"Tell Berenice I will accompany them.  But I will pass on your offer to observe young Ptolemy—I am a bit busy here.\"","        The courier nods in acknowledgment.","        *gosub yesSirOrMaam","","        *gosub postCourierIdea","        *page_break","        *goto to_the_olympics","        ","    #\"Tell Berenice that I would like to petition her to stay here in Alexandria instead.  Now if you'll excuse me, I'm very busy.\"","        The courier looks alarmed at the prospect of being the bearer of bad news to Berenice,","        but he nods in acknowledgment.","        *gosub yesSirOrMaam","","        *gosub postCourierIdea","        ","        The next day you receive your reply from Berenice via courier:","        *if berenice_rel < 55","            there will be no audience.  You are going to Olympus with her and young Ptolemy,","            and that is final.","","            Ah, well—you somewhat suspected that Berenice did not like you enough to grant the","            favor, but it didn't hurt to ask.","            *page_break","            *goto to_the_olympics","        *else","            there is no need for an audience—in recognition of your service to the throne,","            you will be allowed a holiday from your tutoring duties, and Sosibius will simply","            watch the boy when his mother is busy competing.","","            In the month that follows, while Berenice, Sosibius, and Ptolemy IV are away at the","            Olympics, you make the most of your time away from the boy, accelerating your","            scholarly work and publicizing your ideas about","            *if bestStat = \"medicine\"","                the heart.","                *set medicine +1","            *elseif bestStat = \"rhetoric\"","                metaphor.","                *set rhetoric +1","            *else","                differential gears.","                *set techne +1","            Not only do the conversations with your colleagues edify them, but they spark","            new ideas in you as well.","            *set alexandria_knowledge +1","","            *set petty %+20","            It is a wonderful time for you…but soon enough, Ptolemy IV is back in town,","            and when you begin tutoring him again, he seems","            *if petty >= 50","                angry at everything and everyone.","            *else","                dejected.","            The word at the palace is that during his race, Ptolemy dropped his shield and","            tripped over it; and by the time he picked himself up,","            he was in last place and stayed there for the rest of the race.","            *set kill_berenice_bump true","","            *if petty < 50","                \"It's hard being a Stoic sometimes, ${name},\" Ptolemy IV says glumly at the","                end of your first lesson together after he has returned.","                *gosub ptolemy4room","","                \"Yes,\" you say.  \"But to pick yourself up after a bitter defeat is itself","                a kind of victory.\"","","                Ptolemy IV shoots you a grateful smile, which then vanishes.","                \"I wish you'd been there.\"","","                \"I'm sorry.\"  You are.  At least a little.","            *else ","                \"You're pretty lucky, not having to do what you're told all the time,\"","                Ptolemy IV blurts near the end of your first lesson together after his return.","                *gosub ptolemy4room","","                \"Your mother was very kind to grant my request,\" you say judiciously.","","                \"I hate my mother,\" Ptolemy IV says, crossing his arms.","                *choice","                    #I side with Berenice—competing was good for Ptolemy.","                        \"Your mother wants the best for you, and that includes building your","                        character,\" you say.  \"You worked hard, you lost—both of those","                        things are ultimately good for you.\"","","                        \"Shut up,\" Ptolemy IV says.  \"Just stick to your job, all right?\"","                        *set ptolemy_4_rel %-15","                        *set berenice_rel %+5","                        *set petty %-5","","                        You suppose you did not curry favor with Ptolemy IV on this one.","                        But the boy has to grow up sometime.","                        *page_break","                        *goto end_of_olympics","                    #I side with Ptolemy—Berenice had no right to force him to compete.","                        \"You're right,\" you say.  \"Looking around your room, I see a young","                        man who is very interested in art, not athletics.  It was unkind of","                        your mother to force you to compete.\"","","                        There is a gleam in Ptolemy's eye.  \"I'll tell her you said that.\"","                        *fake_choice","                            #\"Go ahead.\"","                                Ptolemy nods, satisfied.","                            #\"Please don't.\"","                                \"You can't stop me,\" Ptolemy says, defiant.","                            #\"Why would you do that?\"","                                \"Because she makes my life miserable!\" Ptolemy IV says.","                                \"And even you think so!\"","","                        Ptolemy does tell Berenice that you called her \"unkind,\" and while","                        you think she mostly shrugs off what the boy says these days, you","                        can tell her attitude toward you has chilled somewhat.  On the bright","                        side, young Ptolemy seems to feel more comfortable talking to you about","                        his hatred of his mother now, and he starts each lesson by telling you","                        something she did that he finds objectionable.  So you suppose","                        your relationship with the boy has strangely improved, although the","                        situation remains awkward.","                        *set berenice_rel %-10","                        *set ptolemy_4_rel %+5","                        *set petty %+5","                    #Avoiding the subject, I finish out the lesson.","                        \"That is really none of my business,\" you say.  \"Now, let's get back","                        to thinking about triangles, shall we?\"","","                        Ptolemy scowls at his inability to get you to engage him on a subject","                        he finds important.  But he obliges you and returns his attention","                        to side-angle-side congruence.","                        *set ptolemy_4_rel %-5","        *goto end_of_olympics","            ","    #\"I will go with you.  I should probably find out whether this is something Ptolemy wants.\"","        *set idealist %+5","        The courier wrinkles his nose a bit, as he can tell you are not going to be a fun","        fellow spectator of the prince.","        *gosub yesSirOrMaam","        *set sympathetic true","","    #\"I will go with you.  Watching that brat fall on his face repeatedly sounds like a good time to me.\"","        *set elitist %-5","        The courier grins.  \"I thought so, too.  This way.\"","        *set sympathetic false","","You follow the courier back to the palace, and then head around the back to the royal","amphitheater where Berenice often holds private chariot races.  The ash-strewn track is a standard","stade long, but there are only enough tiered stone blocks for a handful of people to sit and","observe.  ","","You find Ptolemy IV huffing and puffing his way around the track, ","bearing a meter-wide round shield in his left hand.  The huge shield bears the crest of Alexandria—an eagle standing on a thunderbolt—worked into the bronze with gold leaf.  Though ","the shield covers much of the boy's body, you assume he is nude behind it.","","*if not(male)","    As a woman, you realize you probably shouldn't be seeing Ptolemy IV in the nude—but","    you are apparently atypical enough that the courier had not thought of the problem.","    You are not sure whether to be flattered.","","Ptolemy notices your presence and unwittingly allows his arm to sag.  His knee hits the shield,","knocking it out of his own hand, and the shield drops, only to be immediately tangled in his ","legs—so that before you know it, Ptolemy is sprawled on top of his shield, crying.","","*if sympathetic","    \"Never gets old,\" the courier laughs.  Then he notices your frowning expression.","    \"Right, well, I'll be going now.\"  He takes off at a run.","*else","    The courier laughs, and you allow yourself a grin on seeing the ","    *if petty >= 50","        bratty","    prince so humiliated.  \"I thought you'd enjoy that,\" the courier says.  \"He does it pretty","    often.  Anyway, I should be going.\"  He takes off at a run.","    *choice","        #Not a bad idea—I'll leave before I end up laughing in the prince's face.","            Having seen what you came for, you leave.  It's probably best to not let ","            the prince see your enjoyment of his humiliation.","            *set ptolemy_4_rel %-5","            *page_break","            *goto to_the_olympics","        #Actually, I feel a little sorry for the prince now.  I'll go try to help him out.","            *comment placeholder—can a choice be empty?  Probably not","","When you approach young Ptolemy, he stops crying for a moment to hide behind his giant shield,","so that it is covering him like a blanket.  \"Wh—what do you want, ${name}?\" he sniffles,","looking over the rim of the shield.","","*choice","    #\"I was thinking of speaking to your mother and convincing her not to make you compete in the Olympics.  Does that sound good to you?\"","        *label ask_Berenice_for_no_Olympics","        Ptolemy IV's eyes widen at your offer to intervene.  \"You would do that?\" he says.","","        \"Yes, I would,\" you say.","","        Ptolemy IV beams.  \"Oh, thank you, ${name}!\"","","        *set ptolemy_4_rel %+10","        *page_break","        *if berenice_rel > 55","            \"It was supposed to be a nice thing,\" Berenice says, as the two of you are riding","            horses around Lake Mareotis.  As usual, she wears a tunic more suitable for a man,","            but with a high hemline well-suited to riding.  \"We were supposed to grow closer as","            a result.  I thought he would understand me better if he saw my athletic, ","            competitive side.\"","","            \"The boy is miserable,\" you say.  \"He'll only hate you if you make him do this.\"","","            Berenice sighs.  \"Fine.  He doesn't have to compete.  I just worry that we're spoiling","            him too much.  Whatever he doesn't want to do, he doesn't do.\"","            *set petty %+10","","            \"There are responsibilities enough in this world that he will have to do,\" you say.","            \"No sense in forcing him to do something that is supposed to be enjoyable.\"","","            Berenice nods.  \"You make perfect sense.  Very well, you and he will both stay here","            while I compete.\"","","            When Berenice returns from the Olympics, it is with a gold medal:  her chariot won","            the chariot races.  You wonder whether it helped that Ptolemy IV stayed home, allowing","            Berenice to concentrate on the competition.  Then again, perhaps it didn't matter so","            much; Berenice was only the owner of the chariot and slave that won, after all, as","            that is the only way that women are allowed to compete in the Olympics.  Still,","            you think you have earned Berenice's gratitude with your advice.","            *comment rich-get-richer but I think this is the only sensible stat outcome","            *set berenice_rel %+10","            *goto end_of_olympics","        *else","            \"Absolutely not,\" Berenice says from her throne, when you are granted your audience.","            \"The boy is becoming weak—a useless pretty boy like my ex-husband.  He needs","            to learn what it is to work for something.  To compete.  To be at war, even.\"","            While holding court, Berenice looks more womanly and regal than she looks around","            the palace, with a large golden diadem and a long purple achiton that flows to her ankles.","            But the way she speaks is never feminine.","","            \"I don't think he is going to like you very much for this,\" you say.  \"He feels","            humiliated already.  I suspect he will be humiliated further at the Olympics.\"","","            \"Thank you for your prediction, Cassandra,\" Berenice says wryly.  \"But perhaps","            you could avoid making that a self-fulfilling prophecy, and encourage my son","            to work hard instead of offering to help him worm his way out of it.  Can you","            do that for me?\"","","            There isn't much else you can say:  \"Yes, Your Highness.\"","            *page_break","            *goto to_the_olympics","","    #\"The question really is, what do you want?  Is it to be an athlete, or something else?\"","        Ptolemy IV hesitates, then mutters something behind his shield.","","        \"I didn't catch that.\"","","        Ptolemy IV peeks his chin over the shield rim.  \"I said I want to be an artist,\" ","        he says, somewhat","        *if petty < 50","            sheepishly.","        *else","            petulantly.","        ","        \"What kind of artist?\"","","        \"Painting,\" Ptolemy IV says.  \"And poetry.  Sometimes I write poems about my paintings","        and put them on the back.\"","","        You have instructed young Ptolemy in both art forms, and you must say, he's reasonably","        good…for a thirteen-year-old.  You consider telling him about all the","        artists who gather at the Olympics to show their work.  Ptolemy's parents could probably","        pull the right strings to get Ptolemy's own art shown at the Olympics.  Finding a buyer","        would be another matter, but at least that would be a challenge the boy would","        pursue enthusiastically, even if his disappointment remained likely.","","        Maybe it would be enough to use art as an angle to get Ptolemy to want to go to the","        Olympics.  Berenice would probably be happiest with that.","        *choice","            #\"I will try to convince your parents to let you compete at the Olympics as an artist instead of as an athlete.\"","                \"Perhaps your parents only want to see you apply yourself to something, and","                it matters not what,\" you say.  \"I will ask them whether it would be fitting","                for you to join the other artists at the Olympics showing their works, and","                save the athletic competitions for young men who enjoy them.\"","","                Ptolemy's eyes widen.  \"You would do that?\"","                *set ptolemy_4_rel %+15","","                \"Certainly,\" you say.  \"I would like to see my pupil flourish, not be…\"","                You avoid saying \"humiliated\":  \"…put out so.\"","","                Ptolemy IV brightens.  \"I'm going to go home, then.  I have a work that is","                almost ready. If they see my painting of Zeus, I'm sure they'll let me go!\"","","                Ptolemy takes off at a run toward the palace and (perhaps","                predictably) trips and sprawls over his shield again.  But this time, he does","                not burst into tears.  He picks himself up, and then he walks, rolling his giant","                shield alongside him like a wheel.","                *page_break","                Berenice, who had been unaware of Ptolemy IV's artistic leanings, is at first","                a little skeptical of the idea of allowing her son to present himself as an","                artist at the Olympics.  But you convince her that Ptolemy has no interest in","                the hoplitodromos event, and that he would probably embarrass the","                Ptolemaic dynasty if he were to compete; whereas, in your opinion, his","                paintings are not half bad for a thirteen-year-old, and may attract interest from","                buyers simply because of the chance of their value appreciating once young Ptolemy takes the","                throne.","","                So it comes to be that you, Berenice, and Ptolemy IV go to the Olympics.","                Berenice wins the champion's laurel for the chariot races, as the owner of the","                winning chariot; she is, in retrospect, grateful that she was not distracted by","                wrangling with Ptolemy.  Ptolemy IV manages to sell all three of the paintings he","                brings; as it turns out, there are many patrons with the tastes of thirteen-year-old","                boys, and his depictions of Zeus and Hercules and Ares go over quite well.","                Sadly, the boy cares so little about the money that he forgets to bring it","                back from the artists' pavilion, but you suppose some other starving artist","                is quite happy now.","","                You may not have taught the boy the value of persevering at something he detests,","                but you did show him the value of pursuing something he loves instead.","                Surely, that counts for something.  At any rate, you have never seen the","                young prince happier than on the voyage home, at the prow of the ship, painting","                his next thirteen-year-old masterpiece.","","                *set berenice_rel %+10","                *set petty %+5","","                *achieve sponsor","","                *goto end_of_olympics","            #\"If you compete in the Olympics, you will have a chance to see a lot of art.  Wouldn't you like that?\"","                Ptolemy IV considers this angle, then frowns.  \"Can't I just go see the art","                and not compete in the Olympics?\"","","                \"Sometimes you've got to make compromises,\" you say.  \"I don't think Berenice is","                interested in taking you with her unless you compete.\"","                ","                *set petty %-5","","                Ptolemy IV sighs.  \"Okay.  I guess I'll do this.\"  Ptolemy IV hesitates.","                \"Would you mind leaving?  I don't want to practice with you watching.\"","","                \"Sure.\"","","                Ptolemy IV hides under his shield like a turtle until you are gone.","                The boy can be very immature for thirteen, you think.","                *page_break","                *goto to_the_olympics","","            #\"I think you're a little inexperienced to compete as an artist or an athlete.  I'll ask Berenice to consider not making you go.\"","                *goto ask_Berenice_for_no_Olympics","","","    #\"I want to help you succeed at this.  Let me be your coach.\"","        Ptolemy IV gives you a quizzical look.  \"But you're a…\"","","        *if not(male)","            [i]Don't say 'girl,'[/i] you think.","        *else","            \"A what?\" you say.","","        \"…a librarian!\" Ptolemy IV finishes.","","        \"I'm not the one competing,\" you say.  \"I can only promise to help you train.\"","","        \"How?\" Ptolemy IV says.","","        *choice","            #\"I can regale you with tales of heroes that will inspire you as you train.\"","                Ptolemy IV looks skeptical.  \"Will that help?\"","","                \"Won't know until you try,\" you say.","","                Ptolemy IV tilts his head this way, then that.  \"Fine.\"","","                Thereafter, every day until the Olympics, you follow Ptolemy IV around the","                track at a brisk pace, scrolls in hand, reading him tales of Odysseus and Ajax","                and Hector.","                *if rhetoric < 4","                    But too often, Ptolemy asks you to simply be quiet—your stories seem","                    to annoy instead of inspire him.  Perhaps your reading of the material","                    is too stuffy and academic; it's not speaking to the thirteen-year-old.","                    By the end of Ptolemy's training, you think you have improved, but","                    Ptolemy has not.","                    *set rhetoric +1","                *else","                    It seems to work; Ptolemy seems to gain a renewed sense of purpose","                    as you describe each hero buckling down to do what needs to be done.","                    You tire long before Ptolemy does, but you think he is practicing longer","                    hours now.","                    *set petty %-5","                    *set winTheOlympics true","            #\"If you follow my recommendations for exercise and diet, you will win for sure.\"","                Ptolemy IV frowns.  \"Diet?  What do you mean?  I don't want to go on a diet.\"","","                \"You will perform best with the right balance of humors in your body,\" you say.","                \"Careful choices about what to eat can do that for you.\"","","                Ptolemy IV shrugs.  \"You're the scholar, I guess.\"","","                *if medicine < 5","                    Thereafter, you take charge of Ptolemy IV's exercise regimen and diet.","                    But you're not sure your careful attempts to balance his humors are doing","                    any good. Despite your orders, you hear of Ptolemy sending back his","                    vegetables in favor of blackened steak, which is not at all what you","                    recommended.  You will also never know whether your exercise regimen","                    would have been effective, because after a few painful stretches, Ptolemy","                    gives up on the whole thing.  Gradually, you learn to mix what is theoretically","                    best with what Ptolemy will tolerate.  But by that time, the Olympics are","                    upon you.","                    *set medicine +1","                    *page_break","                *else","                    You gradually ease Ptolemy into a diet that is heavy on grains and vegetables,","                    while slowly building an exercise regimen that emphasizes arm strength and","                    speed.  You think it's working:  Ptolemy IV begins to fall much less while","                    he is running, and he has more energy with which to continue practicing after","                    dusk falls.  You begin to notice that he is more alert during your","                    tutoring sessions as well.  You're proud of the boy.","                    *set petty %-5","                    *set winTheOlympics true","                    *page_break","            #\"I think I can engineer a much lighter shield for you.\"","                Ptolemy IV perks up at this offer, then turns suspicious.  \"Is that even legal?\"","","                \"There is no regulation that forbids it,\" you say.  \"Like the chariot races,","                the hoplitodromos event is partly a competition of techne.  The shield","                must be made of metal, but that leaves much room for experimentation.\"","","                Gleefully, Ptolemy IV shoves his shield away from himself, forcing you to avert your","                eyes.  \"Let's do it!\" you hear him say.","","                You spend a fair amount of time in the forge experimenting with different","                bronze and brass alloys, finally settling on a lightweight brass.","                Rather than a design honoring Zeus, you think a design honoring Athena","                more appropriate, and you add the design of an owl to the shield.  You","                give the shield to Ptolemy to practice with, and he is thrilled—the shield","                is far less heavy than the one he had been carrying.  When Ptolemy III","                hears of your invention, he is less fond of it—apparently the other shield","                had carried some kind of familial significance—but Ptolemy IV loves it.","                *set ptolemy_3_rel %-5","                *if techne < 5","                ","                    Unfortunately, shortly before you are due to go to the Olympics, Ptolemy trips","                    one last time—and when he lands on the new shield, it shears clean in two.","                    With no time to create another, Ptolemy IV is forced to bring the heavy bronze","                    shield after all. But, at least he had a chance to practice with a lighter one.","                *else","                    *set winTheOlympics true","                *page_break","                ","*label to_the_olympics","","You, Berenice, and Ptolemy IV sail northwest across the Mediterranean to Olympia.","Throughout the voyage, Berenice shows an unexpected interest in getting to","know her son.","*if (petty < 50) and (not (kill_berenice_bump))","    You notice Berenice giving Ptolemy what appear to be lessons in swordplay and knife","    fighting.  Ptolemy seems to enjoy the attention and the subject matter.","*else","    But Ptolemy repeatedly rebuffs her, choosing instead to stay inside his cabin.","","When you arrive, the site is bustling with Greeks from all over the world—there","are tens of thousands of people who have come to this little enclave of temples.","Still, Alexandria has left you jaded—the fact that everyone here is Greek makes the event seem","a little provincial.","","The three of you spend a little time browsing the wares of the many merchants","who have set up shop just outside the holy area with the temples.  Ptolemy IV seems very","interested in the paintings and sculptures being sold, so much so that when","Berenice suggests you all go see the racetrack and the hippodrome, Ptolemy IV begs for a little","more time.  (And then he begs for the money to buy some paintings; Berenice obliges.)","When you finally do go to the track where all the athletes are, young Ptolemy seems to lose","all interest.  Berenice, meanwhile, seems to have a preternatural sense of where to find","important nobility from other city-states, and she tracks these people down one by one to say hello.","","Tomorrow, the five-day event will begin in earnest.  What is your primary goal while here","at the Olympics?","*temp extraThing","*choice","    #I would like to get to know Berenice better.","        When Berenice is not talking to nobles from around the world, or checking in on","        the chariot and charioteer that will compete for her, you chat with her about her","        history of athletics.","","        \"Oh, this certainly isn't my first Olympics,\" Berenice says as you are making your","        way after dusk from the merchants' area to the tent city where all the athletes stay.","        \"I've competed in the Nemean Games and Pythian Games as well.  The Olympics are actually","        a little annoying because of the 'no women' rules.  I'd rather be riding the horse","        instead of just owning it.  But there's nothing quite like the Olympics, so I'll","        compete any way I can.\"","        *set extraThing \"Berenice\"","        *set berenice_rel %+5","    #I would like to learn what I can from the athletes.","        You can hardly pass up the chance to interview so many famous athletes and find out","        about their regimens.  You tell Berenice and Ptolemy that you will catch up with them","        later, and you spend much of the first day interviewing any athletes who will stop","        practicing long enough to talk to you.  Many of the athletes are already nude,","        *if (not(male))","            but that doesn't seem to deter them from talking to you, even though they can clearly","            see you are a woman.","        *else","            and you begin to feel as if maybe you should strip just to blend in.","        You hear many tips for keeping a body in good condition, and about half of them make","        sense and don't involve the gods.","        *set medicine +1","        *set extraThing \"athletes\"","    #I would like to support Ptolemy IV.","        *set extraThing \"Ptolemy\"","        The most important thing is to support Ptolemy, you think.","","        \"You ready for the big competition?\" you say encouragingly as Ptolemy IV examines","        another artist's painting, this one of Zeus smiting a human-shaped black smudge.","","        *if petty < 50","            *if winTheOlympics","                \"Thanks to your help, I think I am,\" Ptolemy says.  \"I really am grateful.\"","                You continue to supply the boy with encouragement in the days to come.","            *else","                \"No,\" Ptolemy says.  \"I know I'm not.  But thank you for asking.\"","                Despite his defeatist attitude, you make it your goal to continue to","                encourage Ptolemy in the days to come.","            *set ptolemy_4_rel %+10","        *else","            \"Leave me alone,\" Ptolemy IV says sullenly, and he continues to examine the painting.","","            \"Well, I think you're going to do great,\" you say.","","            It continues like this, with your offering praise of Ptolemy IV and him shrugging you","            off and ignoring you.  Perhaps it is having some positive effect;  perhaps not.","            *set ptolemy_4_rel %+5","","On the first day of the Olympic Games, Berenice and Ptolemy take an oath along with the other","athletes before a statue of Zeus to not do anything that would offend the god.  Berenice is","the only woman among them.","","On the second day, Berenice's chariot competes in the chariot races, though as a married woman,","Berenice is not allowed to watch.  You are, however, and you see her talented slave charioteer","cross the finish first, winning the laurel for Berenice.  You rush with Ptolemy to tell Berenice,","and when she learns of it back at your tent, she lets out a very un-queenly whoop.","","On the third day, a hundred cows are killed in the name of Zeus.  That is all that happens that day.","","On the fourth day, Ptolemy runs his race.  You watch the nude young men gathered at the starting","line with their shields, and you note that all of them are larger than Ptolemy.  Then an","official shouts \"Go!\", and they're off!","","Ptolemy takes advantage of his small size to weave between the large shields of the pack and","come out ahead.  And then…","*page_break","*if winTheOlympics","    And then he just keeps going.  He takes the lead running down the track, with this","    pack of shield-bearing giants bearing down on him from behind—and soon enough, the","    race is over, and Ptolemy has won the event.","","    He throws down his shield and jumps up and down in triumph, and he shoots you a look from","    across the stadium that speaks volumes of his gratitude.  It is because of you he won,","    and he knows it.","    *set ptolemy_4_rel %+10","    *achieve coach","*else","    And then Ptolemy trips over his shield, and falls in a sprawling heap on top of it,","    and he doesn't get back up, but instead, cries.","","    Berenice, watching beside you, buries her head in her hands.  \"My thirteen-year-old baby boy,\"","    she says in disgust.","","    *if evil","        You smile to yourself.  [i]Poor, poor Ptolemy IV.  Now do you see[/i]","        [i]you can't trust your mother?  Now do you see you will fail[/i]","        [i]without my help?[/i]","        *set petty %+5","    *else","        You can only hope it was all a learning experience.","        *set petty %-5","*page_break","","On the fifth and final day of the Olympics, the winners are crowned with laurel wreaths.","Berenice crows happily from the winner's circle as the laurel crown is placed on her brow,","*if winTheOlympics","    and she raises the hand of Ptolemy beside her as he, too, is crowned.","    They certainly are a competitive family.  You would hate to ever be on their bad side.","*else","    while Ptolemy looks on from the sidelines and scowls.  You get the feeling the boy","    does not care for his mother right now.","","    Well, that's understandable.","","*label end_of_olympics","*page_break","","*comment Musaeum - P4 is 15","*set year 230","When Ptolemy IV is fifteen, you decide it would be good for the prince to see how young","people who don't have private tutors are educated.  You bring him to the Musaeum,","where students from all over the known world are gathered to learn ","grammar, logic, rhetoric, arithmetic, geometry, music, and astronomy.  ","You walk among the Musaeum's new white marble assembly halls that Ptolemy III built along","the waterfront.  It speaks well of the elder Ptolemy, you think, that","he used the same fine marble for the Musaeum as he did for the nearby palace.","","You enter one of these new assembly halls to join ","*if euclid_dead","    a geometry lecture","*else","    one of Euclid's lectures on geometry,","already in progress.  As you enter","the double doors at the back of the lecture hall, over a hundred student heads crane your way,","wet clay tablets and styluses momentarily set down as students try to see over their peers","on the higher seats behind them.  Boys and girls alike are dressed in fine, colorfully dyed chitons,","all of which were probably purchased in the last year to accommodate their growth spurts.","*if euclid_dead","    The instructor, a young woman who must be new,","*else","    Euclid","is in the middle of drawing","a diagram in the sand pit at the front of the lecture hall, using a taut string and a stake to make","two marks in the sand, each at an equal distance from the stake.  With a long straightedge, she connects her three points","to form an isosceles triangle, then draws the students' attention by decisively clearing her","throat.","","*if euclid_dead","    \"What I'm about to show you is an improved proof of Euclid's fifth","    proposition,\" the instructor says with excitement.  \"Euclid's proof","    is already known as 'the bridge of asses,' both because the construction","    in the proof looks like a bridge, and because understanding it supposedly","    makes you a true mathematician instead of an…ah, haha, right, I probably","    shouldn't use that language in front of you, should I?  Well, anyway,","    there's a simpler proof.","    It turns out Euclid's proof was not only hard, but [i]needlessly[/i] hard.  Hey.","    Hey, I'm over here.  Quit looking at the prince, please.  This triangle","    is very interesting, honest.\"","*else","    \"My fifth proposition tends to cause students some trouble, so pay","    attention here,\" Euclid says.  You note that she does not dress up for lecture; her tunic","    is covered by one of those drab gray himatia that she wears about the library, acquired sometime","    during an earlier Ptolemy's reign.  \"Pay no heed to our young visitor—all","    are equal before geometry, as I told his great-grandfather so many years ago.  Now, suppose I","    extend the lines of this isosceles triangle…\"","","As","*if euclid_dead","    the instructor","*else","    Euclid","continues her proof, you and Ptolemy quietly take seats in the back.","You suppose you've chosen a poor time to come in for Ptolemy to actually learn anything.","*if euclid_dead","    This instructor, while full of energy and new ideas, clearly does not","    yet know how to control her classroom.","*else","    You've seen the proof Euclid is developing before, and it's unnecessarily complicated. But","    humility is not Euclid's greatest strength, and she refuses to teach anyone's proof of the","    proposition but her own.","","Indeed, Ptolemy seems enchanted not by the mathematics, but the world of the students, nothing","of which escapes Ptolemy's eye.  You see him look longingly at a whispering pair of students,","peer inquisitively at a clay tablet that two students pass back and forth, and whip his head","around at the sound of students giggling.  You wonder how often young Ptolemy ever interacts","with young people his age.  Probably not often.","","When the water clock at the front of the classroom has stopped flowing, the students notice","first, and it is the general commotion of students putting their tablets back in their satchels","that signals to ","*if euclid_dead","    the instructor","*else","    Euclid","that class is over.  \"Study this proof for next time!\" she shouts","hoarsely over a classroom that has already stopped paying attention.  As students congregate into","their cliques to walk out, Ptolemy IV looks longingly at them.  But when they look back with","equal curiosity, he seems to shrink into himself.","","*if euclid_dead","    The instructor approaches.  \"Your Highness, I'm so honored that you","    would come to my classroom…\"","","    But Ptolemy ignores her.","*else","    Euclid hobbles toward you to chat, but Ptolemy IV cuts this short with an outburst:","\"I want this!\" he says to you desperately.  \"I want friends!  I want to be","with other students my age!  I'm so lonely, ${name}!\"","","*if (not(euclid_dead))","    \"It seems your prince wants something again,\" Euclid says drily.","","You reflect that Ptolemy IV must be lonely indeed if even geometry class looks like the social","event of the season.","","*temp ptolemyHasFriends false","","*choice","    #I will try to convince Ptolemy's parents that he should have a Musaeum education instead of my tutoring.","        *set elitist %-10","        \"I agree, Ptolemy,\" you say.  \"I think it would be good for you to interact more with","        students your age.\"","","        Ptolemy brightens at this.  \"You'll try to convince my father?\"","","        \"I will,\" you say.  \"And your mother as well.  I think they make decisions together","        more often than you know.\"","","        *if (not(euclid_dead))","            Euclid gives you a pained look, because she knows Ptolemy will soon be her problem.","            But to the prince she says, with a solemn bob of her head, \"It will be an honor to serve","            you.\"  Some in their old age feel free to say anything, but Euclid clearly knows one is","            never too old to fall out of royal favor.","        *page_break","","        You have an audience with Ptolemy III and Berenice in which you argue that a Musaeum","        education will help Ptolemy relate to other students his age.","","        \"Would this education not be of an inferior quality to what you provide?\" Ptolemy III","        says, scowling a bit as he leans forward on his throne.  \"And if it is superior, why","        did you not make this recommendation to us sooner?\"","","        \"I have provided an excellent education to Ptolemy already, and he will be overprepared","        for study with the other students at the Musaeum,\" you say.  \"His true education there","        will be in how to win over the other students—without simply ordering them","        to be his friends.\"","","        Ptolemy III sits back in his throne, scratching his chin.  \"That does seem useful.","        Berenice, my love?\"","","        \"We do coddle the boy,\" Berenice says thoughtfully.  \"I think I would like to see a bully","        punch my son in the nose.\"","","        \"We most certainly would not like that!\" Ptolemy III says, offended.","","        \"I don't mean it like that,\" Berenice says.  \"I mean he needs mettle.  He is fifteen.","        He needs to stop being so protected.\"  She nods to you.  \"I think it is a good idea.\"","","        \"I didn't agree to it yet,\" Ptolemy III says, irritated.","","        Berenice looks to him expectantly.","","        Ptolemy III sighs.  \"Fine.\"","","        *set berenice_rel %+5","        *set ptolemy_3_rel %-10","","        *set tutoring_ptolemy false","","        With that, Ptolemy IV begins to attend the Musaeum instead of your tutoring, and","        the boy gradually falls out of your sphere of influence.  You see him much less,","        but rumors reach you:  Ptolemy is doing very well at the Musaeum, but he credits","        his success to his own innate talent instead of the preparation you provided.  He","        does indeed get punched in the nose once, and the perpetrator is hauled before","        Ptolemy's parents only to get a confusing combination of scolding from Ptolemy III","        and mild praise from Berenice.  You get the sense that overall, the experience is","        good for young Ptolemy, even though it means you have lost some influence with him","        now that he thinks of you as merely his \"childhood tutor.\"","","        *set ptolemy_4_rel %-5","        *set petty %-10","        *temp highestStat \"techne\"","        *if medicine > techne","            *set highestStat \"medicine\"","        *if (rhetoric > medicine) and (rhetoric > techne)","            *set highestStat \"rhetoric\"","        Happily, with more time to teach yourself instead of young Ptolemy in the years that","        follow, you are able to significantly advance your own knowledge of ${highestStat}.","        *setref highestStat +1","        But you think it was best for the boy, too.  You think.","","        *set ptolemyHasFriends true","        ","    #I will try to convince Ptolemy's parents that Ptolemy needs more friends.","        *set idealist %-10","        \"I will get you more friends, Ptolemy,\" you tell him.  \"Let me talk to your parents.\"","","        *if (not(euclid_dead))","            Euclid gives you a skeptical look.  \"Really?  You're going to simply order up some friends","            for the boy?\"","","            \"Would you prefer that he come to your class for the sole purpose of passing notes","            to the other students?\"","","            Euclid raises her hands in surrender.  \"Give the boy what he wants, then.  A prince","            expects no less, I'm sure.\"","","            \"I'm not a boy.  I'm fifteen,\" Ptolemy says sullenly.","            *page_break","        You make your case in an audience before Ptolemy III and Berenice.","","        \"Young Ptolemy doesn't know how to interact with other young people,\" you say.  \"He","        needs more friends his age.\"","","        \"Indeed, this is intolerable,\" Ptolemy III says, pounding his fist on the arm of his","        throne.  \"My son shall have the best friends in all Alexandria.\"","","        But Berenice looks irritated.  \"Are we really going to order up friends for our son?","        Demand the nobles send along their children to play with him?","        *if petty > 50","            You know he's just going to order them around and complain and ask for better friends.\"","        *else","            ${name} has been so careful to teach Ptolemy to be less demanding—but now we're","            going to show him that everyone has to come to our beck and call?\"","","        \"Our son could stand to be better connected, at the very least,\" Ptolemy III says.  \"And","        those children's families will be glad of the perceived opportunity for influence.  Yes, it is","        time for us to procure some friends for our son.  Done.\"","","        Ptolemy III says this, then glances Berenice's way.  You think he often consults with","        her before making decisions about Ptolemy IV, but this time, he has overridden her outright.","        Berenice scowls.","        *set ptolemy_3_rel %+5","        *set berenice_rel %-10","","        Indeed, noble children begin streaming into the palace to become friends with","        Ptolemy IV.","        *if petty > 50","            Young Ptolemy manages to find fault with one after the other—one is too loud;","            another, too bookish; another, too stupid.  But when the stream of friend candidates","            slows to a trickle, and then stops, young Ptolemy remarkably apologizes to you for","            having been a heel to all of them.","            ","            *if evil","                \"Don't apologize,\" you say.  \"If they abandoned you, it is because they","                are disloyal.  If I were you, I'd have them killed for their insolence.\"","","                \"I can do that?\" Ptolemy says.","","                \"Oh,\" you say, as if just realizing it.  \"No, not while your father is still","                alive.\"","","                You let Ptolemy think about that for a while.","                *set petty %+ 10","            *else","                You suppose that was one way to educate Ptolemy","                in how to interact with people—or how not to, rather.","                *set petty %-10","            *set ptolemy_4_rel %+5","        *else","            Ptolemy is a kind and good host to each of them, and they, in turn, help to bring him","            out of his shell a little.","            *if (not(evil))","                You realize, as you see Ptolemy's transformation, that","                you've perhaps been a little too harsh with him.","            He laughs so much more when he is","            around them.  But then, in an effort to impress his friends, Ptolemy tends to bring","            out the kind of expensive indulgences that","            *if evil","                you and Sosibius have taught him to love.","            *else","                Sosibius has taught him to love.","            They drink fancy wines without mixing them with water, eat oysters, and order","            royal entertainment.","            *if evil","","                Good: let the prince be too distracted by pleasure to care about his kingdom.","                That will serve you well when his parents are gone.","            *else","                You are less thrilled with these developments.","                But so be it:  Ptolemy has friends now, and he has you to thank.  That's not too bad.","            *set ptolemyHasFriends true","            *set petty %+15","            *set ptolemy_4_rel %+15","    #I tell Ptolemy that I think of him as a close friend, but I do nothing to help him make more.","        *set idealist %-10","        \"We're friends, aren't we, Ptolemy?\" you say.","        ","        *if ptolemy_4_rel > 50","            Ptolemy IV nods slowly.  \"I didn't think about it that way.  You're right.\"","        *else","            Ptolemy IV looks at you with puzzlement.  \"We are?\"","","            \"Well, I think we are,\" you say.","","            \"Okay,\" Ptolemy IV says, still trying to process this.","        *set ptolemy_4_rel %+10","","        *if (not(euclid_dead))","            \"Looks like you should learn to value what you already have, Prince,\" Euclid says","            in a tone of satisfaction.","","        After this, Ptolemy IV doesn't complain to you about not having friends again.","        *if ptolemy_4_rel > 50","            He begins to ask you to go places with him more, though—the zoo, theater","            performances, and so on.  You oblige him, and you feel happy to spend more time","            with the prince—even though others begin to wonder why you monopolize his schedule.","            *set berenice_rel %-5","            *if evil","                *set petty %+ 20","        *else","            But your relationship doesn't get much closer, either—you think the prince has","            concluded that, on the whole, you are not really friends, at least not the kind","            he wants.  He spends most of his time writing plays and poetry in his room,","            engaged in a fantasy life with the friends he does not have.  So be it—when","            he changes his mind, you'll be there.","            *set petty %+5","","*page_break","*comment Sosibius - P4 is 16","*set year 229","When Ptolemy is sixteen, he falls in love.","","*if tutoring_ptolemy","    During a mathematics tutoring session in your office at the library, Ptolemy suddenly interrupts","    the lesson to ask you for advice on a love poem he has written.","*else","    Even though you are no longer tutoring the young prince, thanks to the Musaeum,","    he comes to your office at the library anyway for advice on a love poem.","The poem is not very good, but you suppose it is all right for a sixteen-year-old.","It is addressed to someone named Agathoclea.","","*set agathoclea_lover true","","\"I think she will like it,\" you say cautiously, returning the scrap of papyrus.  \"How did you meet?\"","","\"Sosibius introduced us,\" Ptolemy says, smiling at the memory as he tucks away the poem.","\"He surprised me by bringing Agathoclea to dinner.  She's his friend's sister.\"","","\"Oh really.\"  You have a suspicion that Sosibius would not do such a thing unless it served him","somehow.  \"So Sosibius went with you to this dinner.\"","","\"Yes, but he was very helpful,\" Ptolemy says.  \"I mean, introducing us and everything.  She","was shy at first.\"  He grins.  \"I think she likes me very much!\"","*set petty %+10","","You ponder what an appropriate reaction to this state of affairs is.","","*comment ptolemyNext : whether to try warning Ptolemy after warning Agathoclea","*temp ptolemyNext false","*choice","    #I warn Ptolemy that this is likely just a ploy by Sosibius to win influence with him.","        *label warnPtolAboutAgath","        \"You know, you can't really trust the gifts that Sosibius brings you,\" you say","        to Ptolemy.  \"Including this girl.  She will likely make whatever suggestions to you","        that Sosibius and her brother desire.  If you would do anything for her, you can bet","        that they know that.\"","","        *if petty > ptolemy_4_rel","            Ptolemy IV scowls at you.  \"What, is it so hard to believe that someone could like","            me for myself, without wanting anything from me?  You insult me, ${name}!\"","            With that, Ptolemy IV storms off.","","            *set ptolemy_4_rel %-10","","            *if (ptolemy_4_rel < 50) and tutoring_ptolemy","                Soon after, you learn that you are no longer needed to tutor the","                young prince.  He has requested a Musaeum education","                after all, and his parents have obliged.","                *set tutoring_ptolemy false","            ","            Ptolemy IV continues to see Agathoclea, and the word about the palace is that","            they are physically intimate and that he would do anything for her.  You suspect","            that she suggests to the young prince whatever Sosibius desires, but you are","            now powerless to intervene.","            *set petty %+10","        *else","            Ptolemy IV looks downcast.  \"I suspected that,\" he says.  \"I think maybe one","            reason I came to you was that you would tell me the truth, even if nobody else","            would.\"","","            \"Are you going to end things with her, then?\" you ask.  Ptolemy nods morosely.","","            *set agathoclea_lover false","            For the next few weeks after that, young Ptolemy is fairly glum, so you can only","            assume he did as you suggested.  You wonder whether some part of him resents","            you for it.  But, you're quite certain you were right—Sosibius could not","            have had the prince's happiness foremost in his mind when he made that match.","            Sooner or later, the prince had to learn that not all that glitters is gold.","            *set petty %-5","            *set ptolemy_4_rel %-5","            ","    #I will pay a visit to Agathoclea to determine whether her feelings are genuine.","        After Ptolemy's visit is done, you decide to do some sleuthing about his young ","        paramour, Agathoclea.  You learn that she lives with her brother Agathocles on a boat in the","        dodgy part of the harbor near the lighthouse, known as the Bay of Pirates.  You decide","        to pay her a visit there.","","        When you go to Agathoclea's boat, it is late in the afternoon.  It is a slightly","        chilly fall day, but there are no clouds in the sky, and the water this side of the Pharos ","        is very still.  Agathoclea's boat is in quite good condition compared to its neighbors.","        You yell, and a girl who could not be older than thirteen emerges from belowdecks.","        Her hair is unusual in that it is blond, as Ptolemy IV's poem emphasized ","        over and over, making it easy to identify her.","","        \"My brother isn't here, and I shouldn't talk to strangers without him,\" Agathoclea says","        over the rail.  \"Please go away.\"","","        \"I am a friend of Ptolemy IV,\" you say from the dock.  \"I would like to see in person","        that your love is true, that I may vouch for you.\"","","        Agathoclea hesitates for a moment.  \"Very well, come aboard,\" she says.  \"I will show you","        something.\"","","        You cross the boarding ramp, and Agathoclea takes you belowdecks, where you find her","        cabin.  Around the [i]kline[/i] where she must sleep, tiny paintings of Ptolemy IV are crammed","        everywhere.","","        \"I have been in love with Ptolemy IV ever since I was young, and my brother gave me","        my first image of him,\" Agathoclea says, setting down the candle she carries to ","        pick up one of the tiny paintings.","        \"I made him my imaginary friend.  How wondrous it was to finally meet him in person.\"","        She holds the painting to her chest.  \"It is even more glorious than I imagined.\"","","        \"Did you acquire these all yourself, then?\" you say.","","        \"No, some are gifts from my brother, while others are gifts from his friend, Sosibius.\"","        Noting your reaction to the second name, she says, \"Oh, do you know him?  He has always","        been kind to me.  Whenever he gives me things, he just says, 'It's an investment.'\"","        Noting your sour reaction, she adds, \"An investment in my future, I think","        is what he means.\"","","        So: Sosibius, along with Agathoclea's brother, has apparently raised her to be infatuated with","        young Ptolemy, probably to give them a way to manipulate the prince.  What","        will you do about that?","","        *choice","            #I try to convince Agathoclea that her romance with Ptolemy IV is a bad idea.","                *label warnAgathoclea","                \"Agathoclea,\" you say, \"I regret to inform you that you are being used","                as a political pawn by your brother and Sosibius.  They wish to use you","                to influence the prince.\"","","                *if rhetoric >= 5","                    \"No….\" Agathoclea says, but something about her tone suggests that you","                    have her attention.  So you continue to build a case, starting from your","                    conversation with Sosibius on the boat to Alexandria before Ptolemy was born,","                    all the way to the present.","","                    \"Then the best way I can serve my love is by never seeing him again,\"","                    she says wistfully.","","                    \"I am afraid that is probably the case, yes,\" you say.","","                    \"So it shall be,\" Agathoclea says softly.  \"Please go.\"","","                    *if ptolemyNext","                        With Agathoclea convinced, you then turn to convincing Ptolemy","                        that the affair is a bad idea, if only to soften the blow when","                        Agathoclea refuses him.","                        *if ptolemy_4_rel > petty","                            Understanding the plot, the prince morosely agrees that a","                            romantic involvement would be a bad idea.  But, as a final","                            gesture, he sends Agathoclea a bronze locket containing his portrait,","                            engraved with the words, \"I will remember always.\"","","                            You hear later that even as Agathoclea's brother attempts to set her up","                            with other nobles from other important families, she still wears","                            that locket.","","                            *set ptolemy_4_rel %+10","                            *set agathoclea_lover false","                            *goto agathoclea_end","                        *else","                            But he only angrily declares that you know nothing, and that","                            Agathoclea will not give up on the relationship—just you","                            wait.","                            *set ptolemy_4_rel %-5","","                    *set agathoclea_lover false","                    When Agathoclea ceases to respond to Ptolemy's love letters, the prince","                    becomes despondent, then furious.  When he sends soldiers to Agathoclea's boat,","                    her brother tearfully informs them that she has committed suicide.","                    Ptolemy is despondent for many months afterwards.","","                    If there is one consolation, Ptolemy appears to have finally become an adult.","                    *set petty %-10","                *else","                    Agathoclea's eyes widen, then narrow.  \"How dare you!\" she says.  \"My brother","                    is the kindest, most amazing man I know.  You think he would use me?  Get out!","                    Get off my boat!\"","","                    You are unable to change Agathoclea's mind, and find yourself shooed from the","                    boat.","","                    *if ptolemyNext","                        At your next","                        *if tutoring_ptolemy","                            lesson","                        *else","                            poetry-revising meeting","                        with Ptolemy, you try to convince the young prince himself that the","                        relationship is a bad idea.","                        *goto warnPtolAboutAgath","","                    When you next meet with Ptolemy IV, you find that Agathoclea must have reached","                    him first—he greets you with an angry, \"Why can't you stay out of my","                    business?\"  He and Agathoclea continue to see each other.","                    ","                    Soon, Agathoclea's brother Agathocles is promoted to a prestigious position","                    in the priesthood—with the help of Ptolemy's influence, you think.  During","                    the ceremony in the throne room, you think you catch Sosibius making a rude","                    gesture at you, but he soon turns it into a scratch at his nose.","                    *set ptolemy_4_rel %-15","                    *set petty %+10","","                    *if petty < 50","                        Ah, well.  You have raised Ptolemy IV well—you trust he will resist","                        the manipulation of Sosibius when it really matters.","                    *else","                        You have lost your struggle for the soul of the young prince to","                        Sosibius.","                        *if evil","","                            One of these days, you're going to have to kill the man.","                        *else","                            You can only hope the damage to the kingdom will not be too","                            great.","","            #I go back to Ptolemy IV and try to convince him that he is being manipulated.","                You bring up the matter of Agathoclea again","                *if tutoring_ptolemy","                    at Ptolemy's next tutoring session.","                *else","                    when Ptolemy returns to you for more poetry advice.","","                *goto warnPtolAboutAgath","            #I will try to convince both of them that it will never work, starting with Agathoclea.","                *set ptolemyNext true","                *goto warnAgathoclea","            #I will just go back to Ptolemy and teach him how to write better love poems.","                When you next meet up with the young prince","                *if tutoring_ptolemy","                    for a tutoring session,","                *else","                    to go over his latest love poem,","                you decide that the boy simply does not need to know about the","                suspicious contributions of Sosibius and Agathocles to Agathoclea's","                crush—which appears genuine, if a bit manufactured at the same time.","                *goto poetryPlz","","    *if (tutoring_ptolemy) #I simply take this opportunity to interest Ptolemy more in his poetry lessons.","        *label poetryPlz","        Who are you to deny Ptolemy his young love?  \"Would you like me to help you write","        better poems?\" you ask.","","        Ptolemy nods eagerly.","","        You proceed to give Ptolemy intensive lessons in improving his poetry.  In trying","        to explain what makes his work bad, you find yourself coming to novel realizations about","        what makes work good.  Improving his poems proves to be a useful exercise for you both.","        *set rhetoric +1","        Meanwhile, you have never seemed smarter to Ptolemy than you do now, and his admiration","        for you only increases.","        *set ptolemy_4_rel %+10","","        However, your suspicions about the whole arrangement resurface when Agathoclea's brother Agathocles wins a plum position in the priesthood,","        joining his friend Sosibius at court thereafter.","        Ptolemy may be in love,","        but Sosibius and Agathocles have undoubtedly used this hook to increase their power at","        court.  You can only hope that their motives, if not innocent, remain at least","        innocuous.","        *set petty %+10","    *if (not(tutoring_ptolemy)) #I ask whether Ptolemy would like me to tutor him again, this time specifically to help him write better poetry.","        *goto poetryPlz","","*label agathoclea_end","","*finish Chapter 5:  The Colossus Falls","","*comment————————Subs————————————-","","*label zookeepers","*if head_librarian","    Your position as Head Librarian makes it relatively easy for you to get an","    audience with the director of the Musaeum the same day.  For such an","    important person, the old man's office admits little light, save for a tiny window","    near the ceiling.","*else","    By asking around the zoo, you find a zookeeper with the authority to buy and","    sell animals.  You and Ptolemy IV cram into his tiny scroll-filled tent.","*return","","","*label yesSirOrMaam","\"Yes,","*if male","    sir.\"","*else","    ma'am.\"","*return","","","*label postCourierIdea","As the courier departs, you recollect your idea:","*if bestStat = \"medicine\"","    if the heart is a muscle like any other, then could it not get stronger with","    exercise?  What might the difference be between a weak heart and a strong one?","    You begin to see more connections between health and exercise, and feel as if","    you've reached a new level of understanding of medicine.","    *set medicine +1","*elseif bestStat = \"rhetoric\"","    it is that metaphors are not merely convenient ways of explaining concepts, but","    are, in fact, that understanding.  Even the most scholarly historian speaks","    of the \"rise\" and \"fall\" of empires:  up for good, down for bad.  Metaphor is an","    inescapable part of understanding, and a speaker who has not found a metaphor has","    no hope of being understood, except by those who already believe the message.","    As you write these ideas in your treatise, you already think they may be an exaggeration,","    but they are also a step toward a deeper understanding of rhetoric.","    *set rhetoric +1","*else","    you imagined a system of gears that would allow the wheels of a two-wheeled vehicle","    to rotate at different speeds while their axle was being driven by some external force.","    This would allow the outer wheel to spin faster than the inner wheel when this","    \"powered chariot\" was rounding a corner.  You think it is a good idea, and you put it","    in your treatise, describing how a slave within the chariot could possibly supply the","    requisite power by turning a crank.  That part seems inefficient to you, but the idea","    still seems interesting somehow.","    *set techne +1","*return","","","*label ptolemy4room","You are tutoring him in his room, which is full of art projects in various stages of completion—unfinished ","paintings, urns halfway done—with nary an athletic memento or mock weapon","that might be seen in another boy's room.","*return","","","*label two_thieves","*comment p4 just asked what's the matter because things are missing","What's the matter, you can't tell Ptolemy, is that the priest here","is doing exactly what you","*if no_more_thoth","    did","*else","    do","for Nefertari—stealing scrolls for","her floating Library of Thoth—only he is not doing a very good","job of concealing it.","","\"Welcome back to the Serapeum, ${name},\" the priest of Serapis says,","greeting you with a","*if serapis_believed","    low and long bow.  He must appreciate your restoration of his faith ten years ago.","    \"I see Serapis continues to work through both of us, toward the equality of","    the Egyptian people.\"","*else","    bow that seems mocking.  \"I hear you've stayed in the illusion business.","    Well, me too.\"","","\"What's he talking about?\" Ptolemy IV says, alarmed.","","*choice","    #If I call out this priest, it will make me less suspicious.  Nefertari would understand.","        *gosub kill_that_priest","    #In a private moment with the priest, I tell him his thievery is too obvious.","        You suggest to Ptolemy that he climb the statue of Serapis, which he does with","        agility and enthusiasm.  While he is distracted, you pull the priest of Serapis aside.","","        \"Are you a fool, man?\" you say.  \"It's clear there are many scrolls missing from this place.\"","","        \"People expect missing scrolls,\" he says.  \"It's a public library.  Nobody trusts the","        public.\"","","        \"But that's just it,\" you say.  \"This is a public library.  Why are you stealing from","        a public library?  They could just come here!\"","","        \"Have you really thought about our rules?\" the priest says sadly.  \"They can't really","        come here.\"","","        The priest of Serapis explains all the ways in which the Serapeum's rules","        make it difficult for Egyptians to borrow: renters can't borrow because patrons must own property, the poor can't borrow","        because a deposit is required, and so on.","","        \"That's easy enough,\" you say.  \"We'll change the rules.  Ptolemy truly does want this","        library to be open to everyone.  But you have to stop being so obvious about your thievery!\"","","        The priest agrees, and indeed, Ptolemy III is quite amenable to making the library more","        accessible to Egyptians.","","        But Nefertari is strangely displeased.  In your next rendezvous with one","        of her agents, the mysterious man delivers this note:","","        [i]You have served our people in the short term but not the long. In the future, try not[/i]","        [i]to make King Ptolemy look good. -N.[/i]","","        You shrug.  You did the right thing.  That's what matters.","        *set egypt_unrest %-10","        *set nefertari_rel %-10","","    #On second thought, let's not go to the Serapeum.  It's a silly place.","        \"Don't worry about it,\" you tell Ptolemy.  \"You know, this place is just not as interesting","        as I remember.  Would you like to get a snack?\"","","        \"Yeah, this place is boring,\" Ptolemy IV says.  \"Let's go.\"","","        You leave the priest to whatever fate might befall him.  Sure enough,","        his thievery is soon discovered, and Ptolemy executes the man.","        Riots briefly break out in the Egyptian quarter as a result of the","        popular priest's death, but then, riots always break out in the Egyptian quarter.","        *set egypt_unrest %+10","","*return","","","*label giving_away_scrolls","*set wanted_to_help true","After your field trip with Ptolemy IV is over, you go to the Great","Library to pick out some scrolls to give to the priest to win him over.","*return","","","*label p4_wins_serapeum","Unfortunately, Ptolemy IV has his own ideas, and he tells his father about","the priest's behavior.","","*if offered_gift","    The priest is executed; worse, the story","    circulates that you were the one who ordered his death, because","    you were offended when he refused your gift.  Worshippers saw him","    bat away your invention, but did not hear the context of the missing","    scrolls.","    *set nefertari_rel %- 20","*else","    The priest is executed, leading to riots across the Egyptian quarter.","    He apparently came from an important Egyptian family, with many","    connections across the priesthood.","Meanwhile, Ptolemy IV seems to understand that you were","trying to ingratiate yourself with the priest, so he doesn't think","much of your choices either.","*set egypt_unrest %+ 10","*set ptolemy_4_rel %- 10","","*if wanted_to_help","    But you remain convinced that serving the Egyptians better would","    be best in the long run, and you do enact some policy changes","    at the Serapeum that should make it easier for them to borrow books.","    *set idealist %+ 10","    *set elitist %- 10","*else","    So much for not getting involved.","    *if invented_auto_doors","        Maybe the new priest will appreciate your automatic doors a little","        more.","*return","","","*label weak_rule_change","*set idealist %+ 10","*set elitist %- 10","You quietly change the rules of the Serapeum so that Egyptians are","able to check out scrolls more often.  Renters are allowed to borrow,","borrowers can demonstrate proficiency in any written language to","gain access, and the deposit is reduced to a truly trivial sum.","","Indeed, over the following months, many more Egyptians make use of the","Serapeum.  But the missing scrolls do not come back.  In fact, more","go missing.","*comment alexandria_knowledge change would be harsh,","*comment and we establish in another path these scrolls aren't great","","In retrospect, you suppose capitulation is not as powerful as negotiation.","But you hope that in sparing the priest's life you avoided an ugly conflagration.","","*comment emboldening the Egyptians","*set egypt_unrest %+ 5","*return","","","*label p3_no_serapis","\"My patience with this man is at an end,\" Ptolemy III says darkly.  \"He has","retained his important post because he is from a well-respected family among the","Egyptian elites.  No longer.  Now he will die.\"","","Ptolemy IV imitates a swing of the headman's ax, and a crowd cheering.","","Which is more or less what happens a week later, only when the priest's head","rolls into the basket, the roar from the amphitheater crowd turns angry.","Egyptians and Greeks draw knives on each other, and you hastily escort","Ptolemy IV from the brewing riot.","","\"Did you see his head roll like that?\" Ptolemy IV says.  \"That was so—\"","","\"A mistake,\" you say, cutting short the ten-year-old's retelling.  \"I think","this may have been a mistake.\"","","*if serve_nefertari","    Indeed, your further attempts to find agents of Nefertari prove fruitless.","    Nefertari now wants nothing to do with you.","    *set serve_nefertari false","","The riots over the priest's death continue for a week.  Though it is the Egyptians","who are angriest, it is the Egyptian quarter of the city that endures the","bulk of the arson.  Eventually, things return to an uneasy truce.","*set egypt_unrest %+ 10","*set nefertari_rel %- 20","*return","","","*label p3_serapis_believed","But when you achieve your audience with Ptolemy III, you are surprised to","learn he has no interest in killing the priest.","","\"Whatever you said or did to the man ten years ago has worked brilliantly,\"","Ptolemy III says, toying with a gold scepter in his hands.  \"He has been a","stout advocate for Serapis ever since.","What would it mean to kill him?  It would be like killing the idea of unity","itself.\"","","*if serve_nefertari","    You are pleased by this line of thinking.  Perhaps Ptolemy would show","    mercy to you as well, if your service to Nefertari were ever revealed.","*else","    \"But he's stolen so many books for the Egyptians,\" you say.  \"I believe he is","    helping them start their own library.\"","*gosub save_the_faithful","*return","","","*label save_the_faithful","","\"I say we kill him,\" Ptolemy IV opines.","","\"If a fervent believer in unity is stealing books nonetheless,\" says the king,","\"we should find out why the Egyptians find the Serapeum unfit for their purposes.\"","","The King calls for one of his royal accountants, an Egyptian himself,","and asks why an educated Egyptian such as himself may not use the Serapeum.","","\"Sire, one must have a permanent place of residence to check","out scrolls from the Serapeum,\" the old man says, bowing his shaved head","a little.  \"Renters are not allowed, ostensibly because of the difficulty","of collecting fines if they move.  And the Egyptians almost all rent.\"","","Ptolemy III suddenly looks extremely angry.  He throws his scepter to the marble","floor, chipping the marble and denting the scepter's orb.","","\"Why did you not tell me this before?\" he shouts at you.  \"That was to be a","house of unity!  What good is a house of unity where we oppress the Egyptians?  What part of the Serapis cult did you not understand?\"","","Caught off guard, you say, \"The rules were in place before I","arrived, and they are the same for Greeks and Egyptians.  It did not occur","to me they would be unfair.\"","","\"Let the renters borrow books,\" Ptolemy III says darkly.  \"The scrolls we put","in that public library are trash.  I don't care if they wander.  Serve Serapis,","librarian, and give the Egyptians what they want!\"","","\"We're not going to kill him?\" Ptolemy IV says.","*set petty %- 5","","\"Out!\"","","You change the rules for the Serapeum so that renters can borrow from the library","as well.  You aren't certain whether Ptolemy also intimidates the priest a bit,","but the scrolls return to their proper shelves soon enough.  Perhaps the priest","convinced the Egyptians that sharing the library best served Serapis after all.","*set egypt_unrest %- 10","","*if serve_nefertari","    At your next rendezvous with an agent of Nefertari, the agent never shows up.","    Instead, there is simply a note under a rock:  [i]We're done. -N.[/i]","","    You think Nefertari should be happier about the new library rules, but","    you suppose your actions didn't look much like helping.","","    *set serve_nefertari false","*return","","","*label offer_to_the_priest","You make your case as best you can.  \"But I won't change the policies","unless those scrolls come back,\" you finish.","","*if (rhetoric >= 5) or (serapis_believed)","    The priest nods.  \"You make a good case.  Our people would be better off","    united.","    *if serapis_believed","        I thought I served Serapis by making the Egyptians and Greeks","        equal, but separation is not unity.","    I see that now.","    Very well, I will see to it that the scrolls return to the Serapeum.\"","    *set idealist %+ 10","    *set elitist %- 10","","    When you visit again in a week, most of the missing scrolls have been returned.","    You see to it that the rules for borrowing change, and soon,","    many more Egyptians visit the lending library.","    *set egypt_unrest %- 10","*else","    \"We are an administration of liars,\" the priest says bitterly.  \"Your","    promises are worth nothing, and neither are mine.  Do what you will.\"","","    You are unable to convince the priest that no harm would come to","    him or the other thieves if they returned the scrolls.","","    You take a day to deliberate about what to do, but the priest","    of the Serapeum is gone by the next day.  A rumor reaches you that the man","    had been thinking of taking a job at another library, and that it","    might be called the Library of Thoth.","    *set egypt_unrest %+ 5","","    Do you wish to make the changes in policy anyway?","    *choice","        #Yes, it is still the right thing to do.","            *gosub weak_rule_change","        #Not anymore.","            *set elitist %+ 10","            *set idealist %- 10","            You have had it with the Egyptians, and see no reason to","            make it even easier for them to steal your scrolls.","            Perhaps someday, you'll revisit the policy.","*return","","","*label kill_that_priest","\"I am afraid you have made a grave error,\" you tell the priest of Serapis.","\"Come, Ptolemy.  I believe we have some business to attend to.\"","","\"My father's gonna [i]kill[/i] you,\" Ptolemy tells the priest, ruining whatever","subtlety you had hoped to achieve.","","*if serapis_believed","    \"So be it,\" says the priest.  \"I have a greater lord now, and that lord is Serapis.","    He will understand that I did what I must to save the Egyptian people.\"","","    *gosub p3_serapis_believed","","*else","    \"Your father is a liar, and he has made a liar out of me,\" the priest snarls.","    \"May the true gods reward me for my faithfulness to the Egyptian people.\"","","    You convey this statement, along with news of the missing scrolls, to Ptolemy III","    in his throne room.","","    *gosub p3_no_serapis","*return",""], "labels":{"end_serapeum":697,"ptolemyquestion":1113,"end_of_berenice_section":1201,"ask_berenice_for_no_olympics":1426,"to_the_olympics":1682,"end_of_olympics":1819,"warnptolaboutagath":2157,"warnagathoclea":2243,"poetryplz":2357,"agathoclea_end":2381,"zookeepers":2387,"yessirormaam":2399,"postcourieridea":2408,"ptolemy4room":2437,"two_thieves":2444,"giving_away_scrolls":2521,"p4_wins_serapeum":2528,"weak_rule_change":2563,"p3_no_serapis":2585,"p3_serapis_believed":2615,"save_the_faithful":2635,"offer_to_the_priest":2686,"kill_that_priest":2731}}