{"crc":-1889386692, "lines":["Thank you for playing [i]Choice of Alexandria[/i].  ","","*feedback","","Choice of Games releases new games like this one on a regular basis.","*subscribe","*page_break","","The character you play in the game is based on the real-life librarian Eratosthenes. Ptolemy III, Ptolemy IV, Berenice II, Euclid, Archimedes, Sosibius, and the historical Hypatia were all real people. Eratosthenes really did calculate the circumference of the Earth and tutor Ptolemy IV, along with inventing modern geography and other remarkable accomplishments.  The real Sosibius succeeded in becoming Ptolemy IV's trusted but evil advisor.","","The real Euclid is thought to be male, but very little is known about the life of Euclid. (Euclid's [i]Elements[/i] was a cornerstone of mathematical education for two thousand years—high-school geometry classes teach material from it still.) Ptolemy III seems to have been a very capable ruler, whereas Ptolemy IV was weak and malleable.  The Ptolemies really did invent a god, Serapis, to try to unite the Greeks and Egyptians,","and the Serapeum is thought to be all that remained of the Great Library by Hypatia's time.","","Berenice II did murder her first husband when she caught him sleeping with her mother.  But her love for Ptolemy III was the stuff of legend. She also competed in the Olympics, presumably in the chariot races, since women were not allowed to compete in other events.","","Cleopatra, by the way, was a Ptolemy as well; her father was Ptolemy XII. Like all the Ptolemies, Cleopatra was Greek, not Egyptian.","","The protagonist's inventions are a little anachronistic, but are largely based on those of","Heron of Alexandria, who came a little later—around 40 C.E.  Heron's inventions include the","\"automatic doors\" of Chapter 2, the \"robot\" of Chapter 4, and the aeolipile,","a primitive precursor of the steam engine.  The \"Claws of Archimedes\" and a sun-focusing mirror","are both inventions attributed to Archimedes (a real-life friend of Eratosthenes), but the details as to how and whether they worked","are controversial.","","There are seven entirely different versions of the final chapter, each set in a different year.  To get the more unique endings, try either avoiding a revolt and concentrating on a particular skill, or achieving political power at the expense of a revolt and a dead character or three.  The ending most closely","matching our own history is the one set in 391 C.E., the year Theodosius closed the Serapeum.  Hypatia,","the last famous scholar of Alexandria, was tortured and killed by a mob in 415 C.E.","Something rather better happens in the ending set in that year; I hope you reach it.","","If you enjoyed this, you may also enjoy","*link https://www.choiceofgames.com/robots/redirect.php?src=alexandriaGame Choice of Robots,","the other game I've written for Choice of Games.","Again, thanks for playing.","*line_break","~KG","*ending",""], "labels":{}}