{"crc":-785198903, "lines":["*image chap7.png center Chapter Seven: The Test of Time","","*set epilogue true","","*if (not(berenice_dead))","    *achieve long_live_the_queen","","*comment ---------Alternate endings--------------","*if invented_steam_engine","    *goto steam_engine_ending","*if invented_germ_theory","    *goto germ_theory_ending","*if wrote_epic","    *goto wrote_epic_ending","*if good_egypt_end or royal_heir","    *set bce_end true","    *goto cleopatra_ending","*if you_are_sosibius","    *set bce_end true","    *goto evil_ending","*if alexandria_falls","    *goto hypatia_at_serapeum","","*comment --------Default ending------------------","*set year 2013","[b]2013 C.E.[/b]","*if colossus_built and colossus_safe","    *achieve colossus","","*if invented_auto_doors","    The doors to Mirkous's apartment building swish shut behind him","*else","    The door to Mirkous's apartment building bangs shut behind him","as he strides toward the Bibliotheca Alexandrina.","He's going to interview Hypatia Moore, an American graduate student","studying a manuscript left by the ancient librarian","${name}, for his school newspaper.","","It isn't what he would have chosen to cover, not with ","*if (not(alexandria_falls)) and invented_geography","    all the riots going in the American colonies.","    American independence from Alexandria would be big—surely he","    should be interviewing the Americans who are still in Alexandria about","    how they would feel about independence.","*else","    all the student demonstrations going on.  Protests led to","    Mubarak's resignation in 2011, and the current protests could oust","    President Morsi.","*comment 30 June 2013","*if elitist > 50","    The old regime of Alexandrian nobility might be crumbling, and that","    itself is a sea change.","*else","    Alexandria is a democracy, and that means people need to be","    aware of current issues above all.","What does ${name} have to do with what's really important?","","","*if colossus_built","    Mirkous's walk takes him past ","    *if colossus_safe","        the Colossus of Alexandria,","        the giant statue of ${colossus} that is a symbol of how powerful","        *if alexandria_falls","            Alexandria once was.","        *else","            the Alexandrian Empire truly is.","    *else","        the ruins of the Colossus of Alexandria, a symbol that","        Alexandria's time of greatness is long past.","    *if idealist > 50","        It is a symbol, too, of how Alexandria has always been an idealistic","        culture, bent on glory over practicality.","    *else","        It is an eyesore, as most Alexandrians felt that the cost of its","        maintenance would be better spent on something else.","    He wonders whether ${name} would have seen the Colossus the same way.","    Probably not, he decides—nobody really sees anything the same way.","","*page_break","","The Bibliotheca Alexandrina is a modern building that looks like a circular wedge of glass,","*if library_safe","    although the original two-thousand-year-old Great Library is still preserved","    and connected to the new building.","*else","    very different from the original library it is named after.","A sign in front welcomes travelers in","*if egypt_wins","    hieroglyphics.","*elseif alexandria_falls","    Arabic.","*else","    *if egypt_unrest < 50","        Greek and hieroglyphics, just like the Pharaonic proclamations of yore.","    *else","        Greek.","","Hypatia is there by the entrance, a redheaded American graduate student","wearing glasses, a yellow blouse, and jeans.  She and Mirkous exchange hellos,","and Mirkous asks Hypatia to call him Mark.","","\"Hypatia is a unique name,\" Mirkous says.","","\"It's not easy being named after","the scientist who","*if alexandria_knowledge >= 7","    discovered the laws of planetary motion and calculus in 416 C.E.,\"","*else","    proved the earth goes around the Sun in 416 C.E.,\"","Hypatia says.  \"It's a lot to live up to.\"","","\"I","*if alexandria_falls","    can't","*else","    can","imagine,\" Mirkous says.","","\"But the fascinating thing is that Hypatia could have been someone totally","different if ${name} had led a different life,\" Hypatia says.","*if (not(ptolemy_4_dead)) and (not(egypt_wins))","    \"Ptolemy IV","*else","    \"${name}","put the policies in place that would make the Great Library and Musaeum","strong for years to come, so that they were still around for Hypatia to use","hundreds of years later.","*if (not(ptolemy_4_dead))","    And Ptolemy IV directly credits ${name} for teaching him the importance","    of knowledge and wisdom.","If it weren't for ${name}, who knows whether Hypatia would have made","her discoveries hundreds of years later?","And maybe I myself would never have gotten interested in Alexandria.\"","","\"Hard to write a story about that,\" Mirkous says.  \"What's another reason","${name} is so interesting?\"","","*page_break","","*if egypt_wins","    \"If ${name} had advocated for reforms for the Egyptian people instead","    of allowing a revolution to happen, Alexandria might still be ruled","    by Greeks today.\"","","    \"Surely it was only a matter of time before the native Egyptians","    sent their colonial oppressors packing,\" Mirkous says.  \"That sort","    of situation never lasts forever.  Got anything else?\"","","*if invented_geography","    \"${name} was the first to calculate the circumference of the earth,\"","    Hypatia says.  \"That was the reason at least some people thought it was","    feasible to circumnavigate the globe.  And that led to the discovery of","    the New World.\"","","    \"I have to find a way to make this manuscript relevant to the present,","    though,\" Mirkous says.","","\"Well, it was thanks to ${name}'s smart choices that Alexandria didn't go","into decline,\" Hypatia says.  \"There were plenty of opportunities—either","the royal guard or the Egyptians might have had a successful revolt.\"","","\"Which reminds me of the potential revolutions I ought to be covering,\"","Mirkous says.","","\"${name} was a turning point in history, especially for the history","of Alexandria,\" Hypatia says.  \"I'm convinced that Alexandria would be","just another city on the Mediterranean if ${name} had acted differently.","Instead, the Alexandrian Empire is the most powerful nation in the world","today, able to send astronauts to Mars, fund huge public works projects","like the Sahara solar farm, and enforce peace treaties the world over.","That's all because of ${name}.  I'm sure of it.\"","","Mirkous shrugs.  \"A little exaggerated, I think, but I can see where you're","coming from.  Let's see this manuscript ${name} left behind.\"","","The two of them enter the library, navigate a maze of corridors meant for","scholarly personnel, step into a temperature-controlled","room full of drawers and cabinets with indecipherable alphanumeric labels,","and retrieve the manuscript from a locked drawer.  The scrolls","are carefully preserved between sheets of glass.  Hypatia","reads just a fragment to Mark.","","It is a retrospective you wrote just before your death, about the decisions","you made in life.","","What were your feelings in the end about how you raised Ptolemy IV?","*temp wasNot \"was not\"","*if primary_caretaker = \"you\"","    *set wasNot \"never should have been\"","*choice","    #He ${wasNot} my responsibility.  I was a librarian, not a babysitter.","        *if petty < 50","            \"Isn't that interesting?\" Hypatia says.  \"The whole time, even as ${name} was","            being a good tutor, the librarian part of ${phim} resented it.\"","","            *if ptolemy_4_dead","                \"Of course, it hardly matters,\" Mirkous says.  \"Ptolemy IV died before","                he could really accomplish anything.\"","","                \"But what if even that is somehow the librarian's doing?\" Hypatia says.","                \"We don't have good records of how Ptolemy IV died;","                I bet the trusted librarian could have done something to stop it.\"","","                \"And then, perhaps, Alexandria would have had a golden age?\" Mirkous says.","                \"That's a lot of ifs.","                *if (not(alexandria_falls))","                    And Alexandria did quite well for itself anyway.\"","                *else","                    I don't buy it.\"","","                \"I'm feeding you your story,\" Hypatia says.  \"One teacher can make","                all the difference.\"  But Mirkous isn't having it.","            *else","                *if alexandria_falls","                    *comment no petty alteration in siege so Egyptian revolt","                    \"Didn't it end up not really mattering how good a tutor ${name} was?\"","                    Mirkous says.  \"I read up on the librarian's life, and it seemed like","                    an Egyptian revolt near the end of it put Alexandria permanently on","                    track to be an also-ran empire.\"","","                    \"Hmm, a librarian who thought","                    *if male","                        he","                    *else","                        she","                    was too good for babysitting, and an empire that thought it was too good","                    for the Egyptians,\" Hypatia says, tapping her chin thoughtfully.  \"Perhaps","                    it's too much of a stretch, but I can't help but shake the feeling that","                    there may be a connection there.  I wonder if ${name} was in a position","                    to reach out to the Egyptians, too, but thought it wasn't","                    *if male","                        his","                    *else","                        her","                    responsibility.\"","","                    \"In other words, you think this comment sounds like privilege talking,\"","                    Mirkous says.","","                    Hypatia shrugs.  \"To put a very modern spin on it, yes.\"","","                    \"Doesn't mean this librarian single-handedly caused a revolt,\" Mirkous says,","                    frowning.  \"What else you got?\"","                    ","                *else","                    \"So one of the greatest leaders of the ancient world was produced","                    just because someone told the librarian to do a good job,\" Mirkous says,","                    now genuinely curious.  \"I wonder how Ptolemy would have turned out if","                    the librarian had been actually interested in teaching.\"","","                    \"Now you're getting the fun of the 'what if' game,\" Hypatia says.","        *else","            \"You see the chain of events now?\" Hypatia says.  \"An uninterested librarian","            allows another advisor, Sosibius, to sway the young child.  The child","            learns to self-indulge from Sosibius, and begins to trust Sosibius's advice.\"","","            *if ptolemy_4_dead","                \"Leading to an unfortunate series of decisions that gets Ptolemy IV killed,\"","                Mirkous says.","            *else","                \"Leading to a terrible reign that ultimately","                *if alexandria_falls","                    brings Alexandria into decline,\" Mirkous says.","                *else","                    isn't quite enough to bring down Alexandria, but comes close,\" Mirkous says.","            \"Still, do you really think Ptolemy IV had it in him to be a wise ruler?\"","","            \"It's nature or nurture, and the Ptolemies weren't short on genetic blessings—not then,","            anyway,\" Hypatia says.  \"Ptolemy IV had every advantage but two disadvantages:","            one uninterested teacher and one self-serving one.\"","","            \"You said 'not then.' Why?\"  Mirkous says.","","            \"Oh, the Ptolemies started being horribly incestuous from just after ${name}'s","            time up to and including Cleopatra,\" Hypatia says cheerfully.","","            \"Ugh,\" Mirkous says.  \"Did not need to know that.\"","","    *if (petty < 50) #I was quite proud of him.  He turned out well.","        *if ptolemy_4_dead","            \"It's interesting that ${name} would be proud of Ptolemy IV despite his death,\"","            Mirkous says.","            *if alexandria_falls","                \"And despite the fact that Alexandria went into decline.\"","","            \"${name} clearly isn't focusing on outcomes, but on Ptolemy IV's character,\"","            Hypatia says.  \"And the evidence suggests that he was a good person.  That","            is something ${name} could have been proud of.\"","        *else","            *if alexandria_falls","                \"He did turn out well, by all accounts,\" Hypatia says.  \"It seems almost","                unfair that Alexandria went into decline regardless.\"","","                \"You mean he turned out well by the standards of the times,\" Mirkous says.","                \"Maybe that wasn't good enough.","                *if egypt_unrest > 50","                    Didn't the Egyptians revolt?  They probably wouldn't have done that","                    unless they'd been treated badly.\"","                *else","                    Wasn't there some kind of revolt?  Surely someone was being treated badly.\"","","                \"That was the fault of societal pressure,\" Hypatia says.","","                \"And maybe some of that was","                *if egypt_unrest > 50","                    racism","                from on high, and maybe a little of [i]that[/i] was","                learned from your hero,\" Mirkous says.","","                \"Maybe,\" Hypatia says ruefully.","            *else","                \"No surprises there,\" Mirkous says, frowning.  \"Teacher has star student,","                boy makes good, teacher is pleased.  Yawn.\"","","                \"Come on,\" Hypatia says.  \"Good teaching saved an empire.  That's sweet.\"","","                \"You don't know that it did,\" Mirkous says.","","                \"Call it a hunch.\"","","    #I thought of him as the son I never had.","        *if petty >= 50","            \"How tragic is that?\" Hypatia says.  \"Here this librarian thinks of the boy","            as the son ","            *if male","                he","            *else","                she","            never had, and the boy ends up caring only for luxuries and","            Sosibius.\"","","            \"It's interesting,\" Mirkous agrees.  \"Although I wonder whether ${name} might","            have spoiled the boy a little","            *if male","                himself if he","            *else","                herself if she","            thought of young Ptolemy as the son","            *if male","                he","            *else","                she","            never had.  And wasn't the problem with this boy that he","            was spoiled rotten?  Maybe a little of that came from ${name} after all.\"","","            Hypatia frowns.  \"Maybe.\"","        *else","            \"Isn't that sweet?\" Hypatia says.  \"Perhaps Ptolemy IV turned out so well","            because he had not one","            *if male","                father,","            *else","                mother,","            but two.\"","","            *if ptolemy_4_dead","                \"Turned out so well?\" Mirkous says.  \"He died violently, as I recall.\"","","                \"But he was supposed to have been such a nice boy,\" Hypatia says.  \"At any rate,","                imagine how devastated ${name} must have been.\"","","                Mirkous nods.  \"All right, I admit, there's a story here.\"","            *else","                \"I don't know, it seems a little sad to me,\" Mirkous says.  \"${name}","                never got to have any real kids—it seems like all that effort was","                spent on Ptolemy IV instead.  The privileged getting more privileged…it","                hardly seems heartwarming to me.\"","                ","                \"They were people forming a real connection, and that's beautiful any","                way you look at it,\" Hypatia says.","","                Mirkous gives Hypatia a curious look.  \"Depends on the people,\" he says.","    *if (petty >= 50) #I wish I had not let him turn out the way he did.","        \"I wish I had not let him turn out the way he did,\" Hypatia translates from","        the ancient Greek.","","        *if ptolemy_4_dead","            \"What, dead?\" Mirkous says.","","            \"I think ${name} is referring to Ptolemy's bad behavior,\" Hypatia says.","","        \"How's that?\" Mirkous says.","","        \"The lecherousness, the wild parties…they say Sosibius really taught the","        boy to spend money and live extravagantly.\"","","        \"What's wrong with living a little wildly?\" Mirkous says.  \"It seems to me you","        could live it up and still run a kingdom.\"","","        *if ptolemy_4_dead","            \"I suppose in the case of Ptolemy IV, we'll never know,\" Hypatia says.","        *elseif alexandria_falls","            \"Not if your royal guard ceases to respect you and revolts,\" Hypatia says.","            \"Alexandria went into decline when that happened.\"","","            \"So clearly, Ptolemy IV should have invited them to all these parties.\"","","            Hypatia grins at him at little.  \"Yeah, probably.\"","        *else","            \"I suppose history has proven you correct, though it was certainly a close","            call,\" Hypatia says.  \"The royal guard revolted because they didn't respect","            Ptolemy IV.\"","","            \"Let me guess: ${name} saved the day?\"","","            \"Sort of,\" Hypatia says.  \"It was the older guards that revolted…but","            there were newer guards who had been hired at ${name}'s suggestion,","            and they beat down the rebellion.\"","","            \"So ${name} is pretty much responsible for everything about this whole chunk","            of history.\"","","            \"Cool, isn't it?\"","    #I tried, but apparently, my strengths lay elsewhere.","        \"I tried, but apparently, my strengths lay elsewhere,\" Hypatia translates from","        the ancient Greek.","","        *if petty >= 50","            \"Seems like ${name} didn't really try that hard,\" Mirkous says.","        *elseif ptolemy_4_dead","            \"Poor ${name}, putting all that time and effort into the kid, only to see","            him wind up dead.\"  Mirkous shakes his head.","        *else","            \"But I thought the kid turned out all right in the end,\" Mirkous says.","","        \"Well, maybe ${name} was right, and","        *if male","            he","        *else","            she","        should have focused on other things instead,\" Hypatia says.","        *if invented_steam_engine","            \"I mean, the steam engine!  What an invention!","        *elseif invented_germ_theory","            \"I mean, it's thanks to ${name} that modern medicine is what it is!","        *elseif wrote_epic","            \"I mean, just look at ${epic_title}!  Think of the classics that ${name}","            never wrote because there wasn't time.","        *elseif invented_auto_doors","            \"I mean, automatic doors, over two thousand years ago!","        *elseif invented_geography","            \"I mean, figuring out the circumference of the earth, nearly two thousand","            years before Columbus!","        *else","            \"I mean, it seemed like","            *if male","                he","            *else","                she","            was good at so many things.","        Imagine if ${name} hadn't been distracted with teaching the prince.\"","    ","Hypatia and Mirkous turn their attention back to the manuscript.  \"Can we skip to the end?\"","Mirkous says.  \"Maybe there's something I can use there.\"","","What is the final message you closed your memoir with?","*choice","    #\"I gave up much to achieve what I did, but I regret nothing.\"","        *set elitist %+10","        Hypatia reads this final line to Mirkous.","","        \"And what do you think?\" Mirkous asks Hypatia.  \"Was ${name} right","        to give up so much?\"","","        Hypatia considers this, then nods.  \"I think so.  I certainly","        hope to achieve greatness, and I expect to give up a lot to do it.\"","","        \"Too bad,\" Mirkous says.  \"I was going to ask if you wanted to get a beer.\"","","        Hypatia smiles and shakes her head.  \"No, no dates for me, if that's","        what you're suggesting.  I'm going for greatness.","        Changing the face of civilization.  ${name} would be proud.","        Just you wait.\"","    #\"A city is only as great as its people.\"","        *set elitist %+10","        Hypatia reads this final line to Mirkous.","","        \"What does that mean?\" Mirkous says in irritation.","","        \"I think it's perceptive,\" Hypatia says.  \"What are nations","        and time periods but human inventions?  History is","        always just stories about people.  And people haven't changed","        as much as we might think in two thousand years.\"","","        *if alexandria_falls","            Mirkous frowns.  \"You're saying that even we are just one","            malicious Sosibius away from disaster.\"","","            Hypatia shrugs.  \"History shows it's only a matter of time.\"","","            \"What kind of view is that?\" Mirkous says.  \"Can't we do anything?\"","","            \"Of course we can,\" Hypatia says.  \"That's what ${name} is saying.","            It's up to us.  If you and I tell this story right,","            we might just change the course of history.\"","        *else","            \"So you think people are fundamentally good?\" Mirkous says.  \"That","            because ${name} saved Alexandria, there's hope for all of us?\"","","            \"I'd like to think so,\" Hypatia says.  \"But we have a choice.","            That's the point.  We are free to make a better future, the","            way ${name} chose a better future.\"","","            Mirkous purses his lips.  \"I'm not sure people are like that anymore.","            People today are pretty selfish.\"","","            \"We're all just [i]Homo sapiens[/i], then and now,\" Hypatia says.  \"The frightening thing","            is, there's nothing keeping any of us from being as amazing as ${name}.","            Somehow, it's possible.  Think of that the next time you're","            watching reruns on TV.\"","","            Mirkous rolls his eyes.  \"Thanks a lot.\"","","            Hypatia shrugs.  \"Welcome to my world.  You think it's easy","            studying ${name} and then thinking about what I've done with [i]my[/i]","            life?  But every day I'm a better person than I was yesterday, just","            like how most days, humanity ekes out a little improvement too.","            We're getting there.  And I'm excited to see what comes next.\"","    ","    #\"Teaching, in the end, was my greatest responsibility.\"","        *if petty >= 50","            Hypatia reads this last line, then adds, \"How sad that ${name}","            realized too late that ","            *if ptolemy_4_dead","                Ptolemy IV was listening to Sosibius even as ${name} was","                making such great discoveries.\"","            *else","                the education of Ptolemy IV was so","                important to the future of Alexandria.\"","        *else","            Hypatia reads this last line, then adds, \"It's true, ${name}","            gave up a lot to take care of Ptolemy IV.  I wonder if I","            would have been so willing to give up on my studies.\"","","        \"People can be more important than books sometimes,\" Mirkous says.","","        \"Sometimes,\" Hypatia concedes.","","        \"On that note, would you care to talk more about ${name} over a beer?\"","","        \"That depends,\" Hypatia says.  \"Are you willing to be taught?\"","","        \"My brain is open,\" Mirkous says.","","        \"Then you're on,\" Hypatia says.  \"I","        *if (petty >= 50) and (not(ptolemy_4_dead))","            won't make the same mistake as ${name}—I won't forget to teach.\"","        *else","            can take a page from ${name}—a scholar has to teach now and then.\"","            ","*finish The End","","*label steam_engine_ending","*set year 415","[b]415 C.E.[/b]","","\"Oh, this is ridiculous,\" Theon says as he jams on the \"forward\" button","of his wheelchair.  The wheelchair refuses to budge when he hits","buttons:  dead battery, probably.  But he finds he can push himself forward just","fine if he treats","his fancy device as a normal wheelchair.  So he does exactly that,","leaving his cluttered dormitory room at the Musaeum and heading down the","polished marble hallway of the great institution of learning.","","\"Oops, almost forgot,\" Theon says to himself.  He had planned to give","his daughter Hypatia a little something as a going-away present—something","you made, over six hundred years ago.  What is it?","","*temp gift \"none\"","*choice","    #An aeolipile—essentially an old prototype of a steam engine.","        *set gift \"aeolipile\"","    *if (invented_geography) #A map of the Earth, as accurate as I could make it back then.","        *set gift \"map\"","    *if (invented_optics) #A small prototype of the mirror assembly I made that focuses the Sun's rays.","        *set gift \"small mirror assembly\"","    #A letter to be delivered from one Head Librarian to the next over the years.","        *set gift \"letter\"","","","Theon hunches over his wheelchair, digs through a pile of papers, and","pulls out your ${gift}.  He then heads out the door a second time.","","\"Professor Theon!\"  One of Theon's students, a young Egyptian man named","Ramses, has spotted him in the hall.  His faded jeans and","weathered chiton suggest he hadn't been planning to talk to faculty","today, but the young man is all sanguine as he waves.  \"Professor Theon,","are you trying to get to the launch?\"","","\"Yes, I'm supposed to meet my daughter at the heptastadion,\" Theon says.","\"Excuse me, I meant the Bridge of Wonders.  Can't get used to these new","names for things.\"  He pushes the buttons on his chair uselessly.  \"And","my chair isn't working.\"","","\"I can push you somewhere if you want,\" Ramses says.","","\"You're a star student,\" Theon says.  \"I won't have you pushing my chair.","It's beneath you.\"  Theon remembers how hard the Egyptians fought for equality","in his youth; he feels uncomfortable at the idea of having an Egyptian","play his servant.","","That fight for equality is yesterday's news to Ramses, who","shrugs. \"I really don't mind.\"","","Theon sighs.  \"Being old's no fun.  Sometimes it seems like I was meant to have","died already.\"  At Ramses's pained expression, Theon says, \"Sorry.  Of","course.  I'd be delighted.\"","","Ramses takes the old Greek man's wheelchair and pushes him through","the Musaeum.","","\"You must be pretty proud of Professor Hypatia,\" Ramses says.  \"Going to","outer space!  Not many people would be selected for the honor.\"","","\"She is the most amazing person I have ever met,\" Theon says softly.","\"And I have lived a long time.\"","","They exit the dormitories and enter the segment of the Musaeum","with lecture halls.  Snatches of lectures drift from open doors, on topics","ranging from Euclid's [i]Elements[/i], to ${name}'s [i]Steam and Automata[/i],","to Hypatia's [i]Relativity[/i].","","\"How old [i]are[/i] you, if you don't mind my asking?\" Ramses says.","","\"I am eighty years old,\" Theon replies.","","\"Wow,\" Ramses says.  \"I bet a lot can happen in eighty years.\"","","\"Yes,\" Theon says.  \"When I was a child, the gas-powered automobile hadn't even","been invented yet.  We were still all just using ${name}'s steam-driven","carts and trains.  Imagine!  Many of those tracks were used for centuries.","But perhaps it was because ${name}'s steam carts were so good that it took","so long for us to move past them.\"","","*page_break","Theon and Ramses leave the Museum proper and head down the sidewalk ","along the edge of the harbor, toward","the Bridge of Wonders.  The streets are crowded, as usual, with people from","all over the world.  The cars on the street are utterly stuck in traffic in","streets never meant to hold quite so many people, much less motor vehicles.","Even the cars are from all over the Old World:  bulky Roman Centurions,","small Indian Shivas, sleek Lucky Eights from China.","","In the distance, Theon sees two towers rising from the island of Pharos.","To the right is the lighthouse,","*if (not(lighthouse_safe))","    no longer operational after all these years, but still a symbol of","    Alexandria's longstanding ambition.","*else","    still operational after seven hundred years of service, and a symbol","    of Alexandria's enduring ambition.","And to the left is the launch tower, with Hypatia's rocket next to it.","The rocket was crafted to deliberately","resemble the lighthouse, and besides the missing square base and ","shorter height, it is an uncanny resemblance.  A mesh of supports surrounds","the rocket.","","Hypatia is waiting by the Bridge of Wonders, surrounded by reporters waving","microphones at her.  The regal-looking dark-haired woman is wearing a sky-blue","flight suit, her hair back in a bun.  She is in her late forties.","She patiently answers questions one after the other,","just as if she were holding class.  But when she turns and sees Theon,","she excuses herself and runs toward him.","","\"Father!\" Hypatia says, throwing her arms around him.  \"I'm so glad you","could see this.\"","","\"I only wish I could go with you, my dear,\" Theon says.  \"Don't we work","best as a team?\"","","\"Always,\" Hypatia says.  She then notices the ${gift} in Theon's hands.","\"What did you bring me?\"","","*if gift = \"aeolipile\"","    \"A little steam engine that once belonged to the great ${name},\"","    Theon says.  \"May it always remind you that an idea is never just","    a toy.\"","*elseif gift = \"map\"","    \"A map of the world as ${name} knew it,\" Theon says.  He gestures","    to the broad expanse of water where the western continents should be.  \"May it","    always remind you that however learned one is, there is still always much","    more to know.\"","*elseif gift = \"small mirror assembly\"","    \"A small model of the device ${name} used for focusing","    the Sun,\" Theon says.  \"May it always remind you that the weak, when","    focused, can become quite powerful.\"","*elseif gift = \"letter\"","    \"It's a letter,\" Theon says, \"written by ${name} to be handed down","    from Head Librarian to Head Librarian.\"","","    Hypatia frowns.  \"I'm not Head Librarian yet, Head Librarian.\"","","    \"Ah, but you will be soon enough,\" Theon says morosely.","*else","    *bug","","Hypatia accepts the ${gift}.","*if gift = \"aeolipile\"","    \"Cute,\" she says, spinning the little steam-driven wheel.","*elseif gift = \"map\"","    \"If we get lost in space, I'll tell the pilot that home looks","    like [i]this[/i],\" she jokes.","*elseif gift = \"small mirror assembly\"","    \"I'll have to see whether I can burn down Rome from space,\" she jokes.","*elseif gift = \"letter\"","    \"'I have no idea what the Alexandria you inherit will look like,'","    Hypatia reads.  \"'But I do know that you can raise a ruler to be","    both good and strong, and that you can be both a good teacher and a good","    scholar.  Act nobly but ambitiously, and everything can be yours.'\"","    Hypatia smiles.  \"Well, that's a lovely thought.\"","She then turns serious.","\"Father, you speak as if you think we'll never","see each other again.  I'll only be gone eight days.  I'm not even doing any","mad science—they just want me on the trip for symbolic reasons, since I was","so helpful with the calculations.\"","","Theon bursts into tears.","","\"Father, what is it?\" Hypatia asks.","","\"Professor Theon, are you all right?\" Ramses asks.","*page_break","","\"I don't know,\" Theon says, wiping tears from his eyes.","\"Sometimes I dream of the way things could be.","I have horrid, horrid dreams…\"  He puts his hand on Hypatia's cheek.","\"If anything were to happen to you…that would be the saddest thing I could","imagine.\"","","Hypatia puts his hand over his.  \"The feeling is mutual, Father.","But what did you always tell me when I was growing up?\"","","\"Reason conquers all?\" Theon says.  Ramses offers him a handkerchief,","and he takes it and blows his nose.","","\"Reason conquers all,\" Hypatia says confidently, gesturing to the","rocket behind her.","","\"Oh, my dear child,\" Theon says, squeezing her hand.  \"May you never learn","otherwise.\"","    ","*finish The End","","*label germ_theory_ending","[b] 1599 C.E.[/b]","","\"Hello!\"  Richard Burbage approaches the cottage where his friend Will","lives.  The farmhouse is actually larger than he expected:  Will ","called it a \"cottage,\" but it must have at least ten or twelve rooms,","all surrounded by a neat garden of rosebushes and lilacs.","It is summer, so no smoke issues from the chimneys of the Tudor-style,","timber-framed building.  For a moment, there is no sign anyone is home.","","A shrieking Judith Shakespeare runs out from behind the house, followed","closely by her twin Hamnet trying to tag her.  The children are","in their early teens, but apparently not too old for timeless playground","games.  At the sight of Burbage, the two stop short in front of the","house.","","\"Pa, your friend is here!\" Hamnet shouts.  As an afterthought, he tags","Judith.","","\"Hey!\" Judith says, and she tags Hamnet back.","","\"I'll be there anon, dear Hamnet,\" William Shakespare calls from the cottage.","\"Mr. Burbage, so glad you could make it to Stratford-upon-Avon.\"","","\"The pleasure's all mine, dear friend,\" Richard calls back.","*page_break","\"Our next play is going to be about [i]who[/i]?\" Richard asks Will over tea,","inside.","","\"${name} of Alexandria,\" William Shakespeare says calmly.  He turns to","Hamnet, who is wordlessly hovering nearby.  \"You know, you could keep playing","outside, sweet one.\"","","\"Can't I stay here?\" Hamnet says earnestly.","","\"Of course you can, dear boy,\" Will says with a smile.  Richard finds","that his friend Will doesn't look much like a father, even in his home with his","children.  With his mustache, neatly trimmed beard, and earring, he still","looks rakish, like a sailor.  He is dressed in a casual tunic that resembles Richard's,","nothing like what the two would wear when performing.","","\"What is with the obsession with Alexandria, Will?\" Richard says.  \"Forgive me,","but playing Caesar in [i]Cleopatra[/i] left a bad taste in my mouth.  Am","I to play another love-struck sop who sells out his empire?\"","","\"You never gave poor Caesar a chance,\" Will says with a smile.  \"I told you to play a","man who could have been great if his empire hadn't been playing hench","to another one.  You couldn't see past what was to what might have been.\"","Will raises his eyebrows.  \"Or are you sore I didn't make it about","Caesar?  I suppose I could have.  Their ends were tragic in equal measure.  But","I think the audience is more partial to Alexandria than Rome.  The tragic fall","was greater for the heroine from lofty Alexandria.\"","","\"Perhaps,\" Richard says with a sigh.  \"So, tell me about","${name} of Alexandria.\"","","*if male","    \"He","*else","    \"She","is the reason my dear Hamnet is still alive,\" Will says.","\"You remember when Hamnet fell abed with the bubonic plague, and I returned","to Stratford-Upon-Avon.  When I arrived, I learned my dear Anne had","already summoned a doctor.  I struck up a conversation with the man, and","his tales took my mind off my son's vacillation twixt life and death.  The doctor told me that","${name} had invented the medicine he was using to save my dear Hamnet.\"  Will","looks thoughtful for a moment.  \"The man also speculated that those very","drugs were the reason Alexandria fell to ruin—the population grew","to myriads of myriads, became uncontrollable","when their numbers were not kept in check.  Mark the","unintended consequences…there's something there that pulls me…\"","","\"Will, nothing in what you are saying makes for a good play,\" Richard says.","*if male","    \"Am I supposed to be a physician who wanders around until I one day","    say, 'Aha, germs'?  I'd take Caesar over that.\"","*else","    \"I could dress up like that woman just fine, but the plague-bearing rat","    sounds like the more interesting character here.\"","Richard wishes bleakly for a moment that this doctor had never come, but","then takes a look at young Hamnet hovering nearby and shakes his head.","He would never wish his friend such grief, not for the best part of all time.","","\"Ah, but there's more you don't know about the tale,\" Will says.","\"An evil advisor Sosibius, an Egyptian plot for rebellion, and","one more thing that I just uncovered in doing research about the librarian.\"","","What is the one fact we haven't mentioned about your life that","William Shakespeare will put into his play about you?","*temp somethingDifferent true","*fake_choice","    *if (not(ptolemy_4_dead)) #I manipulated Ptolemy IV when he became king in a way Sosibius could only dream of.","    #In time, I convinced the Egyptians I was the god Serapis.","    #I had a star-crossed romance with an Egyptian on the wrong side of town.","    #I led an underground society where librarians would punch each other.","    #When I was a student in Cyrene, a ghost of my father came to me and told me to avenge his murder.  I didn't do much about it, though.","    #Nothing.  My life in the preceding chapters was perfectly good material for Shakespeare.","        *set somethingDifferent false","        \"One more thing?\" Richard says.  \"Yes?\"","","        Will hesitates, then waves this idea away.  \"Nothing.  I'd thought about introducing","        a subplot in which ${name} and ","        *if male","            Ptolemy IV","        *else","            Berenice","        trade identities, and I had hoped to assay its credibility with you.","        But now, upon the verge of the unveiling, I see the madness in't.  The life of ${name}","        needs no embellishment.\"","*if somethingDifferent","    When Will explains this twist to Richard, Richard's eyes widen.  \"All right,","    there's something there, I'll grant you that.\"","","    *comment being tricky to get that space in one case and not the other;","    *comment wouldn't trust double line_break","Will shrugs.  \"Besides, the art is in the telling.  I'm sure I could write","a play where the hero is some lither lag indeed, and so long as","the feeling's fond and the words sooth, it could stand the test of","time.\"  He pauses for a moment, then adds, \"On the other hand, I'll","probably add a crocodile just to be safe.\"","","*finish The End","","*label wrote_epic_ending","[b]2003 C.E.[/b]","*if colossus_built and colossus_safe","    *achieve colossus","","She is in her pajamas, up way too late, and reading your book.","","A lot has happened in the past two thousand years.  Alexandria","discovered the new world.  Other empires rose and fell.  Disease wracked","the known world and killed millions.  Discoveries were made, from the","printing press to the television.","","But your book kept speaking its timeless truth, and now it is conveying","it to this thirteen-year-old girl as she is up past her bedtime reading it.","Her pajamas have elephants.  Her room is still pink, even though she told","her parents she doesn't like pink anymore.  She wears glasses that are thicker","than what you would expect for a thirteen-year-old.","","She closes the book reverently.  She's not used to this.  The other books she","reads are about vampire boyfriends and teens solving mysteries.  Your book","is something else.  She's not sure what to do with it.","","She wanders downstairs to the kitchen, pours herself a glass of water.","She just stares at it for a little bit, thinking about","*if epic_type = \"gods\"","    the eternal struggle of humanity against forces larger than itself.","*elseif epic_type = \"woman\"","    the whole life she is about to live, like the woman in your book.","*elseif epic_type = \"Archimedes\"","    *if archimedes_dead","        the senseless death of Archimedes.","    *else","        the friendship between ${name} and Archimedes that was strong enough","        to make it all the way into the book she holds in her hands two thousand years","        later.","It's almost too much to consider.","","\"Sweetie?\" She hears her mother's voice.  \"Are you all right?\"","","\"Yeah, Mom,\" she says.","","\"You're up really late,\" her mother says.","","\"Mom?\" she says, like she's about to ask a question.","","What question has your great work prompted her to ask her mother?","","*choice","    #\"Can we visit Alexandria some time?\"","        \"Of course, dear,\" her mother calls back.  \"You'll fly ","        to the capital as part of a field trip in ninth grade.  Now,","        go to bed!  You've got that Thanksgiving play tomorrow,","        and you don't want people to think you're portraying Native","        Americans as sleepy!\"","    #\"What's the point of existence?\"","        \"We're all just making it up as we go along, dear,\" her mother says.","        \"Now, go to bed!\"","","        The girl heads back to bed, dissatisfied.  There's got to be","        more to it than that.  Your book certainly made it feel that way.","","        Maybe if she just starts from the beginning again, she thinks as","        she picks up your book, maybe then she'll be able to piece","        it together…","    #\"Do Zeus and Serapis really exist, or are they just made up?\"","        There's a long pause from the other end.  \"Let's talk about that","        in the morning, honey.\"","","        She heads back to bed and picks up your book again.  Your book","        seemed so skeptical of the gods, even way back then.","        People can't believe the wrong thing for thousands of years…","        can they?","    #She can't put it into words.","        She wrestles with trying to put her feelings into words, but","        it's too big for her.  Anything she said would make the sacred","        profane.  It would sound dumb.","","        \"Never mind,\" she says.","","        \"Okay, good night,\" her mother calls.","","        But here a chasm has opened up between her and her mother.","        She realizes that now, there will be things they can't possibly","        talk about.  Maybe that's okay.  Maybe she can begin to be","        her own person.","","*finish The End","","*label cleopatra_ending","[b]30 B.C.E.[/b]","","In her hands is a box, an ornamental wooden box with little airholes on top.","","In the box is an asp.  Its venomous bite could kill her.  She can feel","it moving inside.  It seems expectant.","","Cleopatra, Queen of Alexandria, great-great-great-great-great-great-granddaughter of","*comment TODO: this probably means we need an illegitimate-made-legit heir plot","*comment since the MC is so old when marriage becomes possible.","*comment Nefertari is probably okay because her age is vague to begin with - could be 20 - ","*comment just make her the default mother.","*comment royal_spouse default:  if we somehow mess up, say this instead after \"${name} and\"","*temp royal_spouse \"her country\"","*if (good_egypt_end)","    *set royal_spouse \"Nefertari\"","    *if male","        Nefertari and ${name},","    *else","        Nefertari,","*elseif married_berenice","    *set royal_spouse \"Berenice\"","    Berenice and ${name},","*elseif married_p3","    *set royal_spouse \"Ptolemy III\"","    Ptolemy III and ${name},","*else","    ${name},","is sitting on a wicker chair","in her elaborately decorated bedroom, holding a box with a","poisonous asp inside, deciding whether to end it all.","","*page_break","","She misses Caesar.","","She thinks back fondly to when he first came to Alexandria.  She lured","Caesar to Alexandria by capturing his former friend and rival Pompey,","who thought to flee to Alexandria after losing a civil war against Caesar.","She had hoped to extract a hefty price for Pompey from Caesar, and","her negotiating was best done in person.","","But then, as soon as she saw Caesar for the first time,","walking down Canopic Street toward the palace with his honor guard,","armor gleaming, flags flying, something…just clicked inside her.  ","She knew that this man could completely unmake her.  She knew instantly","she would do anything for him, and that was so dangerous.","","So she did not admit him to the palace, but made him wait.  She had plenty","of excuses.  Caesar grew impatient, wondering when he would ever","see this fabled Cleopatra.  She wasn't ready, she told herself.  She","wanted to be queen, not this man's thrall.  It's what ${name}","and ${royal_spouse} would have wanted for her.","","But he finally got in anyway, sneaking into the palace by hiding in an enormous wine amphora.","Oh, to see the handsome man emerge, and already in her bedchambers, no less!","She couldn't help herself, nor could he: they made love that same night.","","A few months later, Cleopatra knew she was already pregnant.  More than","that, she was in love.  (So dangerous!)  Caesar, meanwhile, seemed smitten","himself, with her beauty and power and cleverness.  He still had not left","Alexandria, though the situation in Rome became more fragile with each day he lingered.","Cleopatra asked Caesar whether he might not simply be interested in marrying her and conquering","Rome for Alexandria.","","*temp already_king false","*choice","    #Caesar agreed to marry her, but only if Alexandria merged into Rome.  Cleopatra accepted.","        Cleopatra agreed to marry Caesar.  A few months later, once Caesar had","        time to divorce the wife whom he had neglected to mention,","        Alexandria became the Roman province of Egypt, and Cleopatra moved to Rome.","","        Rome took some getting used to; it was both older and shabbier than the metropolitan paradise","        that ${name} and ${royal_spouse} had created.  Its twisting, haphazard","        streets made it impossible to find anything.  Its inhabitants considered","        her \"exotic,\"","        *if royal_spouse = \"Nefertari\"","            having never seen someone of such thoroughly mixed lineage.","        *else","            calling her \"Egyptian\" even though her ancestors were all Greek.","        Cleopatra knew as soon","        as she arrived that she had been completely mistaken about Rome's power.","        It was Alexandria that had been the stronger nation, and she had traded it all away.","        For love.","","        But Caesar did his best to stand up for her, punching anyone who said","        she was not a good Roman wife.  And woe to anyone who spoke ill of his new heir,","        little Caesarion!","        *gosub octavius","","    #But Caesar would not betray his country, and Cleopatra would not abandon hers.","        Though their love was strong, their pride in their homelands was stronger.","        Cleopatra remained Queen of Alexandria, and Caesar returned home to Rome.","        Later, Cleopatra learned Caesar already had a wife, though he had never","        mentioned her.","","        Still, the man haunted her.  When her son was born, Cleopatra named him","        Caesarion.  She often found excuses to go to Rome, and she found","        Caesar as eager as she to continue the affair.  When privacy proved","        difficult, Caesar bought a house for their secret trysts.","","        All the while, Cleopatra knew intellectually that she was squandering the legacy","        of Alexandria.  Genius Cleopatra, speaker of nine languages,","        *if techne >= 6","            inventor,","        *if rhetoric >= 6","            master negotiator,","        *if medicine >= 6","            who used to walk the streets of Alexandria healing the wounded and sick,","        now reduced to being a Roman's secret affair!  She was ashamed, but","        powerless in the face of her compulsion.","","    *selectable_if (rhetoric >= 6) #She came from a long line of convincing speakers, and Caesar could not resist. (Requires Rhetoric: 6)","        *set already_king true","        Smitten, the great general agreed.  \"Rome would be nothing without me,\"","        he assured her.  \"If the Senate does not immediately see reason and accept","        our dominion, they will come to regret it.\"","","        The Senate did not in fact immediately accept Alexandrian rule, and Cleopatra","        and Caesar waged a brief war to take Rome.  Caesar's troops were used to civil","        war by this point, and they loyally fought the Senate.","        *if techne >= 6","            Cleopatra's army laid waste to the defenders of Rome with their new gunpowder weapons,","            a technology recently developed by Musaeum boffins.","            (${name} had long ago set up a fund specifically for the development of","            technology for Alexandria's defense, which had proven quite prescient over the years.)","        *else","            And Cleopatra aided the fight by blockading the city with her ships, then ending the siege","            with a battalion of elephants that trampled the Roman defenders.","        Rome fell, and the Roman Empire became the Alexandrian province of Italia.","","        As king and queen, Cleopatra and Caesar ruled a mighty empire.","        Caesarion was born to Cleopatra, and Caesar named the child his rightful heir.","        *gosub octavius","","        While many Romans tried to fit in with Alexandrian culture,","        reading scrolls and trying out Egyptian fashions, some","        never forgave Caesar for turning his might against Rome.","","*comment 47 BCE Caesarion born, 44 Caesar dictator assassination","*if (not(already_king))","    But when Caesarion was three, Caesar declared himself dictator of Rome,","    and that was too much for his enemies.  Luckily,","    when he entered the Roman Senate chambers on the Ides of March, Cleopatra was there with him.","*else","    Three years into Alexandrian rule of Rome, Cleopatra and Caesar took a trip to Rome to address the","    Senate there.  The Senate was to be abolished,","    in favor of a larger assembly that would meet in Alexandria instead.","    Cleopatra knew something was wrong when none of the senators rose in respect.","","What did Cleopatra do on the Ides of March?","*temp caesar_dead false","*choice","    *selectable_if (techne >= 8) #She shot the would-be assassins in the face. (Requires Techne: 8)","        When the first assassin began to reach for Caesar's arms, Cleopatra","        knew what she had to do.  She drew her Musaeum-crafted pistol and shot","        the man in the face.","        ","        As the echo resounded through the Senate chamber, Cleopatra dropped the now-useless","        weapon and drew a second pistol, even as Servilius Casca rushed at Caesar with","        a dagger.  She shot him in the face as well.","        ","        \"Would any other backwards Romans like to see what Alexandria has been working","        on for the past two hundred years?\" Cleopatra shouted at the Senate. ","        \"I am the heir to ${name}'s empire, and I will end you!\"","","        No other would-be assassins came forward that day, which was good, because","        Cleopatra had only brought two pistols, and neither could ever be used again.","        But they had done the job, and she and Caesar walked out of the Senate chamber","        unscathed.  When they were alone, she let herself cry, but Caesar never did.","    *selectable_if (rhetoric >= 6) #She talked the assassins out of their assassination. (Requires Rhetoric: 6)","        Noticing the tenor of the room, Cleopatra knew she had to speak quickly.","        \"Friends,\" she said.  \"Romans, lend me your ears.  You need not bury","        Caesar.  You need not praise him either.  But how Caesar goes today,","        so goes Rome.  You may think Caesar is evil,","        but what you see is only ambition!  Ambition for himself, and also for Rome.","        Now I speak as an outsider; perhaps you hate ambition here in Rome.  But in Alexandria,","        ambition is rewarded.  It is ambition that keeps the scholars of the Great Library","        pushing the limits of knowledge.  It is ambition that built our Great Lighthouse,","        which has guided ships for hundreds of years.  Who here will raise his","        dagger and stab ambition itself?  If ambition must die, it is Rome that will perish.\"","","        There was silence in the Senate chamber after that.  No applause, but Cleopatra","        expected none.  Still, no attack came on the Ides of March, and Caesar","        took the floor to address the Senate as planned.","    *selectable_if (medicine >= 6) #She protected Caesar, using an herb to fake his death. (Requires Medicine: 6)","        When the conspirators attacked Caesar, Cleopatra","        rushed into the fray.  Enduring cuts and stabs herself,","        she deflected the most deadly strikes that were meant for Caesar.","        ","        Meanwhile, the fool Caesar was still struggling, when he should have been playing dead.","        Luckily, Cleopatra kept an herb with her that would calm him down.","        Palming it, she put her hand over his mouth and dropped in the herb.","        Trusting Cleopatra, Caesar allowed this, while the attackers assumed Cleopatra had aided them","        with poison.","","        After a few seconds, Caesar slumped unconscious.","","        \"Enough!\" Cleopatra shouted.  \"He's dead already, leave him alone!  Why desecrate his body","        when the spirit has fled?\"","","        The assassins gave Caesar a few more good stabs, then allowed Cleopatra to drag his body","        into an alley.  With strips of cloth from her dress and water from a nearby well,","        Cleopatra proceeded to clean and bandage Caesar's wounds.  It was simple aid, but","        enough to save Caesar from the brink of death.","","        When Caesar was up on his feet again, rumor spread that he had actually come back from","        the dead, besting Pluto and commandeering Charon's boat.  Caesar did nothing to","        stop these rumors.","","    #She watched helplessly as Caesar was stabbed to death.","        *set caesar_dead true","        As the assassins rushed Caesar and stabbed him repeatedly,","        Cleopatra could only look on in horror.  The man she loved was","        dying, dying, dead.","","*if caesar_dead","    Cleopatra has taken lovers since then.  She was wooed by a charming Roman named Marc Antony,","    who was in charge of a great deal of","    *if already_king","        the province of Italia.","    *else","        the Roman Empire.  This wasn't very satisfying; it seemed Caesar was always a","        third presence in the relationship, as both lovers wished Marc Antony were he.  Still,","        Cleopatra and Marc Antony had remained casual lovers until just yesterday, when","        Cleopatra learned Marc Antony had committed suicide.","*else","    Caesar and Cleopatra went on to have almost twenty beautiful years together.","    They had love, power, knowledge: everything a couple could want.  Caesarion","    grew into a dashingly handsome young man, as smart and ambitious as both his parents.","","    But Cleopatra and Caesar met when she was twenty-one and he was fifty-two.  And that","    meant it had to end.","","    The end came a month ago, at an elaborate state funeral just outside of Rome.  Caesar died","    at seventy-one.  Cleopatra has just returned to Alexandria, and is now contemplating","    this wooden box with the asp in it.  It has been a month of loneliness and loss,","    the worst month of her life.","","When the good times are over, and only worse days are ahead, does it","make sense to end on a high note?  Cleopatra contemplates this.","She recalls that in ${name}'s old age, the librarian went blind.","","What did you do when you went blind?","*comment the first choice is truefax for Eratosthenes but hasn't been relevant until now.","*comment A downer, but the choice has to be there so that the player can decide not to pick it.","","*choice","    #I could no longer read, so I committed suicide.","        *comment A player who picks this may be in an interesting state of mind.","        *comment Because of this, let's thwart expectations.","        Cleopatra recalls that when ${name} could no longer read,","        *if male","            he","        *else","            she","        decided that life was not worth living anymore.","        *if married_sosibius","            Sosibius, for his part, only encouraged this behavior.  \"I agree, what is life without","            pleasure?\" he told ${name}.  \"I support your decision utterly.\"","        *else","            *if (married_p3 and ptolemy_3_dead)","                Still saddened by the death of Ptolemy III,","            *else","                As much as ${royal_spouse}","                tried to convince ${name} to eat,","            the librarian had decided that a life without","            reading was not worth living.","","        The shadow of ${name} casts gloom on Alexandria even now,","        two hundred years later.  Something about the city is still dead.","        The royal dynasty has always had the threat of despondency looming over it.","","        Cleopatra wonders whether she ever had the choice to be happy.","        They say melancholic humors are passed from parent to child.","        Certainly, many of Cleopatra's relatives have gone this way.","","        Cleopatra begins to open the lid of the box, then shuts it.","","        \"No,\" she says.  \"No, Caesar.","        *if caesar_dead","            No, Marc Antony.","        No, ${name}.  I won't let you do this to me.\"","","        She thinks for a moment, goes to a desk drawer, and retrieves a dagger.","","        \"You can kill yourself, ${name},\" Cleopatra says, tears in her eyes.","        \"But you can't kill me.  I may be yours, but I am also ${royal_spouse}'s,","        and I am also me.\"","","        She opens the box, grabs the asp by the throat, and slashes the snake","        violently, spattering her desk with blood.","","        Cleopatra will live.  And that is her decision, not yours.","            ","    #I could no longer read, so I shared my own knowledge instead.","        Even at the end, you would leave the palace to wander the halls of","        the Great Library with a cane, hoping someone would need your","        expertise on something.  Inevitably, scholars would track","        you down and pepper you with questions:","        *if rhetoric >= techne","            What do you think of this passage here?  Is it too flowery, too long?","        *else","            What do you think of this design?  Too many moving parts?  Too fragile?","","        Inevitably, you would remind them that you could no longer see;","        you took it as a compliment that you were more famed for your generous","        wisdom than your blindness.","","        Now Cleopatra realizes that she has been trapped in a solipsistic","        gloom, when she could follow your example and help others.","        Whether her own best times are past or not, she is not alone.","","        She sets down the box on her cluttered desk, with its notes and","        letters in several diagrams, and heads out into the palace hall.","","        \"Caesarion!\" she calls out.  \"I'm sorry I've locked myself away these","        past days.  I'm back.\"","","    *selectable_if (medicine >= 6) #I cured myself. (Requires Medicine: 6)","        [i]Medicine[/i], Cleopatra thinks, and that gives her an idea.","","        She sets the wooden box down on her desk, and retrieves a pouch from one","        of the desk drawers.  Dipping her fingers into the pouch, she","        removes some crumbly green herbs, which she puts into her mouth.","        She quickly puts the herbs back in her desk drawer.","","        Less than a minute later, she collapses to the floor.","","        Hours later, servants find her, find the asp.  They lament, because","        who did not love the queen?  They can't find an asp bite, but","        they assume it must be there somewhere.","","        They will have to inform Caesarion, and keep her death a secret until","        he wills it otherwise.  If the people knew Cleopatra had died, there could be riots.","        The servants roll the queen up in her bed coverings to hide her body.","        *page_break","        Camouflaged by her bed coverings, Cleopatra sneaks out of the","        palace.  She hopes the servants' testimony will be enough to confirm","        her death.  There may be a search for her body, but she will be gone by then.","        Caesarion should not have any trouble claiming the throne.  He","        takes after his parents, after all.","","        Cleopatra has decided that what she needed was not death, but the end of her life as she knows it.","        There is a difference.","","        She ticks off the languages she knows:  Greek, Egyptian, Ethiopian, Troglodytae,","        Syrian, Hebrew, Medean, Arabic, Ethiopian.  So many places she could go.","        And yet, why couldn't she learn Chinese, or Hindi?  She can go anywhere,","        do anything.  Why not?  The descendants of ${name} have always been clever.","","*finish The End","","*label octavius","When Caesar's great-nephew Octavius tried to have the child assassinated,","Caesar in turn sent assassins after Octavius, and the would-be heir found","a different kind of inheritance in the Roman landfill he came to rest in.","*return","","","*label evil_ending","*set year 206","*comment protagonist (?) is 56","*achieve evil","[b]220 B.C.E.[/b]","","Alexander the Great rests in a crystal coffin in a large mausoleum in the center of the city.","Using similar techniques to mummification, Egyptian priests have kept","the Greek conqueror's body from decaying.  When you visit him, he appears","a bit old and dry, but in fairly good condition for a long-dead man.","","You press your fingers to the crystal.  \"I've done it, my withered friend,\" you say.","\"I've conquered Alexandria.\"","","You look around out of habit, but of course, you ordered that the tomb be closed to the public.","Ever since you got in the habit of chatting with Alexander, you thought it best to","ensure nobody could walk in on you.","","\"I had Ptolemy IV and his wife murdered yesterday,\" you say.","*if ptolemy_4_rel < 50","    \"It was difficult to lure the boy into my trap.  He doesn't trust me for some reason!\"","*else","    \"The poor fool trusted me so.  It was almost too easy to poison him,","    and","    *if agathoclea_lover","        Agathoclea","    *else","        *comment People who play this game a lot will correctly realize P4 historically","        *comment married his sister.  (It's actually inaccurate to claim he marries","        *comment Agathoclea, but she's a more major character and this is alternate history.)","        *comment But you've got to get some pretty obscure endings for that realization.","        Arsinoe","    as well.\"","You chuckle.","*if ptolemy_4_rel < 50","    \"And through some strange mishap, nobody can seem to find the papers where he named","    who would be regent while Ptolemy V comes of age.  Should it not be the wisest","    person at the court, the one who is most knowledgeable in all things?","    That is what people said.  It's nice when people see reason.\"","*else","    \"Luckily, he had the foresight to name his regent before he went.  Can you","    guess who will be taking care of the kingdom while Ptolemy V grows up?\"","You tap the glass thoughtfully.  \"Of course, if Ptolemy V ever does grow up,","I shall need to hand over the reins of power.  But if he doesn't…well, who knows","what fate has in store for Alexandria?\"","","You laugh.  You like the way it echoes in Alexander's tomb,","so you laugh louder.  Harder.  It feels good.","","\"You may have been a great conquerer, Alexander, but in the end, I am the last","*if male","    man","*else","    woman","standing.  And do you know what I am going to do next?\"","","Why did you connive your way into ruling Alexandria?","*choice","    #I plan to spend the treasury like there's no tomorrow.","        \"There is so much money to spend, and I have so few years to spend it,\"","        you say.  \"But I will enjoy it all, buy every delight the empire","        has to offer.  We have only one life to live, Alexander, and we have to","        make the most of it.","","        \"As the for the empire…well, the empire may not live forever, Alexander, but who does?","        As you well know, the distant future is only an illusion.\"","    #I just wanted to see whether I could do it.","        \"Anything I want,\" you say.  \"That's the answer.  Alexandria is my plaything","        and my grand experiment.  I have so much to learn about human nature, and in","        my experience, the most interesting results are achieved when the subjects","        are under tremendous amounts of stress.\"  You giggle.  \"It shall be a city","        devoted to science, albeit my peculiar new brand of it.","","        \"People may find my methods peculiar or abhorrent, but what of it?","        Sacrifices must always be made.","        After all, Prometheus had to have his liver torn out to deliver fire to humanity.\"","        You grin.  \"What I'm sure of is that if anyone's liver must be torn out, it isn't","        going to be mine.\"","    #I will show the world an empire like has never been seen before.","        \"I have twenty years or more left in me,\" you say.  \"And you, Alexander, have taught me that","        this is plenty of time in which to conquer the world.  I have learned from","        your mistakes.  I know more than you did.  I am more ruthless than you were.","        *if invented_geography","            And when I have conquered the known world, I will not weep that there is no more","            to conquer, as you did.","","            \"Unlike you, I know exactly how big the world is, Alexander.  And I will","            not rest until all of it is mine.\"","        *else","            *comment Aw man, but the other line is so perfect!  Anyway, this should be uncommon","            If I cannot achieve immortality with my ideas, I shall achieve it through force.\"","","*finish The End","","","*label hypatia_at_serapeum","[b]391 C.E.[/b]","*set year 391","","Over six hundred years after the death of ${name}, Hypatia and her","father Theon approach the Serapeum, their torches flickering in the night.","The temple to Serapis now stands vacant,","a tomb for the last remaining scrolls of the Great Library.  It has","not been more than a week since the temple was closed by the edict of","Emperor Theodosius, and already some vandal has painted lewd images on","the marble columns and great bronze doors.","","A riot in the Egyptian quarter has drawn away the guards this night,","and Theon and Hypatia have decided to rescue what scrolls they can.","Entering the temple may be illegal now, but it is only a matter","of time before squatters and looters get to the place, if they haven't","already.","","They stop at the bronze double doors.","","\"So the Great Library is reduced to this,\" says Theon softly,","running his hand over the ancient metalwork.  He is","approaching sixty, but when he said he wanted to come along on","Hypatia's covert adventure, she agreed to it.","They are a team, though usually that teamwork is aimed","at mathematical problems instead of sneaking about temples.","","\"Why are you so sad, Father?\" Hypatia says.  She is twenty-one,","and has never known the Serapeum to have anything but a random hodgepodge","of useless old tracts, all fiercely guarded by the priests of Serapis.","\"The Serapeum","*if serapeum_type=\"elitist\"","    hasn't allowed the public to access its works in centuries.","*elseif serapeum_type=\"bookstore\"","    probably sold its best works long ago.","*else","    has always been a terrible library.","And that god they","worshipped, Serapis!  Everyone knows that god was made up by the Ptolemies.","The Serapeum was as much an affront to reason as this new god that Theodosius","tries to push on us.\"","","\"Don't say such things!\" Theon suddenly snaps.  He grabs her by the","shoulders.  \"I say to you again: you are in danger if you say such things.","Many of the Romans who worship this new god don't know the difference between","Plato and Baal.  A cruel man asked me how my 'witch' daughter was doing, just","yesterday.  Do you understand?  You mustn't antagonize them.\" ","","\"Fine!\" Hypatia says.  \"Keep your voice down.\"  She shrugs free of her","father, affronted that he would continue to treat her as a child.","","*page_break","","*if invented_auto_doors","    Hypatia lowers her torch to the brazier next to the doors.","    Slowly, the heated mercury in the hidden tube expands and pushes open the","    bronze doors.","","    \"Remarkable that the old invention still works,\" Hypatia says.","","    \"Oh, the priests kept it in good condition,\" Theon says.","    *if serapeum_type=\"idealist\"","        \"Those talks they gave about the workings of the doors are a tradition","        that goes back to Ptolemy IV.  That was his idea, inspired by his","        old tutor.  Ptolemy IV believed that the Serapeum should be a place of","        learning instead of mysticism.\"","    *else","        \"They probably didn't understand why it worked, but they knew enough","        to replenish the mercury and keep the joints oiled.  I'm sure they","        had some mystical explanation for it.\"","*elseif serapeum_type=\"elitist\"","    Hypatia sees a rope dangling out of a hole in the door, which the","    priests would have pulled on to lock the door behind them.  Pushing","    on the doors, she confirms they are locked.  But Hypatia prepared","    for this; she pulls from her belt a curved rod and pokes it","    through the rope hole, fishing for the bolt.","","    \"Dare I ask how my daughter learned how to pick locks?\" Theon says.","","    \"You told me to be open to all kinds of knowledge,\" Hypatia says,","    trying to catch the bolt with the rod.  \"Besides, this lock is quite old.","    I couldn't rob a Roman house with this.\"  Finally she feels the bolt,","    guides it out of its catch, and pushes open the doors.","*else","    Hypatia pushes tentatively on one of the doors, and marvelously,","    it simply creaks open.","","    \"No locks or bars,\" Hypatia says, surprised.","","    \"The Serapeum was always open to all,\" Theon says mournfully.","","Their torchlight falls on the statue of Serapis in the center of the","temple.","*temp pristine false","*if invented_auto_doors or (serapeum_type = \"elitist\")","    *set pristine true","    The old god remains pristine, cared for until a week ago when the","    priests were hurried out the door.","","    The shelves at the sides of the temple are piled high with scrolls,","    no doubt in a nonsensical order that made numerological sense to","    the priests.","","    *if invented_auto_doors","        \"It looks as though the 'spirits' guarding the door were enough","        to keep away looters for the moment,\" Hypatia says.","","        \"Hah!\" Theon says. \"${name}, you strange servant of reason and unreason,","        you've protected the Great Library one final time.\"","    *elseif serapeum_type = \"elitist\"","        \"It looks like the locked door was just enough of a deterrent","        to keep any thieves out,\" Hypatia says.","","        \"Huh!\" Theon says.  \"Perhaps old Ptolemy and the priests of the","        Serapeum were right in the end to keep the rabble out.\"","*else","    Someone has painted 'DIE PAGANS' in Latin red letters across the","    great statue's chest.  The hostile message is genuinely terrifying","    to Hypatia, and she begins to see the reason in her father's warnings.","","    Many of the scrolls are burned, and there are far fewer scrolls","    than there were the last time Hypatia visited.","","    \"Looks as though some other looters got here first,\" Hypatia says.","    \"Too bad Serapis couldn't leap off his pedestal and scare them away","    at the door.\"  She tries for levity, but misses.  The statue's","    message is unnerving.","","*page_break","","They split up, and Hypatia goes to the bookshelves to rifle","through piles of obscure scholarly tracts from the Great Library: all","the books that were too boring or indecipherable for people to steal","over the years.  Some liked to say that Caesar accidentally burned down","the Great Library, back in the days of Cleopatra, but that was an exaggeration,","and the truth was far more banal.  The Great Library's funding had been","in decline ever since roughly the reign of Ptolemy III, the last","ruler of the Alexandrian empire to place an emphasis on hiring good scholars.","By the time Caesar accidentally burned down the Great Library's storehouse,","the library was already a shadow of what it once was.  Once ","Queen Cleopatra had committed suicide and the Alexandrian Empire had become the Roman province of","Egypt, Rome had little incentive to make the Great Library great again.","After a few more centuries of graft and mismanagement, the","Great Library's building was bought and turned into a mansion, and the ","remaining scrolls were stuffed into the Serapeum.","","*if serapeum_type = \"elitist\"","    Over the centuries, the cult of Serapis grew more and more secretive,","    rarely letting anyone not of the faithful into their temple, and few","    people had any idea what treasures remained in the Serapeum.","*elseif serapeum_type = \"bookstore\"","    The combined temple and bookstore sold off the library's holdings over the","    years, and as times became difficult and the priests of Serapis lost","    any ability to appraise the works, the best scrolls left Alexandria.","*else","    The Serapeum was a lending library, meaning it lost works over time,","    and it was a temple to an unpopular god, meaning it did not have the funds","    to purchase new works.","    *if serapeum_type = \"idealist\"","        But the priests remained devoted to their ideal of teaching the public","        until the very end, even as they lost almost all their scrolls.","    *else","        So the priests decided eventually that only those","        most devoted to Serapis would be allowed to borrow the scrolls.  Anyone unwilling","        to prostrate themselves before a false god had little idea what treasures","        the library held.","","Finally Theodosius, a Roman emperor devoted to Constantine's peculiar","monotheism, decreed that all the pagan temples should be closed, and all pagan","practices banned.  No Serapeum, temple to Serapis.  No Musaeum, temple to","the Muses.  Before the scholars of Alexandria could secularize their","institutions, they were swiftly booted out the door by Roman soldiers.","","Hypatia's musing about the Serapeum's history is cut short when she","stumbles across some papers with diagrams she recognizes.  These","are works of ${name}, a famously clever librarian under Ptolemy III. ","","\"Father, I think I've found something.\"","","*page_break","","Hypatia goes to an altar and spreads out the sheaf of scrolls she has found.","","*if invented_geography","    One is a tract on calculating the correct diameter of the Earth.","    Hypatia marvels at the cleverness of the experiment, which apparently","    involved traveling down the Nile to do some measurements and trigonometry.","","*if invented_optics","    One is a tract on a marvelous device that could focus the Sun's","    rays using an adjustable parabola of mirrors.  A parabola: one of","    the conics, like the ellipse or the hyperbola.  It is beautiful in","    its own way, and this tugs at Hypatia's intuition.  Why are there","    not more conics in nature?  What if there were?","","*if invented_copier","    One of the scrolls is not a work of ${name} at all, but appears to","    be a copy of a work of Aristarchus, in which the old philosopher","    proposed that the Earth goes around the Sun instead of the other way","    around.  The copy has the odd aberrations of a work copied with","    ${name}'s automatic copying device; the original was probably lost.","    Hypatia knows of the heliocentric theory, but the measurements she has so far do not show that","    concentric circles around the Sun describe the orbits of the planets","    any better than the geocentric model.","    *if (invented_optics and invented_auto_doors)","        Unless…","","*if (not(pristine))","    The works have unfortunately been severely burned by the vandals that","    reached the Serapeum first, and Hypatia's mind turns again to","    the graffiti on the statue of Serapis.  As much as she would love","    to think the lofty thoughts of a scholar, it is hard to concentrate","    when she has the very real sense that the city is going to try to kill her.","*elseif ((invented_copier and invented_optics) and invented_geography)","    The world falls away as Hypatia performs calculations.  She knows by heart","    many of the measurements of the planets that she has been trying to","    explain for years.  Through the lens of the documents before her—round","    the Earth, conics, the Sun at the center—she finally puts the pieces together.","","    \"Father, I've got it!\" she cries.  \"I know the shape of the planets'","    orbits!\"","","    Her mind is racing, the numbers and calculations falling into place","    even as, in her mind, the mysterious wanderers become bound to the","    shapes that rule their motion.  Conics:  ellipses.","","    She knows a secret known to nobody else in the world, and it is beautiful.","    *page_break","","    \"The planets travel in ellipses,\" Hypatia explains to her father.  \"Not","    circles.  And the heliocentric idea is right.  Only, the Sun is not","    at the center of the universe.  It's at a focus.\"","","    \"It's a remarkable idea, my dear,\" Theon says, \"but surely you need","    to check the measurements to verify it, don't you?\"","","    \"I will, of course,\" Hypatia says, \"but what then?  If I write a tract","    about it, where would I even put it, now that the Great Library is","    utterly gone?\"","","    Theon hesitates.  \"I know there is a library in Constantinople,\" he says ","    slowly.  \"I think they will take even 'pagan' works such as ours.","    You might bring the edition of the [i]Elements[/i] that you","    and I edited.\"","","    \"I can't leave you, Father,\" Hypatia says, taking his hand.  \"We","    are a team.\"","","    \"Hypatia, if you are right, your idea is bigger than either of us,\"","    Theon says.  \"Theodosius may think it heretical—I know not what","    he would think, honestly—but as long as your idea lives in a library,","    then someone will discover it again, just as you discovered the ideas","    of ${name}, and both of your works will continue the unbroken chain.\"","    Theon grins.  \"If your idea is right.  Which I'm not quite willing","    to concede.  I trust you will","    let me be your critic, as you have always been mine?\"","","    \"Of course, Father,\" Hypatia says.  An idea occurs to her.  \"Why not","    come with me to Constantinople?  Perhaps we could make Theodosius","    more aware of the problems of Alexandria.\"","","    Theon smiles.  \"My dear, I could not be happier to leave this place.","    Alexandria's time in the sun may be done, but I think ours is just","    beginning.\"","","    *finish The End","*else","    ${name}'s writings nudge Hypatia's intuition ","    in some hard-to-describe way: something to do","    with the measurements of the planets that she has been trying to explain.","    But some piece of the puzzle is still missing, and she has no great","    insight.","","Finally, she turns her attention to a different document, which she is","still reading with interest when Theon comes over.","","\"What have you found?\" Theon asks.","","\"It's a collection of documents from ${name} of Alexandria,\"","Hypatia says.  She shows him what she has been reading.  \"Look at this.","It's the old librarian's final account of","*if male","    his","*else","    her","life.\"","","\"How interesting,\" Theon says.  \"${name} lived just around the time","the Great Library and Alexandria went into decline.  How does it end?","Are there any closing thoughts?\"","","What is the final line of your memoir, summarizing the lessons you learned?","*choice","    #\"I gave up much to achieve what I did, but I regret nothing.\"","        Hypatia smiles.  \"I like this ${name}.  Despite everything,","        *if male","            he","        *else","            she","        regretted nothing.\"","","        Theon scoffs.  \"How can one regret [i]nothing[/i]?  Surely","        that is the result of either a faulty memory or a lack","        of conscience.\"","","        \"I think it may be neither, Father.\"  Hypatia sets down the scroll.","        \"What if we were to live boldly, Father?  What if we were to tell","        the bishop and the governor what we thought, and damn the","        consequences?\"","","        \"Don't joke,\" Theon says darkly.  \"I don't like to worry about you.\"","","        \"Then don't,\" Hypatia says crisply.  \"I am a grown woman now,","        and you need not protect me.  I will be like ${name}:","        doing as I choose, regretting nothing.\"","","        \"Come now, Hypatia,\" Theon pleads.  \"You've always been a good girl…\"","","        \"And I will be a good woman,\" Hypatia says.  \"Oh, I will be the","        best woman.  What will they do when they find I cannot be","        intimidated, cannot be bribed?  What will they do when I","        am steadfastly reasonable in the face of their appeals to fear","        and hate?  What will they do when I do not let Alexandria forget","        how it has squandered its greatness?  What will they—Father, are you","        all right?\"","","        Theon wipes the tears from his eyes.  \"Oh, my sweet girl,\" Theon says.","        \"I am so proud of you, and so ashamed to be proud.  Because in raising","        you to be so proud, I have doomed you,","        *if petty >= 50","            as surely as ${name} and Sosibius doomed Ptolemy.","            Oh, what a despicable thing it is to shape a child's fate!\"","        *else","            even as I tried to be as good a teacher as ${name}.","            Oh, what wretched irony, that good works should be so rewarded!\"","        ","    #\"A city is only as great as its people.\"","        \"A city is only as great as its people…\" Hypatia muses.","        \"Father, what keeps us here in Alexandria, anyway?","        Now that the Musaeum is gone, why not go to the capital?\"","","        \"Constantinople?\" Theon says.  He scratches his brow.  \"They","        do have a library there, I believe.  I don't know any good","        scholars there…I mostly only know the community here.\"","","        \"You are the greatest scholar in Alexandria,\" Hypatia says.","        \"If you moved to Constantinople, surely your fellows","        would follow.\"","","        \"Oh, stop.\"  Theon waves this praise away, but he is pleased.  ","        Then he frowns.  \"Surely it will be dangerous for us to be","        near the heart of Theodosius's theocracy.  Alexandria is more used to","        competing sects.\"","","        \"It will be dangerous,\" Hypatia affirms.  \"But I think we must","        do as ${name} did and go to the city that has the most promise.","        If a city is as only as great as its people, then your presence","        will make Constantinople great.\"","","        Theon laughs and takes Hypatia's hand.  \"My dear, you're right.","        I don't know whether we will die from mob violence in Constantinople or","        convince Theodosius to love pagans.  For now, you've given me","        hope.\"  He squeezes Hypatia's hand.  \"You are, as ever, the","        light of my life.\"","    #\"Teaching, in the end, was my greatest responsibility.\"","        \"Teaching…\"  Hypatia ponders this.  \"Perhaps that's our problem,","        Father.  The people are simply uneducated.  We need to stop","        living in our bubble of scholars and students, and take to the","        streets.  Proclaim the truth to anyone who will listen,","        like the zealots who follow the emperor's god.  Our truth will","        shine brighter.\"","","        \"My dear, you will do no such thing!\" Theon says, exasperated.","        \"Do you really think shouting Aristotle at random Roman citizens","        is going to help matters here in Alexandria?  You will get","        yourself killed!\"","","        Theon's words strike Hypatia as entirely true: she will get herself","        killed.  It isn't something","        she has thought much about until now, but her father is right.","        Not because her father has any kind of power of prophecy, but because","        Hypatia is who she is:  outspoken, judgmental, unyielding.","        She is a straight, unbendable line, ","        and she can predict the eventual results of her intersection with","        the pagan-hating zealots of the city.  She sees this with certainty","        in a way perhaps even her father does not.  The initial chill","        of the thought gives way to resigned certainty.","","        \"But could we start a school?\" Theon offers after she has been silent","        for a time.","","        \"We could,\" Hypatia says, not sharing her feelings with her father.","        \"Perhaps that would be enough.\"","","        She knows it will not be enough to save Alexandria from what it","        has become.  That trajectory was set in motion long ago,","        perhaps in the time of ${name}.  But she must do what she can.","","        She will be as the lighthouse: a beacon in the darkness.","","*finish The End",""], "labels":{"steam_engine_ending":553,"germ_theory_ending":744,"wrote_epic_ending":867,"cleopatra_ending":955,"octavius":1309,"evil_ending":1316,"hypatia_at_serapeum":1411}}