{"crc":-1939660259, "lines":["*image chap5.png center Chapter Five: The Colossus Falls","","*temp madeSosibiusAccusation false","","[b]226 B.C.E.[/b]","*set year 226","","*if petty < 50","    *achieve mentor","","*if tutoring_ptolemy","    As you had agreed when you first arrived in Alexandria, you serve as young","    Ptolemy IV's tutor until he is nineteen years old.  The time passes quickly, between your","    duties at the library and your duty to the young prince.  When you are finally","    relieved of your tutoring duty, you are not quite sure what to do with all the time.","    But soon enough, the royal family has need of you again, as they find that Ptolemy","    often still needs someone at court who can explain what his parents are doing.","*else","    Soon, young Ptolemy graduates from the Musaeum, and he returns to court, there to","    observe his parents in their day-to-day decision-making until he can finally inherit the","    throne.  You are tapped by the royal family again to act as a kind of adviser and","    interpreter for the prince.","","*if petty <= 45","    Ptolemy IV is a willing student, and he quietly pays as close","    attention as possible.  He sits at court on a plain chair, still more","    plain than that of Sosibius.","*elseif petty < 55","    Ptolemy IV seems to vacillate between your advice, which tends toward","    the Stoic philosophy with which you were raised, and that of Sosibius, which","    seems calculated to turn Ptolemy into an effete ne'er-do-well.  When he sits at court,","    he brings little bowls of figs and dates, and munches on them as his parents hear","    cases.  He has a private slave fanning him, even when his parents do not.","    Despite these little weaknesses, he remains a respectful student.","*else","","    Unlike his father, nineteen-year-old Ptolemy IV insists on having","    slaves cater to him while the king is holding court.  He drinks wine, ","    is fanned by palm fronds, and always has a selection of dates and grapes","    available in little bowls nearby.  As a result, Ptolemy IV is growing fat.","","    But Berenice and Ptolemy III both indulge the boy—they deny him nothing.","","Sosibius, meanwhile, continues to find excuses to hover around the","*if primary_caretaker = \"you\"","    boy.","*else","    boy, despite the fact that young Ptolemy no longer needs a caretaker.","*if agathoclea_lover","    Sosibius often inquires about Agathoclea, who became Ptolemy's lover years ago","    and remains so now.  There has been increasing tension between Ptolemy IV","    and his parents because he wishes Agathoclea to be queen one day, and","    neither parent wants to entertain that notion.  Meanwhile, Agathoclea's","    brother Agathocles has come to court as well, representing the Egyptian","    priesthood at court despite his being Greek himself.  The two men try","    their best to exclude you from their conversations with the prince,","    *if petty > 50","        and they largely succeed.","    *else","        but he still seems to listen to you more than them.","    *set egypt_unrest %+10","","One day, a messenger comes from Rhodes.  \"Sire, the Colossus of Rhodes has","fallen in an earthquake,\" the messenger says.","","*if ptolemy_4_rel > 50","    \"What's a colossus?\" Ptolemy IV asks you.","","    \"A large wonder of a statue that stood over their port,\" you say.  ","    \"It was so tall, a ship's mast only came to its knees.\"","*else","    You can tell that Ptolemy IV does not know what the messenger is talking about, but he is too proud to","    admit it.  \"The Colossus was a large statue that stood over their port,\"","    you whisper to him.  He waves this away, as if he is uninterested.","","\"We can help them rebuild,\" says Ptolemy III.  \"We have the gold.\"","","\"They say it is an act of the gods, punishing their hubris,\" the messenger","says.","","*if agathoclea_lover","    You catch Sosibius and Agathocles exchanging a smirk at this notion.  Hubris: what a","    quaint idea!","*else","    \"This is my sign….\" Sosibius mutters to himself, though you catch it because you are next","    to him.  You wonder what sort of message from the gods he has read into the fall of the Colossus.","    You think he must be a narcissistic man indeed to think that the gods would send such a grand","    personal missive.","","\"They have not requested aid,\" the messenger concludes.","","Ptolemy III looks to you.  \"What do you think we ought to do, ${name}?\"","","*choice","    #\"We should build our own colossus, as a testament to the strength of Alexandria.\"","        *set elitist %+10","        \"A fine idea,\" Ptolemy III says.  \"What do you think it should look","        like?\"","        *choice","            #\"It should look like you, Your Highness.\"","                *set colossus \"Ptolemy III\"","                *set ptolemy_3_rel %+10","            #\"It should look like your son, to prepare the way for his rule.\"","                *set colossus \"Ptolemy IV\"","                *set ptolemy_4_rel %+10","                *set petty %+10","            #\"It should look like Berenice, our awe-inspiring queen.\"","                *set berenice_rel %+ 10","                *set colossus \"Berenice\"","            #\"It should look like Serapis, to inspire faith in the god of the Serapeum.\"","                *set colossus \"Serapis\"","                *set egypt_unrest %- 10","            #\"It should look like Alexander, honoring the founder of the city.\"","                *set colossus \"Alexander\"","                *set egypt_unrest %+ 5","                *comment Staves off guard rebellion a bit?","                *set petty %- 5","            #\"It should look like Poseidon, so that the god of earthquakes doesn't destroy our Colossus.\"","                *set colossus \"Poseidon\"","                ","        \"Very well, it shall look like ","        *if colossus = \"Ptolemy III\"","            myself!\"","        *elseif colossus = \"Ptolemy IV\"","            my son!\"","        *else","            ${colossus}!\" ","        Ptolemy III says.  \"An excellent idea, ${name}.\"","","        *if colossus = \"Ptolemy IV\"","            You seem to have won some appreciation from the","            young man himself, who claps his hands and says, \"Oh, excellent!","            What an excellent idea, ${nickname}!\"","","        The work begins on the construction of a new colossal statue in the image","        of ${colossus}.  The work is expensive, but you think Alexandria should","        be a city of wonders, and Ptolemy III agrees.","        *set idealist %+10","        *set elitist %+10","        *set alexandria_strength -2","        *set colossus_built true","    #\"We should go buy the pieces, bring them back, and reassemble them.\"","        *set idealist %-10","        \"A fine idea, ${name}!\" says Ptolemy III.  \"Let the world see","        that though Rhodes may fall, Alexandria rises!\"","","        In the months to come, ships return from Rhodes with the pieces of","        the giant statue, and they begin reassembling the Colossus.","        *set alexandria_strength -1","        *set colossus_built true","    #\"The money would be better spent on the city's defense.\"","        *set idealist %-10","        *set colossus \"none\"","        \"A wise ruler spends his money on knowledge and strength,\" you say.","        \"You have always been practical, Ptolemy.\"","        *set idealist %-10","","        \"Indeed,\" says Ptolemy III.  \"You're right, we have no need of the ","        Colossus—we have the lighthouse already, and it is more useful.\"","        To the messenger, he adds, \"Send our regrets to the Rhodians.\"","","        *if petty > 45","            \"But I want a colossus!\" Ptolemy IV says.","","            \"It doesn't matter what you want,\" Ptolemy III says.  \"Or what","            I want, either.  What matters is ruling wisely.\"","","            \"But…\"","            ","            Ptolemy III narrows his eyes.  \"I'm not buying you a monument,","            child, and if you think you deserve otherwise, you have been","            spoiled.\"  He casts a suspicious glance at Sosibius,","            who blithely shrugs.","","            \"Yes, Father.\"","            *set petty %-5","*page_break","*if colossus_built","    Months later, you watch from the steps of the library as the Colossus of Alexandria is constructed over the ","    harbor.","    The skeleton of iron bars is only","    complete up to the torso, and the brass plates have only been attached","    up to the statue's knees.","","    *if (not(euclid_dead))","        \"Why did you endorse such folly?\" Euclid asks you.  The old woman","        hobbles over to where you are sitting on the steps.  \"I thought you wiser","        than this.\"","","        \"Why shouldn't we create such a wonder?\" you ask her.","","        \"The wise person does not care for ornamentation,\" Euclid says.","        \"Good deeds speak for themselves.\"  Euclid waves her cane at the","        great statue.  \"This thing is all about trying to impress.  Who?  What for?","        Our deeds as a city will decide what the world thinks of us.\"","","        *choice","            #\"I suppose you're right that it's folly, but it's too late now.\"","                *set idealist %+10","                \"Everyone makes mistakes,\" Euclid says, putting her hand","                on your shoulder.  \"At least this one is subtle.\"","            #\"It will bring delight to the common people.  That's reason enough.\"","                *set elitist %-10","                \"Ah, doing it for the common people,\" Euclid says.  \"I suppose","                trying to make them happy is a worthy goal, if a little foolish","                given how little control you have over their happiness.\"","","                \"Your Stoic philosophy makes you hard to please,\" you say.","","                \"I know,\" Euclid says.","            #\"It is a great deed to create it.  That's reason enough.\"","                *set elitist %+10","                \"I suppose I had no better reason for writing the","                [i]Elements[/i],\" Euclid says.  \"The creation of great things is","                not folly itself, so long","                as one's mind is on the act and not its reception.\"","","                \"I think I admire the Colossus for its own greatness,","                and care not how it will be received.\"","","                \"Well, that's fine, then,\" Euclid says.","","    *page_break","*if colossus_built","    Several months into the construction of the Colossus, you","*else","    You are soon glad you saved the empire's money.  You","are again in the throne room when an Egyptian priest comes before Berenice;","Ptolemy has given the queen dominion over Egyptian affairs.","The old man bows his shaven head low in greeting.","","\"Wise Berenice, I am concerned about my followers,\" the priest says.","\"They are starving.  The price of bread in this city has risen tremendously","this season.  A laborer's wages can no longer fill his belly.\"","","\"What, are all the laborers in the city starving?\" Berenice says.","","The priest hesitates.  \"Forgive me, Your Highness.  An Egyptian laborer's wages","can no longer fill his belly.\"","","\"Ah.\"  Berenice frowns.  \"That is quite a lot of starving laborers regardless.\"","","\"If it were possible to loosen the treasury purse strings…\"","","*if colossus_built","    \"Our discretionary funds are tied up in the Colossus,\" Berenice says, shrugging.","    \"All else is spoken for.\"","*else","    Berenice sighs.  \"We just promised the discretionary funds to mercenaries","    instead, to clean up the Egyptian quarter.\"  She brightens a little.  \"Lucky, that.","    We shouldn't have any trouble from these laborers.\"","","*if (not(nefertari_dead))","    The priest hesitates.  \"I was not sure whether to bring this up, but there is","    the matter of Nefertari.\"","","    \"What about her?\" Berenice asks, sitting forward on her throne.","","    \"She is garnishing the wages of many laborers in exchange for tasks","    and stolen goods,\" the priest says.  \"She'll pay for a stolen sword,","    or gossip about the palace guard, or even stolen food she sells back","    to the very people bringing her things.\"","","    \"So they're not starving,\" Berenice says, scowling.  \"They're stealing","    and","    *if nefertari_deal","        spying.  And for Nefertari!  I trusted her!  Let it be known","        that our deal with her is henceforth dissolved.\"","        *comment we'll keep it true in case it's useful as historical fact","","        \"That is fine, but my people do not mean to betray,\" says the priest.","    *else","        spying.\"","","        \"They do what they must,\" the priest says. He opens his arms in supplication.","    \"Please.  A hungry man is desperate.  Do not make my people desperate.\"","","*else","    \"Please,\" the priest says.  \"Say what you will about the late Nefertari,","    but she was always generous to the lowliest of her crew.  Surely you can be","    as giving as a pirate queen.\"","","Berenice looks to you.  \"Any advice, O sage?\"","","*if serve_nefertari","    You wonder what Nefertari would want you to advise.","*choice","    *if (colossus_built) #We must cancel construction of the Colossus to buy bread for the people.","        \"The people can't eat statues,\" you say with a shrug.  \"Let us call off","        the construction of the Colossus, sell the materials, and buy bread instead.\"","        *set colossus_built false","","        Berenice shrugs.  \"Perhaps you're right,\" she says.","","        \"Thank you very much,\" the priest says, bowing low.","","        The Colossus construction project is abandoned, with only two complete legs to show for","        it.  But instead of tearing these legs down, Berenice has a plaque commissioned","        for the base:","","        ABANDONED TO FEED THE PEOPLE","        IN THE REIGN OF THE WISE AND PRACTICAL PTOLEMY III","","        Which her husband finds delightful. Both king and","        queen are pleased with you.","        *set berenice_rel %+ 10","        *set ptolemy_3_rel %+ 10","        *set egypt_unrest %- 15","","    *if ((not(nefertari_dead)) and (not(serve_nefertari))) #It sounds as though the Egyptian quarter needs a thorough shaking down.  Let's send in guards to catch all these thieves.","        \"The poor will always be hungry, but the thievery and spying alarms me,\" you say.","        \"Let us clean that up.\"","","        Berenice nods.  \"Agreed.  Sorry, Your Holiness, but we would have more sympathy","        if your flock were not traitors.\"","","        \"Not all of them are traitors,\" the old priest begins, but Berenice gives him","        a look that says he is excused.  \"I see, Your Highness.  Thank you.\"","","        A large military contingent enters the Egyptian quarter to rough up shifty citizens,","        extract confessions, and make arrests.  A huge number of people are thrown in jail.","        Then, just as a patrol is making","        a final sweep, a mob attacks and kills the patrol, starting a full-blown riot.","","        *if alexandria_strength >= 4","            The rest of Alexandria's infantry is called in, and the riot is put down at the expense","            of many Egyptian lives, as well as those of a few guards.","            The whole experience leaves the Egyptian quarter angry, but it could have been","            much worse if the military were not as strong as it is.","            *set egypt_unrest %+ 5","        *else","            The rest of Alexandria's infantry is called in, but it is a smaller force than","            what is really necessary for the job, and they are unprepared for all the surprise attacks","            the Egyptians launch from various hiding places.  Patrol after","            patrol is killed, until finally, the military tacitly retreats.","            The affair is an utter fiasco, as the Egyptians are no doubt only emboldened","            by their success.","            *set egypt_unrest %+ 20","            *set alexandria_strength -1","","            On the bright side, you suppose the Egyptians who looted the dead guards won't starve.","    #We aren't at war, yet we still retain a large military.  Let us release some funds for food instead.","        \"We haven't been at war with anyone since the Seleucids,\" you say to Berenice.  \"Surely","        we have no need for such a large military.  Let us feed the people instead.\"","","        \"As the army's commander, my husband should approve the plan,\" Berenice says.  \"But I","        will make your case to him.  I've said the same thing for a long time.\"","","        Indeed, Ptolemy III relents, and he gives a few soldiers estates to the south in","        exchange for early retirement.  The funds that would have paid the soldiers' wages","        go to buying bread for the city's poor.  Poor Greeks and Egyptians alike praise","        the wisdom and generosity of Berenice II and Ptolemy III.","        *set egypt_unrest %- 15","        *set alexandria_strength -1","","        *if serve_nefertari","            Secretly, of course, you suspect Nefertari's rise is at hand,","            and a weak military will make the city more ripe for her takeover.","        *else","            You just hope you were right about not needing those soldiers.","","    #The Great Library can sell books to raise funds for this worthy cause.","        \"We have many scrolls that nobody reads in the Great Library,\" you say.  \"I'm sure","        we could sell enough of them to raise money for this noble deed.\"","","        \"Excellent,\" Berenice says.  \"Let it be so.\"","","        \"Oh, thank you, librarian,\" the priest says, bowing low.","","        If only it were that simple!  The problem with your plan, you discover, is that","        the books nobody reads are also the books nobody wants to buy; the books","        people want to buy are the books whose sale would result in a murderous","        riot at the Great Library.  In the end, you manage to scrape together","        enough money to feed many Egyptians, but not all of them, and you earn","        the eternal wrath of about twelve scholars.  Not a bad trade, you think;","        if you don't earn a scholar's eternal wrath now and then, you're probably doing","        something wrong.","        *set alexandria_knowledge -1","        *set egypt_unrest %- 5","","        *if ((not(nefertari_dead)) and (not(serve_nefertari)))","            When you check in with the priest later, you that hear Nefertari is still","            making the same offer to the poor Egyptians, but fewer people are","            taking her up on it.  You suppose that's the best that can be done.","    *if ((not(nefertari_dead)) and (not(serve_nefertari))) #Enough is enough.  I suggest declaring war on Nefertari.","        \"The real problem here is Nefertari,\" you tell Berenice.  \"Let us raise","        the money to feed the poor by capturing Nefertari's ships and confiscating her plunder.\"","","        \"I like the way you think,\" Berenice says.  \"Let it be so.\"","","        *comment There is no way to raise alexandria_strength before now, afaik.","        *comment Would revisit this and branch if there were.","        But the first month of the naval campaign goes extremely poorly.  Ships","        that are set to go after Nefertari find their rigging broken and their sails torn","        before they are a day out of port.  Investigators looking for clues to","        her ship's whereabouts turn up dead.  Officials close to the king find","        their pets dead inside their homes, with an Egyptian N squiggled in blood nearby.","","        In short, Nefertari has too strong a grip on the city, with all her compromised","        Egyptian workers, and you cannot get to her now.","        Alexandria will only see Nefertari when she is good and ready.","        *comment Now we're practically forcing the ending with this foreshadowing,","        *comment so let's push it","        *set egypt_unrest %+ 20","","*if serve_nefertari","    *page_break","    Curious about Nefertari's plan, you get the coordinates of her barge from","    her agent in town and pay her a visit.  (Coordinates:  you invented those!  Good job, you.)","","    Nefertari's barge is all activity, despite being in the middle of the Mediterranean,","    and the pirate queen herself is studying maps of the palace and nearby barracks.","","    \"Is the revolution at hand?\" you ask.  \"Is that why there's all this activity?\"","","    *comment Last call!  We don't set egypt_unrest again before the siege >= 50 check,","    *comment so we know exactly whether revolution will happen","    *if egypt_unrest >= 50","        \"Not so close,\" says Nefertari.  \"But soon.  Within the year.  Are you","        ready to be my Head Librarian?\"","","        \"I am getting quite sick of the Ptolemies, I can say that much,\" you say.","","        \"Have patience,\" Nefertari says with a smile.  \"Soon, very","        *if nefertari_lover","            soon, my love.\"","        *else","            soon.\"","","        \"Are you going to tell me when it's coming?\" you say.","","        \"My dear ${name}, you have been a faithful servant, but even you","        could not keep such a secret to yourself.  You are too soft-hearted.","        If you whisper it to even one innocent Greek baker or butcher,","        the revolution may be shot.  You will know when it happens.","        When it does, come to the palace, and I will find you.\"","","        You suppose that is the best you could hope for, and you spend","        a little time on the barge with","        *if nefertari_lover","            Nefertari","        *else","            Nefertari's crew, who sees you as their hero for starting their","            library,","        before returning to shore.","    *else","        Nefertari crumples up a map and tosses it over the side of the ship.","        \"No!  There can be no revolution.  Nothing adds up!  I simply don't","        have the support of the people.  Ptolemy's been too good to them.","        Without boots on the ground, we've already lost.\"  She buries","        her face in her hands.","        ","        If the Egyptian people are treated","        well, then Nefertari should be happy.  She knows that.","        But she had been looking forward to a takeover of Alexandria,","        and now she has realized she will always be a pirate,","        and never truly a queen.","","        *set nefertari_rel %- 30","        \"This is your fault,\" Nefertari says, suddenly looking up at you","        with a murderous gleam in her eyes.  \"You, the librarian","        who is so nice to Egyptians.  I don't know how, but you","        rubbed off on Ptolemy somehow, and you defanged my revolution.\"","","        \"I hardly did anything,\" you protest.","","        In a low voice, Nefertari says, \"You may be a hero to some","        of my people, but I want you to leave this vessel and","        never come near me again.\"","","        Saddened that Nefertari could not find contentment","        the way her people have, you take your leave.","        *set serve_nefertari false","        *set nefertari_lover false","","*page_break","*if euclid_dead","    *goto post_euclid","Shortly after that, Euclid falls","very ill.  You go to see Euclid in her house, a small, sparsely furnished","cottage on the outskirts of the city.  Euclid is lying on her hard-looking ","[i]kline[/i].  The old woman is looking a little green.","","\"I believe I may be dying, ${name},\" she says.  \"Stoicism says I must","be content with it, I know, but pain makes philosophy hard.\"","","*choice","    #I spend the next several days experimenting with medicines to attempt to improve Euclid's health.","        You spend the next several days experimenting with various medicines.","        *set medicine +1","        Euclid gamely takes them all, including the emetics.","        *if medicine >= 7","            Her condition improves, until a week later, she is walking around","            again.  You think you have saved Euclid's life.","            *achieve euclid_saved","        *else","            But her condition fails to improve, and one day, she never","            gets up again.","            *set euclid_dead true","    #I spend the next several days trying to learn everything I can from Euclid before she passes on.","        You find that Euclid knows about much more than geometry, and that problems","        of mirrors and optics have been concerning her lately.","        *set techne +1","        *if invented_optics","            You share with her your work with Archimedes on focusing the rays","            of the sun as intensely as possible, and learn she had similar","            thoughts about the mathematics of light.","","            \"There is a time and place for every piece of knowledge,\" Euclid","            says, \"and when the time is right, many can discover it.\"","        *else","            Your conversations with her lead you to imagine a new invention:","            a giant mirror that could focus the rays of the sun onto a point,","            perhaps setting its target aflame.","            *set invented_optics true","            *achieve optics","        ","        Euclid seems grateful for a topic of conversation that should take","        her mind off her pain.  But after four days, she passes away.","        *set euclid_dead true","    #I spend the next several days investigating who poisoned Euclid.","        You spend several days trying to find out who poisoned","        Euclid.  You ask her neighbors who was seen near her","        house, and you find that Sosibius was spotted there carrying a bottle of wine.","        Finding an open bottle of wine in Euclid's pantry that matches the","        neighbors' description, you try feeding it to some mice, ","        and they die.  But this line of evidence would not be enough to convict","        Sosibius, and you have no luck finding more.","","        When you report your results to Euclid, she shakes her head.  \"You","        did the best you could,\" she says.  \"I should have spoken up about","        that man back when you first came to the library.  Instead I held","        my tongue like a coward for years, and only recently did I tell Ptolemy","        about the day Sosibius threatened me.  I suppose word got to","        Sosibius that I said he was still a worthless heel of a man.","        Like a good Stoic, I'll at least die having","        spoken my mind.\"  She weakly puts a hand on yours.  \"Protect the library.","        It is so beautiful.  The royals know that.  But I fear","        my poisoning may have been practice….\"  She swoons and lies back","        on her [i]kline[/i], her eyelids closed and fluttering.  \"How can I die still so","        ignorant?  It's so unfair…so much I'll never know….\" She then passes away.","        ","        *set euclid_dead true","","        You regretfully have no hard evidence that Sosibius was the poisoner,","        but you could attempt to convince Ptolemy III to have him executed","        regardless.","        *choice","            #Yes, I will attempt to convince Ptolemy III to have Sosibius executed.","                You ask for an audience with Ptolemy III, and explain the","                circumstantial evidence that leads you to conclude Sosibius","                poisoned Euclid.","","                *if ptolemy_3_rel >= 55","                    Throughout your explanation, Ptolemy III nods thoughtfully.","                    When you are done, he says, \"Your evidence would not","                    stand in a court, but your intuition is good enough","                    for me.  Let Sosibius be hanged.\"","","                    Sosibius is executed the next day.  You attend","                    the execution, and feel Ptolemy IV's accusing eyes","                    on you the whole time.  Sosibius always pampered","                    Ptolemy IV, and you suspect it will take some time","                    for the young prince to forgive you.  Still,","                    *if evil","                        Sosibius surely had to die at some point;","                        he had no interest in sharing.","                    *else","                        you think the prince is better off without the slimy courtier's","                        influence.","                    *set sosibius_dead true","                    *set ptolemy_4_rel %-10","                    *set petty %-10","","                    For about a week, Ptolemy III's court is abuzz with speculation","                    about what Sosibius did to deserve his fate.  But then,","                    the interest of the court wanes, and life goes on.  Ptolemy","                    has earned the trust of his court, and they assume that when he","                    acts, it is for a good reason.  You hope that when Ptolemy IV","                    inherits the throne, he will not abuse that faith.","                *else","                    During your explanation, Ptolemy III develops a scowl.","                    When you are finished, he says, \"I can't run my empire","                    on hearsay and suspicion.  I'm sorry, but there simply","                    isn't sufficient evidence to convict Sosibius.\"","","                    *set madeSosibiusAccusation true","","                    When you next see him at court, Ptolemy IV seems","                    sullen—you think perhaps his father has told him of your","                    accusation.  Well, so be it—if the young prince trusts","                    both of you less, perhaps that is an improvement.","                    *set ptolemy_4_rel %-10","                    *set petty %-10","            *selectable_if (medicine >= 7) #I will attempt to poison Sosibius in turn.  (Requires Medicine: 7)","                You have a servant deliver to Sosibius a bottle of wine laced","                with aconite, a cold remedy that is poisonous in large doses.","                You worry that the courtier may be too paranoid to drink it,","                but your fears come to naught.  Within a few days, Sosibius","                is dead.","                *set sosibius_dead true","            #I will tell Ptolemy IV to stay away from Sosibius.","                At the end of one of your lessons, you tell Ptolemy IV,","                \"I think you should stay away from Sosibius if you can.  That","                man is trouble.\"","                *if (petty < 50) and (ptolemy_4_rel >= 50)","","                    Ptolemy IV nods obediently.  \"Yes, ${name}.\"","","                    You congratulate yourself on having won Ptolemy IV's","                    loyalty.  Sosibius should be much less dangerous without","                    the ear of the prince.","                    *set petty %-10","                *else","","                    \"You just don't like Sosibius because you're jealous,\"","                    Ptolemy IV says.  \"You know I like him better, because","                    he isn't afraid to enjoy our wealth instead of spending","                    it on the library.\"","","                    You can't seem to convince the prince that Sosibius is","                    dangerous;","                    *if petty > 50","                        Sosibius and he are good friends at this point.","                    *else","                        he just doesn't trust you enough.","                    But perhaps you've at least planted a seed of doubt.","                    *set petty %-5","","*if (euclid_dead and (not(euclid_died_early)))","    *page_break","    Euclid's funerary rites are a simple, quiet affair in her home,","    attended by all fifteen mathematicians in Alexandria.  Their awe","    of her is palpable.","","    Euclid's procession to the necropolis west of the city begins at dawn.","    At first, it is just you and the fifteen mathematicians.","    No one in the city particularly takes note","    until Ptolemy III joins the rear of the procession with an honor guard.","","    \"Even my grandfather was in awe of her,\" Ptolemy III says to you.","    \"Surely she deserves my respect as well.\"","","    Thereafter, the procession draws curious looks from commoners and","    merchants on the street, all puzzled at what kind of scholar could get","    the great king to attend the procession.","    When you reach the necropolis, Ptolemy III departs, and once again","    it is only the mathematicians, two of whom carry Euclid's body into","    the tomb.  The others silently contemplate their loss.","*page_break","","*if (evil and sosibius_dead)","    Emboldened by your engineering of the death of Sosibius, you wonder whether","    it is time to kill Ptolemy III.  You think you could get your hands on the same","    poison Sosibius gave to Euclid.","    *choice","        #Yes, it is time.  I need the king dead, so my puppet Ptolemy IV can take the throne.","            Using some poison you found among Sosibius's things, you poison","            an amphora of wine on its way to Ptolemy III.  A day later,","            the king sends for you in his chambers.  He lies on his large [i]kline[/i],","            looking sickly.","            *goto evil_jumps_here","        #No, I see now how detestable a poisoner is.  I have no interest in killing Ptolemy III.","            *set evil false","            Seeing","            *if euclid_dead","                Euclid die","            *else","                Sosibius come to his untimely end","            has made you realize how detestable murder is.  You have decided you are above","            such gross evil.","","*label post_euclid","","*if (not(sosibius_dead))","    Soon after that, Ptolemy III falls ill.","    *if (not(euclid_died_early))","        His symptoms match those of Euclid.","","    He sends for you, and you come to Ptolemy III's royal chambers, where he lies on ","    his large [i]kline[/i].","    ","    *label evil_jumps_here","    Berenice sits on a chair by Ptolemy's bedside, holding","    his hand.","","    \"You can't die,\" Berenice says to Ptolemy.  She brings his hand","    to her mouth for a kiss.  \"I thought you were supposed to be a god—isn't","    that what we told the people?\"","","    \"Even Alexander died, my dear,\" Ptolemy says.  \"I may have claimed to","    be a god, but I never claimed to be a better man than he.\"  He then notices","    your arrival for the first time.  \"Librarian!  I'm glad you've come.\"","","    \"You must help him,\" Berenice says.  \"To see him so frail…it's","    unnatural.  Something is very wrong.\"","","    *if madeSosibiusAccusation","        \"I have made a grievous error, I'm afraid,\" Ptolemy says.","","        \"What are you talking about?\" Berenice says, squeezing his hand.","","    *else","        \"Do you suspect poison, my dear?\" Ptolemy says.","","        \"You have many enemies,\" Berenice says.","        *if petty > 50","            \"And our son is more easily manipulated than you.\"","    ","    \"Tell me, ${name}, do you think this is poison?\" Ptolemy asks.","    *if madeSosibiusAccusation","        He hesitates.  \"Do you think it was Sosibius, as you said before,","        and that I brought this on myself?\"","","    *if (evil and sosibius_dead)","        \"Who can say, Your Highness?\" you say, professing ignorance.","        *set ptolemy_3_dead true","        *goto evil_jumps_here2","","    *choice","        #I tell him I think he was poisoned by Sosibius, then attempt to cure him.","            *if ((ptolemy_3_rel >= 55) or madeSosibiusAccusation) or euclid_died_early","                *if madeSosibiusAccusation","                    Ptolemy sighs.  \"Then I indeed brought this upon myself,\"","                    he says.  \"But before I go, I will see my assassin hanged.\"","                *else","                    Ptolemy studies you for a moment, as if weighing whether","                    to trust your opinion.  Then he sighs.","                    \"I knew I shouldn't have trusted that man,\" Ptolemy III says.","                    \"He will be executed.\"","","                Indeed, the next day, Sosibius is hanged.","                *if petty > 50","                    You hear that Ptolemy IV angrily raged at his father","                    over Sosibius's execution, but he doesn't seem to have","                    heard it was you who suggested it.","","                *set sosibius_dead true","                Meanwhile,","            *else","                You explain your suspicions to Ptolemy, but he is unconvinced.","                \"I cannot execute people on mere suspicion, librarian,\" he","                tells you.  \"The graveyards of the city would run out of plots,","                were I to kill everyone I suspected.\"","","                Berenice seems to consider your words, but she nods to","                Ptolemy.  \"My husband is right—we can't start hanging","                people based on pure suspicion.\"","","                You shrug.  \"As you wish, my lieges.\"","","                Still suspecting poison,","            *label tryToCurePtolemy","            you prescribe a mixture of antidotes","            to the more common poisons, such as hemlock and aconite.","            *if medicine >= 7","                Ptolemy III grudgingly imbibes the foul concoction three","                times a day, and over the next few days, his health improves","                until he is no longer ill.","                *set ptolemy_3_rel %+20","                *page_break","                *achieve royal_physician","","            *else","                You wish your knowledge of poison antidotes was more thorough.","                The ones you prescribe don't","                seem to do any good.  Within a few days, Ptolemy III is dead.","                *set ptolemy_3_dead true","","        #I tell him I think his son poisoned him, then attempt to cure him.","            *temp somebodyConvinced false","            *if ((ptolemy_3_rel < 55) and (rhetoric < 6)) or madeSosibiusAccusation","                *if madeSosibiusAccusation","                    \"You certainly are willing to throw around accusations,\"","                    Ptolemy says.","                The king shakes his head.  \"I can't believe my own son would","                poison me.  He loves his father.\"","","                *if ((berenice_rel < 50) or (petty < 50)) or madeSosibiusAccusation","                    Berenice shakes her head as well.  \"I can't believe it, either.","                    His very nickname about court is Philopator: father-lover.","                    It can't be him.\"","                *else","                    Berenice puts a hand on Ptolemy III's arm.  \"Oh, you","                    don't know the boy as we do, my love.  He is","                    the plaything of Sosibius, and who knows what fool notions","                    that man has put in our son's head.\"","","                    The old man sighs.  \"Perhaps you're right.  We will","                    question the boy.\"","                    *set somebodyConvinced true","            *else","                *set somebodyConvinced true","                \"My son?\" Ptolemy III says.  \"It seems too terrible to","                contemplate, but you are the wisest person I know.  Very well.","                We will do what needs to be done.\"","","            *if somebodyConvinced","                Ptolemy IV is captured and held in a guest room for questioning.","                *if petty > 50","                    He is a useless ball of rage for the entirety of his","                    captivity, simply screaming at his captors instead of","                    answering their questions.","                *else","                    The boy responds by crying nonstop for hours, until","                    he is finally silent.  But when he is questioned,","                    he claims to know nothing about poisoning Ptolemy III.","","                Meanwhile, you attempt to cure his father of the poison.","                *if medicine >= 7","                    Thankfully, your experience in medicine is up to the task,","                    and the elder Ptolemy improves day after day, until he","                    is fully recovered.","                    *set ptolemy_3_rel %+20","                    *page_break","                    *achieve royal_physician","","                    Ptolemy III invites you to accompany him to his son's","                    \"cell,\" a guest room that would be opulent by the","                    standards of an Alexandrian citizen.","                    *if petty > 50","                        But the room has been throughly thrashed, with","                        the remains of several urns shattered on the floor,","                        a tapestry lying shredded in a heap, and some","                        dents in the door and walls caused by the repeated","                        forceful application of a sturdy marble bust.","                    *else","                        Expensive-looking painted urns, a tapestry depicting","                        the siege of Troy, and a bust of Ptolemy I round out","                        the treasures of the room.","","                    Ptolemy IV lies facedown on his [i]kline[/i] with a pillow over","                    his head.","","                    \"Four, do you have anything you would like to discuss","                    with me?\" Ptolemy III says.  \"Something you would like","                    to apologize for?\"","","                    *if petty > 50","                        Ptolemy IV hurls the pillow and some obscenities ","                        his father's way.","","                        Ptolemy III tosses the pillow aside.","                    *else","                        Ptolemy IV remains silent under the pillow.","","                        His father leans in close.","                    \"If you don't change your attitude, young man, I will","                    have you hanged for treason.\"","","                    You suppose this is the sort of fathering that","                    results when a man usually delegates the task.","","                    *if petty > 50","                        \"If you're going to kill me, then do it!\" Ptolemy IV","                        rages.  \"Just don't pretend you love me and then","                        turn around and betray me!\"","","                    *else","                        Ptolemy IV just cries into his bed.  \"He said…he","                        said you would try to kill me.\"","","                        \"Who said?\" Ptolemy III says.","","                        \"Sosibius.  He said you would try to kill me one day","                        because you never really loved me.\"","","                        Ptolemy III frowns.  \"Did you try to poison me, or not?\"","","                        \"N-no.\"","","                        \"Did Sosibius?\"","","                        \"I don't think he would do that.\"","                    ","                    Ptolemy III looks to you uncertainly.","                    *choice","                        #I recommend executing Ptolemy IV.","                            \"This boy can't be king,\" you say softly to Ptolemy ","                            III.","","                            Ptolemy III reluctantly nods, and the two of you","                            leave, with Ptolemy IV","                            *if petty > 50","                                shouting curses at your backs.","                            *else","                                weeping softly behind you.","","                            The prince you worked so hard to educate is","                            hanged.  You hope you have done the right thing.","                            *set ptolemy_4_dead true","                        #I think we have the wrong person—let's execute Sosibius.","                            \"Something is not right,\" you tell Ptolemy IV.","                            \"I think Sosibius has acted to turn the prince","                            against you.  It is he who should be hanged.\"","","                            \"I think you must be right,\" Ptolemy III says.","","                            \"No!\" Ptolemy IV","                            *if petty > 50","                                screams.  \"Not Sosibius!  You monsters!\"","                            *else","                                says, crawling to abase himself before his","                                father.  \"Not Sosibius!  He was only ever","                                nice to me.\"","","                            \"I am sorry, child,\" Ptolemy III says.  \"Forget","                            about Sosibius.\"","","                            Sosibius is hanged the next day.  Though the","                            prince is likely to hold a grudge for it, you","                            *if evil","                                had to get rid of your rival sometime.","                            *else","                                think that in the end, he is better off","                                without the old advisor.","                            *set sosibius_dead true","                            *set petty %-10","                            *set ptolemy_4_rel %-15","                        #The evidence is too scant—no one should be executed.","                            \"Hold, sire,\" you say.  \"This boy does not","                            seem to be guilty, and we have no good evidence","                            to convict anyone else.  Let it go.\"","","                            Ptolemy III sighs.  \"Of course you're right,","                            librarian.  Son, I'm sorry.\"","","                            *if petty > 50","                                \"Hmph,\" Ptolemy IV says, crossing his arms.","                                \"You should be.\"","                            *else","                                Ptolemy IV responds by throwing his arms","                                around his father and crying.","","                            Though the king's poisoner is still somewhere ","                            in Alexandria, you have at least avoided slaying","                            the innocent.  For that, you have earned the","                            gratitude of both Ptolemies, father and son.","                            *set ptolemy_3_rel %+10","                            *set ptolemy_4_rel %+20","                            *page_break","                *else","                    Unfortunately, though you learn much while trying various","                    concoctions on the elder Ptolemy,","                    *set medicine +1","                    your ministrations prove insufficient,","                    and Ptolemy III passes away before Ptolemy IV can be","                    formally charged with any crime.  Now when Ptolemy IV","                    screams at his guards to let him out, they must comply.","                    *set ptolemy_3_dead true","","                    You think no one has told the prince that you were the","                    one who accused him, but he probably has his suspicions.","                    *if (not(evil))","                        You can only hope his incarceration did no lasting","                        damage to the boy's psyche.","                    *set ptolemy_4_rel %-5","                    *set petty %+10","            *else","                You continue to attempt to persuade them, citing all the","                bad behavior you have seen from the young prince, but the","                couple will not be swayed.  When they have had enough,","                they send you from the room.","","                \"But I was going to tend to your poison, sire!\" you protest.","","                \"You can do it tomorrow,\" Ptolemy III says.  \"I do not wish","                to see you at the moment.\"","            ","                Walking from the palace, you think of all the things you","                wish you had said.  It was a thorough defeat, but one you","                could have won with more skill in presenting your case.","                *set rhetoric +1","","                Unfortunately for Ptolemy III, there is no tomorrow:  his","                condition takes a turn for the worse, and he passes away","                in the night.  Some say he partly died of a broken heart,","                unable to trust his own son.  But you think it was probably the","                poison.","                *set ptolemy_3_dead true","                    ","        *if (not(madeSosibiusAccusation)) #I do not venture an accusation, but I do try to cure Ptolemy III's poisoning.","            With so little to go on, you do not wish to throw around accusations.","            To try to cure Ptolemy III,","            *comment this label is up above in the blame-Sosibius branch","            *goto tryToCurePtolemy","            ","        #I do not cure Ptolemy, for I have made a deal with the poisoner.","            Indeed, you recall an encounter with Sosibius in the royal kitchen,","            where he was resealing a bottle of wine with red wax.  His hands","            were smudged with some kind of green vegetable matter, and no wine","            was missing from the bottle.  There was a rank smell in the room.","","            *if medicine >= 4","                You identified the unpleasant odor: it was poisonous hemlock.","            *else","                \"Hemlock?\" you guessed, and Sosibius's wide eyes confirmed it.","","            \"I suppose you poisoned Euclid as well,\" you said.","","            \"Practice makes perfect,\" Sosibius said.  \"She was an","            old curmudgeon anyway.  I don't think anybody liked her.\"","","            \"All right, so she was practice,\" you said.  \"And Ptolemy?\"","","            \"You and I both know that the boy we influence would serve us","            better than his old man.  I've grown old waiting for him to die.","            You have, too.  Let's agree that his time has passed, shall we?","            Long live Ptolemy IV?\"","","            *if evil","                You liked Sosibius's plan.","                It wasn't so different from the plan you came to Alexandria with.","                What Sosibius didn't know was that the real plan would not include","                him in the end.","","                But no reason to let him know that.","            *else","                It suddenly struck you that you could, if you wished, do","                exactly what Sosibius was doing, and use your influence with","                Ptolemy IV for personal gain once Ptolemy III was gone.  Why","                not?  Of course, the continued existence of Sosibius","                would make this difficult.  Berenice could get in the","                way as well.","","                But there was no reason to let Sosibius know your","                thinking about all this.","                *set evil true","            What concession did you extract from Sosibius in exchange for your silence?","","            *choice","                #I demanded that Sosibius ensure Ptolemy IV would listen to me from now on.","                    \"You can't keep warring with me for the boy's affections,","                    then,\" you said.  \"I'll join your conspiracy, but that","                    boy ought to think I'm a Homeric hero from now on.\"","                    *set ptolemy_4_rel %+20","            ","                    \"Fine,\" Sosibius said.  \"It will be done.\"","","                    And you did notice that since then, Ptolemy IV has been","                    much more friendly to you.","                #I demanded that he encourage Ptolemy IV to be a good ruler instead of a petty one.","                    \"I'll help you, but not if it means destroying the","                    kingdom,\" you said.  \"I see the way you coddle and spoil","                    the boy.  If he spends the treasury on himself, or even","                    on us, it could rapidly spell the end of Alexandria's","                    golden age.  I'll aid your plot, but our power will only","                    be weakened if the boy is weak.\"","                    *set petty %-5","","                    \"Fine,\" Sosibius said, although you wondered how much","                    he could really change his own nature.  \"It will be done.\"","","                    Since then, you think you have noticed that the prince has ","                    become slightly less demanding…but the change has","                    been slight, if it hasn't been in your head entirely.","                #I demanded books for my personal library as a gesture of good faith.","                    \"Let's see some tangible proof of your good faith,\"","                    you told Sosibius, and you listed some books in rhetoric,","                    medicine, and techne that the Great Library itself had been unable","                    to afford.  \"Before old Ptolemy dies, or you will be","                    revealed.\"","","                    You lived the next week in fear that Sosibius would simply","                    poison you as well, and you made a point of buying food","                    from random street vendors and drinking water from wells","                    around town.  But the books you requested showed up on","                    your doorstep, as you requested.","                    *set techne +1","                    *set rhetoric +1","                    *set medicine +1","                #I simply told Sosibius to put in a good word for me with Berenice, since I have fallen for her.","                    *comment Though PC is arguably evil, we reverse this variable","                    *comment because the evil POV wants the whole family dead","                    *comment eventually, and here we shift toward a motivation","                    *comment of simply wanting to court Berenice.","                    *comment We can't randomly be telling the player they","                    *comment want Berenice dead after this.","                    *set evil false","                    \"Ah, I see how it is,\" Sosibius said with a leer.  \"No wonder","                    you want the king gone.\"","","                    \"I am not the poisoner,\" you said.  \"You are.  I will only try to","                    be there in Berenice's hour of need.\"","","                    \"Oh, how you must have chafed all these years!\" Sosibius said.","                    \"Now I know what makes the librarian tick.  Well, fine.  I will","                    put in a kind word after you're gone.  Berenice is too old for","                    my taste anyway.\"","                    *set berenice_rel %+ 10","            *page_break","","            \"No, I don't think it's poison,\" you tell Ptolemy III, back in the present.","            \"Sometimes, it is simply your time to go.\"","","            You leave Ptolemy's bedroom to the sound of Berenice weeping.","","            Within a few days, Ptolemy III is dead.","            *set ptolemy_3_dead true","","*label evil_jumps_here2","","*if ptolemy_3_dead","    *page_break","    The funerary rites of Ptolemy III begin with a small, quiet viewing of","    the body in a darkened room of the palace, with Ptolemy III laid out","    on a small [i]kline[/i] in the center of the room.  Berenice stays by his side","    the entire time, sometimes gripping the dead man's hand.","    *if (not(euclid_dead))","        Euclid is there to pay her respects as well, acknowledging the ","        greatness of the deceased with a low bow.","    *if (not(sosibius_dead))","        Sosibius hangs around the periphery of the room,","        chatting with important nobles and encouraging Ptolemy IV to chat with","        them as well.","    To his credit, Ptolemy IV seems shaken by his father's death,","    and tears continually creep into his eyes.","    *if berenice_dead","        *bug","    *if ptolemy_4_dead","        *bug","    ","    Then, one by one, the attendees leave the quiet room, leaving Berenice and","    Ptolemy IV with the body overnight.","    ","    At daybreak, the attendees","    reconvene for the procession to the tomb.  Though she is Greek, Berenice","    has covered her face in mud, in the Egyptian tradition.","    You join the procession, which quickly gathers mourners at the palace gates.","    Greeks and Egyptians alike wail as the procession makes its way down the","    street, and none wails louder than Berenice.","    Guards roughly shove away commoners who grasp at Ptolemy III's body,","    hoping to touch the divine.  People shout to Ptolemy","    *if sosibius_dead","        IV,","    *else","        IV as Sosibius whispers in his ear,","    but the young man's attention is wholly taken by his father.","","    Outside the west gate of the city, the procession ascends one of the","    hills of the necropolis until it reaches the temporary tomb where","    Ptolemy III will stay until a greater monument can be built.  It is","    a simple arch of stone in the side of the hill, with stairs leading","    down into darkness.  As none may enter the tomb but relatives, you ","    turn away, only to find that what looks like the whole city has been","    following you.  The people of Alexandria seem lost; they gaze at Berenice and","    Ptolemy the Younger, hoping for guidance.  But both Berenice and","    Ptolemy IV are at a loss for words.","","    It occurs to you that, though there was no speech planned for this","    moment, it would be the perfect time to speak to the assembled","    citizens of Alexandria.","    *if rhetoric < 3","        You've never been very good with words, but you could try.","    *choice","        #I give a speech honoring Ptolemy III's great wisdom.","            \"Friends, let us mourn great Ptolemy, as it is right to do so,\"","            you begin.  \"But let us also celebrate his works.  He built","            up the library and Musaeum, continuing the great work of his","            grandfather, and making Alexandria a beacon of knowledge and","            progress that will shine throughout the world…\"","            *if rhetoric >= 3","                The crowd seems content to listen to your praises of","                Ptolemy III, and you notice that Berenice and Ptolemy IV","                are rapt as well.","                *if (not(evil))","                    You hope young Ptolemy will learn from his father's","                    example of how to be great.","                *set berenice_rel %+ 10","                *set petty %- 5","            *else","                The crowd patiently listens, but you are no great orator,","                and you notice Berenice and Ptolemy IV in particular","                seem discontent.  Berenice looks as though she is regretting","                not speaking herself, perhaps thinking she could do a better","                job of it; and Ptolemy IV's slump and half-closed eyes ","                suggest that his grief is rapidly being replaced by boredom.  ","                Ah well, you tried.","                *set berenice_rel %- 5","                *set petty %+ 5","                *set ptolemy_4_rel %- 5","                *set rhetoric +1","","            When you are done, the crowd quietly disperses from the","            Necropolis.","            ","        #I give a speech emphasizing that Ptolemy IV will be a great ruler.","            \"Friends, do not grieve,\" you say.  \"For though one Ptolemy is","            gone, another is here to carry on his tradition.  Allow me","            to lift your spirits with some praise of young Ptolemy.\"","            *if rhetoric >= 6","                You launch into a somewhat exaggerated account of Ptolemy IV's","                accomplishments as a young man, encouraging the audience","                to believe that he will bring fresh ideas and a love of the","                common people to the throne.  You characterize his lack of","                experience as a purity that is untainted yet by the politics","                of the palace, and promise that Alexandria will no longer","                gallivant around Syria in ill-conceived wars when Ptolemy IV","                is king.","","                Ptolemy IV clearly enjoys your praise, and when you are","                finished, the people actually break into applause, their","                spirits lifted.  Only Berenice's expression looks dark,","                her love of her life so quickly forgotten by the people.","                *set petty %+ 10","                *set ptolemy_4_rel %+ 20","                *set berenice_rel %- 10","","                The crowd departs, in lighter spirits than when they arrived.","            *else","                You try painting a rosy picture of Ptolemy IV's upcoming","                rule, but you stumble when you try to list his accomplishments,","                since he clearly doesn't have any.  Perhaps a more skilled","                orator could have made this sound like a virtue, but when","                you try consoling these people by telling them about","                Ptolemy IV's skill at painting, you actually seem to be","                making them mad -- Berenice even moreso than others.","                Chagrined, you cut your speech short with a cheery","                \"Well, that's all, see you on coronation day!\"","                ","                As the crowd departs, you catch a glimpse of a strange","                expression crossing Ptolemy IV's face, and you can","                see you have only succeeded in pointing out the gaping","                chasm between his accomplishments and his father's.","                *if (not(evil))","                    Oh well.  Perhaps some good may come of that.","                *set petty %- 10","                *set berenice_rel %- 15","","        #I remain silent.","            Silence is right and proper for the somber occasion, you think.","            As Berenice and Ptolemy IV enter the tomb, the crowd turns","            away, still lost in mourning.","","    *page_break","","    Ptolemy IV ascends to the throne ","    *if petty < 50","        in a short and frugal coronation ceremony.","    *else","        in a grand coronation ceremony that is followed by a party that lasts","        until dawn.","","    *if petty >= 50","        The next day, Ptolemy IV looks around the throne room with disdain.","        \"Why have we lived as paupers when we could have lived as kings?","        Let us get more servants in here, and fine tapestries, and musicians!","        Let poets entertain us, let the wine flow freely!  We will be austere","        no more!\"","","        *if (not(sosibius_dead))","            \"I couldn't agree more, sire,\" Sosibius says.","","        *choice","            #I encourage Ptolemy IV to spend more on luxuries for the court.","                \"I think Ptolemy III was a bit more frugal than he needed to","                be,\" you say.  \"I encourage you to spend as much as you like","                on making the court more splendid.\"","","                Ptolemy appreciates your encouragement, and he does his best","                to make the court more glamorous. ","                *gosub courtSpending","                *set alexandria_strength -1","                *set petty %+10","                *set ptolemy_4_rel %+10","            #I ask that the money be spent on the Great Library instead.","                *gosub ptolemySaysNoLibrary","                ","                *gosub courtSpending","                *set ptolemy_4_rel %-10","                *set alexandria_strength -1","            #I ask that more money be spent on the Great Library as well as on luxuries.","                *if ptolemy_4_rel > 50","                    \"Of course,\" Ptolemy IV says.  \"Why not share my wealth?","                    After all, you have been good to me, librarian.","                    You can have your library, and I will have my court.\"","","                    *gosub courtSpending","","                    True to his word, Ptolemy IV also purchases the next hundred","                    books you request for the Library.  You wonder a bit","                    how the treasury handles it, but this is not your concern.","                    *set alexandria_strength -2","                    *set alexandria_knowledge +1","","                    *gosub buyBooks","                *else","                    *gosub ptolemySaysNoLibrary","","                    *gosub courtSpending","                    *set alexandria_strength -1","    *else","        \"Now that I am king, I can grant you better favors,\" Ptolemy IV","        tells you after the coronation ceremony.  \"Tell me, could the","        Great Library use more money to purchase books?","        *if alexandria_strength >= 4","            We have kept up a militia","            large enough to fight a war, yet we have been at peace for years.","            I could divert some funds to the library instead.\"","        *else","            We have already diverted some funds from the military recently, and have seen","            no terrible consequences.\"","        ","        *choice","            #\"More funds for the library sounds like an excellent idea.\"","                *set alexandria_strength -1","                *set alexandria_knowledge +1","                \"It will be done,\" Ptolemy IV says, and true to his word,","                he delivers a large sum of money to the Great Library for","                the purchase of new books.","                *gosub buyBooks","            #\"Things are fine the way they are, Your Highness.\"","                \"One never knows when the military may be needed, Your","                Highness,\" you say.  \"The library is doing fine.\"","","                \"As you wish,\" Ptolemy IV says.","            #\"We should spend more for the city's defense.  Knowledge can wait.\"","                Ptolemy IV seems struck by your advocating for a stronger","                military.  \"Perhaps I underestimated what sort of military","                we need, after all,\" Ptolemy IV says.","","                \"We are not as strong as Rome, for example,\" you say.","                \"All it takes is one stronger nation to make the weaker","                suffer.\"","","                \"We shall do better,\" Ptolemy IV says, and true to his word,","                he hires additional mercenaries to strengthen Alexandria's","                militia.","                *set alexandria_strength +1","                *set alexandria_knowledge -1","*page_break","*if (ptolemy_3_dead and (not(berenice_dead)))","    For a few weeks after Ptolemy III dies, Berenice is overcome with grief","    and rarely leaves her room in the palace.  But eventually","    she trades her mourning garb for her usual regal garments.","","    Does any part of you see this as an opportunity to romance the queen?","    *choice","        #Yes.  I pay her a visit to determine whether the interest is mutual.","            You find the queen at the stables, about to take her mare for a ride","            around the lake.  \"May I join you, Queen Berenice?\"","","            *if berenice_rel < 60","                \"Leave me alone,\" Berenice says coldly.  \"I will say to you what I have said to all","                the others: I loved my husband greatly.  I am not interested","                in your advances.\"","","                \"I only thought you needed companionship,\" you say, before you catch yourself.","                \"I mean, at the moment.  Not necessarily…romantic.  Though I'm not saying","                I [i]wouldn't[/i] be interested in that.\"","","                Berenice stares you down, and you realize that your storybook romance","                will never happen, not in this life.  Oh well.","            *else","                Berenice seems to consider you for a moment in a new light.  \"Yes,\" she says","                slowly.  \"I would like to go riding with you.\"","","                *gosub riding_with_berenice","        #Yes, but it would be inappropriate.  I write to her to cheer her up, keeping my feelings hidden for the moment.","            You write to Berenice from your office in the Great Library, sending her wise","            sayings of the Stoics and little poems about loss and rebirth.  You","            second-guess yourself when evaluating poems about finding someone new…are you sending","            these only to set a suggestion in her mind?  You censor yourself aggressively, but","            you can't tell whether Berenice can perceive your longing plainly.","            *set berenice_rel %+ 10","","            *if berenice_rel < 55","                Unfortunately, your little notes are all for naught.  A letter from a palace","                guard asks you to cease your correspondence, on orders of Her Majesty","                Queen Berenice.  With your love found out and spurned, you reluctantly comply.","            *else","                Finally, Berenice sends you an invitation to go riding with her.","                She says she appreciates your notes greatly, and that she has realized you","                are the person she trusts most in Alexandria.","","                Needless to say, you accept the invitation.","                *page_break","                *gosub riding_with_berenice","        #No, but I will do my best to cheer her up regardless.","            You do what you can, sending Berenice","            *if techne > rhetoric","                little knickknacks you've made in your workshop that you hope will cheer her up.","            *else","                little poems about the small pleasures in life, in an effort to lighten her mood.","            *set berenice_rel %+ 10","","            Berenice sends you a note in turn thanking you for your support during this difficult time.","        #No, I see this as an opporunity to destroy her.  I spread rumors that she had a hand in poisoning Ptolemy III.","            *set evil true","            You have never liked Berenice, and this is your chance to strike.","            You spread rumors that she poisoned Ptolemy III and plans to poison","            Ptolemy IV next.","            *set kill_berenice_bump true","","    *page_break","        ","*if (evil and sosibius_dead) and ptolemy_3_dead","    Emboldened by the death of Ptolemy III,","    you wonder whether it is time to kill Berenice.","    *choice","        #No, I like Berenice.","            Berenice has grown on you since you came to Alexandria.  You decide that she can live.","        #Yes, Berenice dies now.","            Ptolemy III's death","            was a bit unsubtle for your taste; it would be better, you think, to have Ptolemy IV","            do this job himself.  You know that his relationship with his mother has been","            fraught, to say the least.","","            You spread a rumor that Berenice wishes Ptolemy IV dead because she wants to","            take the throne for herself.","","            *page_break","            *goto evil_jumps_here3","","*if (not(sosibius_dead)) and (not(ptolemy_4_dead))","    A few weeks pass in which you are busy with library business and rarely","    see Ptolemy IV.","    *if ptolemy_4_rel < 40","        But then the city is abuzz with the news that Berenice is dead.","        *set berenice_dead true","        *if ptolemy_3_dead","            Ptolemy IV announces from the balcony of the palace that Berenice","            was leading a conspiracy against him, and that she has been","            hanged for her treachery.","","            Conspiracy does not sound like the Queen Berenice you knew.  You","            wish you had been able to talk the boy out of it, but he apparently","            did not trust you enough to confide his doubts to you.","","        *else","            She was killed in the night by knife-wielding assassins.","            Ptolemy III has requested that anyone with information related","            to the assassination come forward. ","","            Assassinated in the palace…surely the assassins must have","            had help from someone on the inside.","","        *gosub mourn_berenice","","    *else","        ","        But then young","        *label evil_jumps_here3","        Ptolemy IV comes to you in the Great Library,","        distraught and seeking privacy.","","        *temp convinceText \"convince your father to\"","","        You find a secluded alcove, and there amongst the old scrolls,","        Ptolemy IV whispers to you, \"I think my mother is plotting to kill me.","        *if ptolemy_3_dead","            *set convinceText \"\"","            She poisoned Father, I know it, and now she wants me dead so","            she can have the throne for herself!\"","        *else","            She tried to poison Father to gain the throne, but now that","            I suspect her, she must eliminate me instead!\"","        *label berenice_choice","        *temp pettyThresh 50","        *if kill_berenice_bump","            *set pettyThresh -10","        *choice","            #\"You should do what you feel is best.\"","                You encourage Ptolemy IV to do what he thinks is best.","","                *if petty < pettyThresh","","                    *if sosibius_dead","                        Finally, he shakes his head.  \"I can't do it,\" he says.","                        \"I can't have my own mother killed.\"","","                        *if evil","                            ","                            Drat!","                        *page_break","                    *else","                        *gosub mustKillSosibius","                *else","                    ","                    \"Very well,\" Ptolemy IV says grimly.  \"I will do what must be done.\"","","                    *gosub BereniceDead","            #\"You're right, Berenice would not hesitate to kill you.\"","                \"So you agree with Sosibius,\" Ptolemy IV says sadly.  \"Very well,","                I will do what must be done.\"","","                *gosub BereniceDead","","            *if (not(sosibius_dead)) #\"Sosibius is manipulating you.  You should ${convinceText} execute him.\"","                *if (ptolemy_4_rel >= 55) and (petty < pettyThresh)","                    *gosub mustKillSosibius   ","                *else","                    \"No,\" Ptolemy says.","                    *if agathoclea_lover","                        \"Sosibius has been my closest friend","                        since childhood.  He would never lie about such a thing.","                        I won't listen to you!\"","                    *else","                        \"It's your fault Agathoclea and I aren't together.  I'm tired","                        of listening to you.  Sosibius wants me to be happy, and you're","                        just a tool of my mother.\"","                    Ptolemy stalks off.","","                    You were unable to convince young Ptolemy of Sosibius's","                    treachery.","","                    *gosub BereniceDead","","*if ((not (ptolemy_3_dead)) and (berenice_dead)) and (not(ptolemy_4_dead))","    The elder Ptolemy launches an investigation of Berenice's death,","    and comes to the conclusion that it was Ptolemy IV who hired the assassins.","    With regret, he orders Ptolemy IV hanged.","    *set ptolemy_4_dead true","","*if ((not(ptolemy_3_dead)) and berenice_dead) and (ptolemy_3_rel >= 60)","    *comment Potential romance branch - note the rel check","    Bereft of both his wife and his son, Ptolemy III enters a gloomy funk","    that lasts for months.  He speaks to few people during this time, allowing","    his advisors to run the empire while he grieves.  Finally, he summons you to the throne room.","","    Ptolemy III does not look as strong as he once was.  He is thin, and he has dark rings","    under his eyes.  His hair has developed gray streaks.  Nevertheless, he is still a proud","    and handsome man, perhaps more noble in appearance for having weathered tragedy.","","    Unlike your usual audiences, there is no one else here at all.","","    \"${name}, I summoned you because you are the most wise and kind sage","    I know,\" Ptolemy says.  \"I have been afflicted with dark thoughts these","    past few months, and I wonder how I can take my mind off them.","    Can you suggest any solace?\"","","    Are you attracted to Ptolemy?","    *choice","        #Yes, but I would never take advantage of his grief.","            \"Sire, I…\"  You shake your head.  \"I'm sorry, I'm not","            the best person to ask.\"","","            \"Why not?\" Ptolemy III demands.","","            \"Sire, please,\" you say.  \"I know you feel you can trust me","            in all things, but I'm not sure you can trust me in this.\"","","            Ptolemy frowns.  \"Approach the throne.  Come closer.\"","","            \"Sire…?\"","","            \"Do as I say.\"","","            You approach the throne, and Ptolemy looks deeply into your eyes.","","            \"You're attracted to me.\"  He sounds mostly baffled.","","            \"Sire, is this really the time?\"","","            \"You are.\"  He smiles slightly.  \"Did you know I've always been","            attracted to you as well?","            *if male","                You remind me of a lover I had long ago.","                Such a remarkable man, so incomprehensibly wise.\"","            *else","                Make no mistake, I loved my Berenice, but a man can't help","                but turn his head when he sees a woman like you.\"   ","","                This is news to you.","","            \"Surely you should take the time to reflect upon your grief…\" you say.","","            \"I am the king and I shall do as I please,\" he says.  \"Kiss me.\"","","            \"What?\"","","            \"Kiss me.  I command it.\"","","            Hesitantly, you kiss Ptolemy, and you experience a thrill you had never","            dared hope to experience when Berenice was alive.","","            When you finish, Ptolemy smiles in satisfaction.  \"You know you don't","            really have to kiss me when I command it.\"","","            \"Oh,\" you say.","","            \"But I would like it if you returned to the palace often,\" Ptolemy III","            says.","","            \"As you wish,\" you say, thinking, [i]Surely he could have found someone younger.[/i]","","            \"Good,\" he says.  \"It's settled.\"","","            *goto p3_romance_end","","        *if (not(male)) #Yes, and this is my chance to become queen.","            \"I suggest this,\" you say, and you boldly stride up to","            Ptolemy III and kiss him on the mouth.","","            When you pull away from the astonished king, he says","            breathlessly, \"I did not give you permission to approach the throne.\"","","            \"And you like it that way,\" you assert.  You don't bring up","            Berenice, but you're certain she must have had a dominant personality","            with the king.","","            Ptolemy smiles, assessing you.  \"Perhaps.  Perhaps I have a certain","            attraction to you, lib…I mean, ${name}.  How do I know you aren't","            simply trying to jockey for power here?\"","","            \"Of course I'm jockying for power,\" you admit.  \"You must jockey for power every day","            to stay where you are.  Don't judge [i]me[/i] for it.\"","","            Ptolemy nods.  \"I like your boldness, ${name}.  Give me a week.","            I'll get all the rest of my wailing and moaning out.  Then come to","            the palace again.\"","","            \"It will be my pleasure,\" you say.","","            *goto p3_romance_end","        #No, why are you asking me that?  Don't ask me that.","            \"I myself find the greatest happiness in creating and","            discovering great things,\" you say.  \"Alexandria is your","            great work.  It is hard to suffer loss, but take pride","            in what you have accomplished here.  Learn to love","            the good work you do.\"","","            Ptolemy III smiles.  \"I knew I asked the right person,\"","            he says.  \"Yes, my wife and boy are gone, but the city!","            The city may stand for hundreds, thousands of years!","            You're right, I have lost perspective.  I must understand that","            we fleshy mortals are only transitory in this world.","            But the city remains!\"","            *set ptolemy_3_rel %+ 10","","            \"Happy to be of service,\" you say.","","            *if colossus_built","                The next day, as you are headed to the Great Library,","                you catch sight of Ptolemy III standing at the feet","                of the unfinished Colossus.  He is looking up at","                where the head will be, and he is smiling.","","                *finish Chapter 6: Civilization Under Siege","            *else","                You return to your work at the Great Library, but","                your advice to Ptolemy III haunts you.  If all that","                matters is what lasts for hundreds of years, why","                did you not rebuild the Colossus?  But Ptolemy apparently","                thinks along similar lines.","                ","                He decrees that the Colossus shall be built in the image of Berenice.","","                *set colossus_built true","                *set colossus \"Berenice\"","                *finish Chapter 6: Civilization Under Siege","","*if ptolemy_3_dead","    Such is the inauspicious beginning of Ptolemy IV's reign.","*elseif ptolemy_4_dead","    Thus did a foolish young prince come to an end, but not before","    having done irreparable damage.","*elseif sosibius_dead","    You congratulate yourself on the role you played in","    *if evil","        Sosibius' death.","        *if ptolemy_3_dead and berenice_dead","            With Ptolemy IV's parents dead, you can now begin to control the prince in earnest.","        *else","            Now you just need to do something about","            *if ptolemy_3_dead","                Berenice!","            *elseif berenice_dead","                Ptolemy III!","            *else","                the prince's parents!","    *else","        keeping Sosibius from further poisoning the mind of Ptolemy IV.","*else","    Having played out his hand, Sosibius becomes relatively quiet at court.","Everything goes back to normal for a time, just with a few more poison","tasters at court.","","*if (berenice_romance and male) and (not(berenice_dead))","    Then you find out that Berenice is pregnant.","","    With your child.","","*finish Chapter 6: Civilization Under Siege","","*comment ———Reused snippets———-","","*label ptolemySaysNoLibrary","\"Of course you would say that,\" Ptolemy IV says.  \"Everyone","has a little cause of their own, and that is yours.  But you","are no longer in charge of me, librarian.\"","*return","","*label courtSpending","Soon, the throne room is bedecked with fine tapestries from around the ","world.  Slaves bear carafes of wine and stuffed grape leaves","to Ptolemy, who drinks and snacks incessantly.  The new king begins wearing","a gold headdress and an assortment of jeweled rings.","*return","","*label buyBooks","What subject matter would you prefer to purchase for the Great Library?","*choice","    #Great speeches and treatises on logic.","        The library completes its collection of speeches","        by great Greeks, which you enjoy perusing at","        your leisure.","        *set rhetoric +1","    #Engineering texts.","        The library acquires several rare texts said","        to have belonged to Aristotle himself.","        *set techne +1","    #Medical texts.","        The library acquires several intriguing treatises","        from China that detail points of energy on the body","        and assorted curative substances.  Perhaps some of it","        is even true.","        *set medicine +1","*return","","","*label mustKillSosibius","After a long pause, Ptolemy nods his head.  \"This is madness,","mistrusting my own mother.  It's Sosibius who is planting these","terrible thoughts in me.  I must be rid of him.\"","","*if ptolemy_3_dead","    At Ptolemy IV's orders, Sosibius is hanged the next day.","*else","    Ptolemy IV tells his father about the vicious rumor Sosibius tried","    to spread about Berenice, and soon Sosibius is executed.","*set sosibius_dead true","*return","","","*label BereniceDead","Two days later, Berenice is murdered by knife-wielding","assassins.  The whole kingdom laments, save ","*if sosibius_dead","    *if not(evil)","        *bug","    you","*else","    *if evil","        you, Sosibius,","    *else","        Sosibius","and Ptolemy IV.","*set berenice_dead true","","*gosub mourn_berenice","*return","","","*label riding_with_berenice","You and the queen ride your usual path around the shores of Lake Mareotis,","out past where the fishing boats go, so it is only you and she.","","\"The thing you need to understand is that when your husband dies,","he doesn't simply disappear,\" she says, looking out over the lake","toward Alexandria.  \"When I am in the throne room, I still feel he is on the throne,","not my son.  When I am in the bedroom, the spaces where his things","used to be remain empty.  He looms in his absence.\"","","\"I don't mean to intrude,\" you say.  \"If you need more time…\"","","\"I don't know what I need,\" Berenice says.  \"I need reason.  I need order.","I need something to fill the empty spaces in my life.  With my son","on the throne, I'm supposed to take a step back.  I don't know what I'm going to do.\"","Berenice grins wryly.  \"We always asked you for advice.","Tell me, O wise librarian, what should I do?\"","","You ride up beside the queen and lean in to kiss her.","","After a moment's hesitation, she kisses back.","","Then the two of you kiss some more.","","Your horses whinny impatiently.  You ignore them.","","Neither of you explains to the other why this is happening.  But it feels right.","","*if male","    After what seems like forever, Berenice says, \"I'm forty now, so it's ","    probably safe to…what I'm saying is, if you want to…\"","*else","    After what seems like forever, Berenice says, \"My whole life, I've only been with men,","    but if you're willing to teach me…\"","","You nod, and the two of you move from your horses to the grass.","*set berenice_romance true","*page_break","Your relationship with Berenice continues for a while in secret, as neither","of you wishes to feed the rumor mill.  For the moment, nobody suspects a thing.","","*return","","","*label p3_romance_end","*set ptolemy_3_romance true","","Thus begins your affair with Ptolemy in the aftermath of Berenice's death.","Ptolemy is a patient and masterful lover in bed, but you think it is","his sheer worldly power that somehow delights you most.","","*if male","    Perhaps it is your very inability to marry Ptolemy that makes him","    so relaxed around you.  While the various powerful families of Alexandria","    push one woman after another in Ptolemy's direction, he rests easy","    knowing that you desire no particular royal title.","","    It is all more than you ever expected, and it is enough.","*else","    You aren't certain whether you are headed to marriage, but you are delighted","    to see where this goes.","","    In your trysts with the king, you are uncareful about pregnancy. ","    At your age, such precautions could hardly matter, you think.","","    But you think wrong.  Perhaps Ptolemy is as wondrous as his city,","    for you are soon pregnant with Ptolemy III's child.","","*finish Chapter 6: Civilization Under Siege","","","*label mourn_berenice","*if berenice_romance","    Your heart breaks as you think of Berenice's ignoble death.","    You were beginning to think the two of you could have had a future together.","    Now you think you might remain alone forever.","*elseif evil","    You smile to yourself: that's one fewer person to compete with for","    control of Ptolemy IV.","*elseif berenice_rel >= 50","    You are saddened by the death of the queen, as you had always gotten","    along well with her.  You thought she had a noble spirit, and you wish","    that spirit well, wherever it may go next.","*else","    You and Berenice had never gotten along terribly well, but you find","    her sudden death unsettling nonetheless.","*return",""], "labels":{"post_euclid":672,"evil_jumps_here":682,"trytocureptolemy":752,"evil_jumps_here2":1100,"evil_jumps_here3":1442,"berenice_choice":1457,"ptolemysaysnolibrary":1687,"courtspending":1693,"buybooks":1700,"mustkillsosibius":1721,"berenicedead":1735,"riding_with_berenice":1754,"p3_romance_end":1798,"mourn_berenice":1825}}