{"crc":1477084228, "lines":["*image chap3.png center Chapter Three: A Trip Down the Nile","","*set year 240","You, Sosibius, and Ptolemy IV set off down the Nile on","a large barge, headed for Syene.  Besides the forty","rowers, the crew has several slaves to take care of Ptolemy IV's every","whim.","","*if petty > 55","    And young Ptolemy has plenty of whims; the five-year-old","    is constantly demanding food and asking slaves to carry his ","    palanquin to different parts of the barge for a better view.","    The slaves fanning him with palm fronds can't ever seem to quite","    please him, as he asks them to go faster or slower.","*elseif petty > 50","    *if primary_caretaker = \"Sosibius\"","        Sosibius seems to be training young Ptolemy to want the finer things","        in life—when","    *else","        Sosibius seems to insist on being a bad influence on young Ptolemy IV","        whenever he encounters the boy—when","    Ptolemy asks for a simple fig, Sosibius reminds","    him that he could have sweetened stuffed dates, or honey candy from Rome.","    The boy obediently changes his mind in response.","*else","    But five-year-old Ptolemy rarely asks anything of them—he seems ","    fascinated just to look out at the vast expanses of Egypt that are","    all his.","","You wish Sosibius had not managed to insinuate himself into this voyage,","but","*if primary_caretaker=\"Sosibius\"","    he is the boy's caretaker, after all.","*elseif euclid_dead","    it has been years since Euclid made her accusations,","    and","in procuring the barge and supplies, Sosibius managed to make himself","quartermaster of the expedition before anyone quite knew what was happening.","*if euclid_dead","    Ptolemy has asked you to keep an eye on him for any suspicious","    behavior; Berenice, on the other hand, asked you to give him a second","    chance and get to know him better.  Neither of them was particularly","    good at listening to your complaints.","","Walking on the shore alongside the ship is a slave operating a new","invention of yours, the hodometer.  The invention's wheels are attached","to two gears that interlock in such a way as to drop a marble into","a bucket with every thousand paces you travel.  At the end of each day, the","marbles are counted. In this way, you will get an accurate","measurement of the distance to Syene, which you will use to calculate","the size of the world.","","How will you spend the bulk of the trip?","*choice","    #I've been working on a new invention: a fire engine.","        You reason that Sosibius can take care of Ptolemy IV just fine.","        *set petty %+10","        ","        You decide to spend the bulk of your time instead working","        on a device that can put out fires.  Your design consists","        of a large tank of water with two pistons that, when the large","        handle is rocked back and forth, force water up a central shaft","        and out a pipe that can be aimed in any direction.","        Your device should make it much easier to put out","        any fire that may strike the library.","","        You spend a few days belowdecks drafting a detailed diagram","        of your invention, working out exact dimensions from your","        rough idea.  Whenever you go up to check on Ptolemy IV,","        he is simply at the rails of the ship with Sosibius, asking","        general questions of the man about the Nile's creatures, mostly","        the deadly ones: asps, hippos, catoblepones.  Sosibius, who is","        clever but not knowledgeable, takes the Socratic approach and","        parries each question with one of his own:  Do [i]you[/i] think hippos","        are deadly when they charge?  You must give Sosibius credit:","        he doesn't simply lie out of convenience.","","        It's when you begin construction of your prototype abovedecks","        that you think you may have erred in deciding to build this","        here and now.  The construction of your fire engine requires a","        fair amount of manual labor, sawing wood to your specifications","        and hammering it together.  You can tell Ptolemy IV is annoyed","        at the noise and repelled at the sight of","        *if primary_caretaker = \"you\"","            the","            *if male","                man","            *else","                woman","            who raised him acting as if ","            *if male","                he","            *else","                she","            were a common carpenter.","            Though you may have loomed large in Ptolemy's eyes once,","            at the moment you must seem very much","            like one of common day laborers whom his father orders around","            without a thought.","        *else","            his tutor performing","            manual labor.  Surely his father didn't get him a manual laborer","            for a tutor!","            ","        Sosibius whispers something in the young boy's","        ear that makes him giggle—annoying, that.  He and Sosibius","        go belowdecks to continue their conversation, which had drifted","        more toward politics and the proper behavior of a ruler.","","        The damage to your standing with Ptolemy done, you decide to finish","        construction of your prototype.  Perhaps it's because you're annoyed,","        but when you're done, the first thing you do to test it out is spray","        a flock of ibises near the shore, which take off squawking.","        Your device works like a charm; maybe someday it will save the library.","","        *set invented_fire_engine true","","        *page_break","        *achieve firefighter","    #This trip should primarily be about Ptolemy IV's education.","        You spend most of your time on the trip at Ptolemy's side,","        teaching him about natural and moral philosophy.","","        \"But surely these rules will not apply to me,\" Ptolemy IV says,","        munching grapes and lounging in his palanquin.  \"I will be ","        king, and if I choose to make new rules, I can.\"","","        \"I completely agree, sire,\" Sosibius says, overhearing your","        conversation.  \"In fact, I would say you should be suspicious","        of anyone who tells you otherwise.  The power is yours and","        yours alone.\"  He looks to you, as if daring you to contradict him.","","        *choice","            #\"Sosibius is right—let no one tell you what to do.\"","                *set petty %+20","                *set elitist %+10","                *set idealist %-10","                *set ptolemy_4_rel %+20","                \"Of course—you are the prince,\" you tell Ptolemy.","                \"It is natural for all to serve you.  You are the","                final arbiter of what is good, excepting your parents.\"","","                Ptolemy IV looks pleased with your response.  \"I see,","                and you were simply telling me how others lived with","                this moral philosophy.  But since it doesn't","                apply to me, I would prefer to learn more natural","                philosophy.\"","","                \"As you wish,\" you say, and you proceed to the more","                physical works of Aristotle.","","                Sosibius winks at you.","                *page_break","            #\"It is in your own self-interest to rule wisely and justly.\"","                *set idealist %-15","                *set elitist %-10","                \"I see,\" Ptolemy IV says.  \"So I should learn about morality","                so that I know what is upsetting to my subjects.\"","","                \"Exactly,\" you say.  \"Many foolish rulers have thought","                themselves above reproach.  But if the people see you leading","                an extravagant lifestyle that takes no heed of the desires","                of others, you may soon find yourself without a kingdom.\"","","                \"Watch your words, librarian,\" Sosibius says.  \"That","                sounds almost like a threat.\"","","                Ptolemy looks back and forth between you two.","                *if ptolemy_4_rel > petty","                    Finally he says, \"I will take your words into","                    consideration, ${nickname}.  Though I still","                    believe I am above moral rules, I will act carefully.\"","                    *set petty %-10","                *else","                    Finally he says, \"Sosibius is right, ${name}.","                    Do not speak to me of rebellion again.  I will","                    tell Father that you threatened me.\"  His lip","                    quivers—you've frightened him.  So at least your","                    message got through, although you wonder what exactly","                    the boy will tell the elder Ptolemy when you return home.","                    *set petty %-10","                    *set ptolemy_3_rel %-5","            #\"I believe every person is of equal moral value.\"","                *set elitist %-20","                *set idealist %+20","                \"Equal?\" Ptolemy IV says, as if the word leaves a bitter","                taste in his mouth.  \"Do you really mean to say that","                I am no better than these slaves?\"","","                Sosibius laughs.  \"Yes, are you saying that, librarian?\"","","                The two slaves fanning Ptolemy with palm fronds look ","                uncomfortable with this line of conversation.","        ","                \"Slaves deserve to be treated well, the same as you,\" ","                you say.  \"It is only the whim of the Fates that has","                made you a king and them slaves.  But slaves are men and","                women like anyone else.\"","","                \"I will hear no more of this,\" Ptolemy IV says angrily.","                *set ptolemy_4_rel %-15","                ","                \"I mean no disrespect,\" you tell Ptolemy.  \"Only, if you","                are to be a wise ruler, you must value all your people.\"","","                You think Ptolemy doesn't care much for your lesson, but","                he will likely think on it.","                *set petty %-15","                *set egypt_unrest %-10","                ","    #I want to find out more about the Egyptian villages we pass.","        *set elitist %-10","        The Egyptian slaves Ptolemy brought on board as servants ","        prove quite knowledgeable about the surrounding area.","        They tell you about the great Egyptian kingdoms that rose","        and fell on the Nile Delta, and which villages are hundreds","        or even thousands of years old.","","        They also tell you of an affliction that has blighted many of","        the villages in the area.  It causes the sufferer to become","        feverish and fail to keep down food, but those who have","        adopted the Greek custom of mixing their water with wine have","        avoided the disease.  You remember this tip for the future.","        *set medicine +1","","Traveling further down the Nile, you come to a long barge similar to yours.","On the bridge is an Egyptian woman dressed in priest's robes and assorted","jewelry, bearing a staff with an ankh at the tip.  It is Nefertari,","*if serve_nefertari","    the pirate queen you have served these past several years by sending","    her scrolls.","*elseif nefertari_deal","    the pirate queen turned privateer for Alexandria.","*else","    the pirate queen you encountered on the way to Alexandria","    several years ago.","She is apparently taking some kind of pleasure cruise up the river.  Two Egyptians stand guard","on the deck of the ship with longbows.","","*if serve_nefertari","    You find yourself longing to speak with Nefertari","    *if nefertari_deal","        in person again.","    *else","        in person.","    After serving her in secret for so long, surely you deserve some kind of recognition.","*elseif nefertari_deal","    You suppose even the most diligent privateer deserves some rest now and then.","*else","    Nefertari appears relatively undefended—her barge appears to be for pleasure","    and not warfare—but it could be a trap.","","    \"Nefertari!\" Sosibius says.  \"We are not equipped for battle.  We should run.\"","","\"Who's that?\" Ptolemy IV asks.","","*if serve_nefertari","    \"A queen,\" you say softly.  You wonder whether it is wise to try to","    speak with Nefertari, with Sosibius and the prince nearby.  Either","    could decide to ruin you if they caught wind of your scroll theft.","    A word alone with Nefertari would be ideal, if you could figure out","    how to manage it.","*elseif nefertari_deal","    \"An ally of the Great Library,\" you say, eliding the more disreputable","    parts of Nefertari's story.  You wonder whether it is worth trying to get","    to know the privateer better.  She could no doubt turn on the prince","    quite suddenly if she thought there were more to gain from ransom than cooperation.","*else","    \"A pirate,\" you say, and you contemplate what lesson to teach young Ptolemy.","    Your ship has eight archers with longbows-perhaps that's enough to win","    a fight against Nefertari's ship.","","*choice","    *if ((not(serve_nefertari)) and (not(nefertari_deal))) #We should try to kill Nefertari while we have the chance.","        \"Open fire,\" you tell your ship's archers, and they rain arrows","        down on Nefertari.  One arrow catches her in the heart, and","        she slumps to the deck, dying.","        *set nefertari_dead true","        ","        More Egyptian fighters come out from belowdecks on her ship, ","        ten in all, and they begin firing arrows at your ship.","","        \"I told you we shouldn't get involved!\" Sosibius says, shielding","        his head from the rain of arrows.","","        From Egyptian mud dwellings near the river, more people come out","        equipped with bows, and they too begin firing on you.  Nefertari","        seems to be somewhat popular with the Egyptians.","        *set egypt_unrest %+20","","        Under the rain of arrows, you reluctantly order the ship to turn","        around, to head back toward Alexandria.  Nefertari is dead, but","        you have killed an Egyptian folk hero, and that makes Egypt dangerous","        for young Ptolemy.  It may yet cause problems in Alexandria as well.","        *finish Chapter 4: The Education of a Prince","    *if (serve_nefertari) #I will ask to come aboard, with the pretext of introducing the prince to Nefertari.","        *goto introducing_p4","    *if (serve_nefertari) #I invite Nefertari aboard our ship.  She should trust me.","        *gosub invite_nefertari","    *if (not(serve_nefertari)) #We should introduce young Ptolemy to Nefertari.","        *label introducing_p4","        \"Nefertari!\" you shout.  \"This is young Ptolemy IV.  He'd like to come aboard","        and meet you in person.\"","","        \"I would?\" Ptolemy IV says, frowning at you skeptically.","","        Nefertari turns and studies you for a moment.  \"I am honored.","        Please, come aboard.\"","","        *gosub sosibius_says_no","        ","        *if serve_nefertari","            *goto end_nefertari","        *choice","            #I go aboard Nefertari's ship with Ptolemy IV…and some guards.","                *temp nefertariLikes true","                You go aboard Nefertari's ship with Ptolemy IV and some guards.","                Sosibius also belatedly worms his way into the boarding party,","                perhaps because the majority of the guards are going.","","                Nefertari's two guards draw close to either side of her.","                She examines Ptolemy IV with a cool look.","","                \"So, you are the next ruler of Alexandria,\" Nefertari says.","                \"Let me explain, then, that I have crafted","                another kingdom on the open sea.  It is a kingdom where","                Egyptians and Greeks are equal.  A kingdom where","                the outcasts of your kingdom can find a place.  Some call me","                a pirate, but I see myself as defending my territory and","                exacting tribute.\"","","                *if petty < 50","                    Young Ptolemy looks to you for confirmation.","                    *choice","                        #I nod, confirming Nefertari's legitimacy.","                            You nod, and Ptolemy IV bows to Nefertari.","                            \"I am honored to meet you, Queen Nefertari.\"           ","                            Nefertari seems quite pleased with this reaction.","                            \"We will get along well, Prince Ptolemy.\"","                            *set egypt_unrest %-20","                        #I shake my head, denying Nefertari's legitimacy.","                            You shake your head, and Ptolemy IV says carefully,","                            \"I am pleased to meet you,\" without further","                            elaboration.","                        #I make no motion, leaving Ptolemy IV to decide.","                            Ptolemy IV says to Nefertari, \"I am pleased to meet","                            you,\" without confirming Nefertari's claim to","                            the seas.","","                *else","                    *set nefertariLikes false","                    Young Ptolemy looks to Sosibius, who shakes his head.","","                    Ptolemy turns back to Nefertari.  \"You're a liar, and","                    I don't have to listen to you.\"","                    *set egypt_unrest %+10","","                    *choice","                        #I quickly reprimand Ptolemy IV for his tone.","                            \"Ptolemy!\" you snap.  \"That's no way to talk to—\"","","                            \"A criminal?\" Ptolemy says.","","                            Sosibius barks a laugh, then covers his mouth.","","                            \"An important person,\" you say.","","                            \"You are ridiculous,\" Ptolemy IV says.","                            *set ptolemy_4_rel %-10","","                            Nefertari scowls.  \"I should have expected","                            as much from you, brat.\"","                            *set egypt_unrest %+10","                        #I agree with Ptolemy.  We don't cave for pirates.","                            \"You are no foreign ruler, Nefertari,\" you say.","                            \"Ptolemy here owes you no respect.\"","","                            \"You may yet regret that opinion,\" Nefertari says.","                            *set egypt_unrest %+10","                        #I hasten our party back to our own ship.","                            \"This has been interesting, but we really ought","                            to say goodbye now,\" you say.  \"Let's go.\"","","                            Sosibius agrees, and your boarding party quickly","                            returns to your own ship.","                            *goto endOfNefertari","","                Nefertari explains that in her travels to ","                the Egyptian towns south of Alexandria, she has spoken","                to Egyptians about how they feel about Greek rule.","                *if egypt_unrest > 50","                    \"They seem to be unhappy with Alexandria,\" Nefertari says.","                    \"They notice that their taxes flow to Alexandria only","                    to build Greek libraries and amenities for Greek ships.\"","                *else","                    \"To your kingdom's credit, the Egyptian people seem happy,\"","                    Nefertari says.  \"Alexandria is doing a good job of","                    honoring Egyptian culture.  For now.\"","","                \"Why should you care about the Egyptian towns at all?\" Sosibius","                says.  \"What's in it for you?\"","","                Nefertari waves this away.  \"I am merely a friend of the","                oppressed, and I try to help how I can.\"","                ","                You gather from the conversation that follows that","                Nefertari is very popular with Egyptians, who see her as","                a folk hero.  Moreover, her trip south is an attempt","                to further bolster her popularity, though you're not entirely","                sure to what end.  ","","                *label endOfNefertari","                At least Ptolemy has learned to be","                unafraid of talking to pirates and Egyptians.  You bid adieu","                to the pirate queen, having made a","                *if nefertariLikes","                    reasonably good","                *else","                    poor","                impression.","                *set egypt_unrest %-10","            #I go aboard Nefertari's ship with Ptolemy IV alone, to show I trust Nefertari.","                As your ship pulls alongside that of Nefertari, she","                watches you with curiosity.","","                You lower the gangplank, and you cross first.  Ptolemy IV","                looks at the gangplank and Nefertari uncertainly.","","                \"I am impressed that you accepted my offer,\" Nefertari says.","                ","                \"I thought the young prince might do well to speak","                with a talented leader such as yourself,\" you say.","                \"And perhaps you will benefit from the chance to","                impress young Ptolemy while he is young.  Your generous","                reception now might be repaid with royal favors much more ","                valuable down the line.\"","","                *if nefertari_deal","                    \"I am glad to see you too think the relationship","                    between our nations should blossom,\" Nefertari says.","                    \"Come, let me show you around.\"","","                    *gosub nefertari_belowdecks","","                *else","                    \"A talented leader such as myself?\" Nefertari says.  Though","                    her eyebrows are shaven, you have the impression nonetheless","                    of their being raised.  \"What exactly have you heard?\"","","                    *page_break","","                    *if (rhetoric >= 5)","                        You deliver up a flowery rendition of Nefertari's exploits","                        on the high seas, casting Nefertari as a hero","                        of the Egyptian people.  Your recitation of her exploits","                        borrows some poetic bits from Homer, but as you expect,","                        the Egyptian doesn't notice.  Ptolemy IV, intrigued,","                        creeps onto Nefertari's barge to better hear your tale.","","                        As you continue, you begin to notice that there are more","                        pirates on deck than it seemed at first.  Intrigued by","                        your story, Nefertari's pirates sneak glances at you from","                        various hiding places about the ship—from barrels, from","                        just behind the cabin door, from behind the mast.","                        You congratulate yourself—your skill at","                        rhetoric seems to have revealed an ambush.  But they","                        are not attacking for the moment.","","                        \"Well,\" Nefertari says when you have concluded, \"that is","                        quite a lot to have heard.\"  ","","                        \"Yes, we knew from the tales that despite your","                        fierce reputation, you were noble at heart, and would","                        meet Ptolemy with the kindness and forbearance you would","                        like him to later show the Egyptian people.\"","","                        Nefertari considers this last comment, seems to go","                        back and forth, and with an exasperated sigh, makes a","                        discreet flattening gesture to the concealed pirates that","                        cancels the ambush.","","                        \"Yes,\" she says.  \"I would indeed like young Ptolemy to show","                        the Egyptian people kindness when he is older.  Come along,","                        Ptolemy, and I will show you some of our treasures.\"","","                        *page_break","                        *gosub nefertari_belowdecks","                    *else","                        \"Well…\"  In truth, what you have heard about Nefertari","                        is unflattering, as it comes mostly from the Greek","                        merchants she has accosted, and you find yourself","                        lacking the skill in rhetoric that could make such tales","                        come across as heroic.  \"You know, good things.\"","","                        \"Hmm.\"  Nefertari turns to Ptolemy, still on your boat.","                        \"Are you coming, little one?\"","","                        *if ptolemy_3_rel < 50","                            Ptolemy shakes his head no, then runs belowdecks","                            on your own ship.","","                            \"Ah well, I suppose we have a less impressive","                            hostage,\" Nefertari says.  \"Take ${phim},","                            and full speed ahead!\"","","                            Pirates surge out of various hiding places around","                            the ship and surround you, brandishing khopesh swords.","                            You feel the barge move beneath you as the ship's","                            rowers put their backs into making some distance","                            from the prince's barge.  You're gratified to see","                            your own archers launch a hail of arrows at","                            Nefertari's ship, but that doesn't really help you","                            much.","","                            You finally return to Alexandria months later","                            after being ransomed for a fortune; you are strangely","                            gratified to learn how much you are worth, but","                            it doesn't endear you to Ptolemy III.  You tell","                            yourself it could have been worse; Ptolemy IV might","                            have followed you onto that ship.  But, the whole","                            incident probably only confirms his opinion that he","                            is right not to trust your judgment very much.","                            *set ptolemy_3_rel %-10","                            *set egypt_unrest %+5","                            *finish Chapter 4: The Education of a Prince","                        *else","                            Looking to you, young Ptolemy says, \"Okay.\"","                            The boy crosses the gangplank and joins you.","","                            \"Excellent.  Seize them, and full speed ahead!\"","","                            Pirates brandishing khopesh swords leap out of","                            hiding places around the barge and surround you and","                            the prince.  You feel the lurch of the barge moving","                            beneath you as Nefertari's crew put their backs","                            into rowing; the gangplank connecting the vessels","                            snaps.  A few guards from the prince's ship leap","                            to Nefertari's barge, but they are quickly mobbed","                            and cut down by the pirates.  A few volleys of arrows","                            rain on the rowers, striking a few, but pirates","                            take the place of the wounded and keep rowing.","                            Within a few minutes, the prince's archers have","                            ceased their attack, and it is over.","","                            You and the prince are kept in the brig for just","                            about two weeks.  During your imprisonment, the prince","                            shoots you angry looks from his corner of your cell","                            and lets you know repeatedly","                            that this is all your fault.  You overhear the","                            pirates plotting bigger, more daring attacks, emboldened","                            by this victory.","                            ","                            The ransom that frees you and the prince is a fortune.","                            *if evil","","                                Sadly, this was not the best way to win the prince's trust.","                            *else","                                But if there is one silver lining, as you thought to","                                yourself while Ptolemy IV wrinkled his nose at the","                                bread the Egyptians served him, it's that Ptolemy is","                                unlikely to take what he has for granted anymore.","","                            *set alexandria_strength -1","                            *set egypt_unrest %+20","                            *set ptolemy_4_rel %-30","                            *set petty %-15","","                            *finish Chapter 4: The Education of a Prince","            #I will try to convince Nefertari to come aboard our ship instead.","                *gosub invite_nefertari","","    #We should ignore them and continue down the river.","        You decide to","        *if (not(nefertari_deal))","            live and let live, and","        continue down the river, passing Nefertari's barge.","        *if (not(nefertari_deal))","            You warily eye Nefertari","            and her archers, and they eye you back, but ultimately you ","            pass her without further trouble.","    *if ((not(nefertari_deal)) and (not(serve_nefertari))) #We should turn back to avoid encountering Nefertari.","        You decide not to risk encountering Nefertari again.  You reluctantly","        order the ship to turn around.  Your curiosity is not worth risking","        the prince's capture, and you tell young Ptolemy IV so.","        He seems to appreciate your concern, while noting also that you did","        what Sosibius suggested.","        ","        \"I am so pleased you are growing up to be so wise,\" Sosibius","        tells the young prince as your barge begins to make its way back","        up the Nile.","        *set petty %+10","        *set ptolemy_4_rel %+10","        *finish Chapter 4: The Education of a Prince","*label end_nefertari","*page_break","","As you near Syene, you unhappily discover that Ptolemy IV is ill.","*if petty >= 55","    When he is not being sick over the side of the barge, he is ","    blaming everyone around him, claiming that he must have been","    poisoned.","*elseif petty >= 45","    The boy begins to get snappish in his sickness, demanding food and water","    of his slaves in a tone that is uncalled for.  But the third time he","    loses the food he just ate over the side of the boat, you can't","    help but feel a little sorry for him.","*else","    The feverish young man attempts to face his illness stoically, but","    you can tell he is feeling quite queasy.","","Should you abandon your goal of reaching Syene?","*label sick_3_choice","*choice","    #We must go back to Alexandria to provide the best care for young Ptolemy.","        Unhappily, you give up your goal of reaching Syene","        and turn the barge around.  Ptolemy doesn't thank you, but you","        know that Sosibius would make a fuss about your abandoning Ptolemy","        in his time of need, and you can't have that.  You reluctantly","        leave your great discovery for another day.","        *set ptolemy_4_rel %+10","        *finish Chapter 4: The Education of a Prince","    #Ptolemy can return to Alexandria with Sosibius while I continue on to Syene.","        You say your goodbyes to young Ptolemy and Sosibius,","        and continue on foot to Syene.  You worry that","        Sosibius may take this opportunity to ingratiate himself ever","        more with Ptolemy, but so be it.","        *set petty %+10","        *set ptolemy_4_rel %-10","    #I will ask the local Egyptians to care for Ptolemy, then come back to pick him up when the experiment is done.","        *set elitist %-10","        *if petty > 50","            *set egypt_unrest %+10","            Ptolemy screams bloody murder as you leave him with a local","            village, but the ","        *else","            *set egypt_unrest %-10","            Ptolemy is too sick to react much to the Egyptians, but when","            they say they can help him, he visibly brightens.  These","        local Egyptians have seen his malady before,","        and they know how to care for him.","        *if petty > 50","            That doesn't seem to matter much to Ptolemy, who screams loudly","            about his indignation at being left in the hands of a bunch of","            Egyptians.  You worry that he'll continue to harass his caretakers","            while in their care, but there's nothing to be done for it.","        *else","            At this news, Ptolemy seems relieved, and you hope that it","            may even do him some good to live with Egyptians for a little while.","        Sosibius volunteers to","        stay with Ptolemy as well, and soon the whole expedition has","        stopped.  But you continue on to Syene.","        *set petty %+10","        *set ptolemy_4_rel %-15","    *hide_reuse #I will try treating young Ptolemy myself.","        *if medicine >= 5","            You brew some potions from local plants that ","            reduce fever and quell upset stomachs.  Young Ptolemy appears","            to improve markedly after taking these potions, although he is","            still quite weak, and he spends much of the remainder of the","            trip in his cabin.","            *set ptolemy_4_rel %+5","        *else","            You try brewing some potions from local plants that ","            reduce fever and quell upset stomachs.  Unfortunately,","            your knowledge of the local plants is not quite up to the task,","            and your misidentification of one plant in particular causes","            your potions to turn out both nauseating and ineffectual.  You","            learn from your mistake, but young Ptolemy refuses any further","            treatment from you.","            ","            What will you try to do now?","            *set medicine +1","            *set ptolemy_4_rel %-15","            *goto sick_3_choice","            ","    ","The Egyptian slave is still pulling the hodometer for you.  You learn that ","his name is Luqwys, ","*if elitist < 50","    and you become friends, inasmuch as you can be.","*else","    and you decide to see whether he can understand your work.","You tell him that the purpose of the hodometer is to try to","learn the size of the Earth, a thing that has never been done before.","You explain how the device works, and Luqwys understands quickly.","","\"Huh!\" he says.  \"But the world is much bigger than Alexandria to","Syene.  How will you figure the size of the whole world?\"","","You go on to explain that Syene has a well that has no shadow on","the summer solstice, while the lighthouse in Alexandria has a large","shadow on that day, and this is because the world is round.","As you launch into a discussion of the trigonometry that allows","you to calculate the size of the Earth, Luqwys shakes his head.","\"Too much,","*if male","    sir,","*else","    madam,","though I thank you for trying.\"","","When you finally make it to Syene, a small Egyptian town far up the Nile,","you immediately launch into a rough calculation using the measurements","from the hodometer.  You can hardly believe the result.","","\"Well?\" Luqwys says.  \"How big is it?\"","","\"Immense,\" you say.  \"Two hundred fifty-two thousand stadia around.","There must be many, many things in this world of which we have no idea at all.\"","","\"I could have told you that,\" Luqwys says.","","\"Then you are a wise man, Luqwys.\"","*set invented_geography true","*achieve geographer","","*finish Chapter 4: The Education of a Prince","","","*label library_of_thoth","*achieve secret_library","","Nefertari leads you down a passageway to a closet.  Inside the closet","is a bookshelf crammed with scrolls.  You recognize most of the scrolls","as those you have provided.","","\"The Library of Thoth is an idea more than anything,\" Nefertari says.","\"If people think I have a Great Library of my own, it lends me strength.","It almost hardly matters if anyone reads the scrolls, although I appreciate","your scholarly materials, since waving them in skeptics' faces is much","more effective than showing off popular works.\"","","You try to hide your disappointment; you had imagined you were serving","a [i]library[/i], not sending scholarly works to die.  \"Am I to","simply keep sending you scrolls, then?  You have no greater plan for me?\"","","Nefertari waves her hands:  \"I did not say that at all!  My jewel, my dear,","you can serve a great purpose!  You can help cause","subtle disruption in Ptolemy's court, weakening it to","prepare the way for our revolution.  I'm sure a clever librarian like","you can find all kinds of ways to make the Ptolemies weaker.  The real","question is, how can I serve [i]you[/i], so that your kind service","is generously repaid?  I can make you Head Librarian when the revolution","comes,","*if head_librarian","    but of course you already are Head Librarian, so surely you must want","    more than that.\"","*else","    but I understand if you would like something more immediate.\"","*return","","","","*label nefertari_belowdecks","*achieve tour_boat","","You and Ptolemy go belowdecks with Nefertari, who does","her best to both entertain the young prince with ","shiny baubles and impress upon him her philosophy of","how to lead a mix of Greeks and Egyptians.  ","*if serve_nefertari","    You try to contain your excitement at being so","    close to Nefertari, after sending her scrolls for so long.","*else","    You are somewhat surprised to learn that Nefertari","    seems as fair and heroic among her pirates as you made her","    out to be in your tales.","","\"The important thing is that you must never lose sight","of what you are trying to build, which is greater than","any treasure,\" Nefertari tells Ptolemy, recovering a silver","chalice from the boy's hands.  \"I could bedeck myself","in jewels much more than I do.  But treasure is not","as valuable as the loyalty of the people following you.","Treasure is a means to an end.\"  To illustrate the point,","Nefertari calls over her first mate and offers him the","chalice as a bonus.  The man thanks Nefertari profusely,","and Ptolemy watches the scene with interest.","","*if (not(serve_nefertari))","    *if evil","        You part ways with the pirates, disappointed","        that Nefertari should be such a positive","        influence on the boy.  What kind of pirate is she?","    *else","        You part ways with the pirates, glad that you gave","        Ptolemy IV and Nefertari a chance to get to know each","        other.","","    *set egypt_unrest %-20","    *set petty %-10","    *set nefertari_rel %+20","*else","    \"Momus here can teach you how to win a knife fight,\"","    Nefertari tells the prince.  \"Would you like that?\"","","    \"Yeah,\" Ptolemy says, eyes wide.  Momus beckons, and","    Ptolemy follows him out the door of Nefertari's cabin.","","    *label alone_with_nefertari","    \"So we're alone,\" Nefertari says with a slight smile.","    \"You are my trusted ally in the Great Library, and","    yet I hardly know why.\"","","    *choice","        #\"I have loved you since I first saw you.\"","            Nefertari laughs lightly.  \"Love!  Of course.","            I'm glad you're not ashamed of the fact.","            It's as good a reason as anything.\"","            *set nefertari_rel %+ 10","        #\"The Greeks have mistreated Egyptians long enough.  It must end.\"","            Nefertari smiles.  \"A sympathizer.  Very unusual.","            But then, you are a most remarkable","            *if male","                man.\"","            *else","                woman.\"","            *set nefertari_rel %+ 15","        #\"I hardly know why, either.  Funny, isn't it?\"","            Nefertari frowns.  \"I suppose I must believe you're","            not a spy, because no spy of Ptolemy's could have","            as lazy an excuse as that.\"  She shrugs.  \"But","            I suppose you can have whatever reason you like,","            as long as you continue to aid me.\"","            *set nefertari_rel %- 5","","    \"I have heard rumors of your library,\" you say.","    \"The 'Library of Thoth.'  I assume it's this library that","    I've been providing scrolls for.  Do you want me to be its librarian?\"","","    Nefertari laughs lightly.  \"Do you want to see the Library","    of Thoth?  I suppose you deserve to.  Come right this way.\"","    *page_break","    *gosub library_of_thoth","    *comment Add this word because female MCs might otherwise think","    *comment we forgot their gender.","    *temp female \"female\"","    *if male","        *set female \"\"","","    *choice","        #I would like to be Nefertari's ${female} lover.","            Nefertari laughs.  \"All too easy!  I have thought you were beautiful","            since I first laid eyes on you.  Just be aware I have a","            *if male","                man","            *else","                woman","            in every port, as they say.\"  Then she grabs your chiton,","            pulls you close, and kisses you hard.","","            *set nefertari_lover true","            What ensues tumbles you into Nefertari's bedroom, and you hope","            that Ptolemy IV can't hear your and Nefertari's","            shouts and moans.  It is delightful and somewhat embarrassing","            at the same time, and Nefertari wickedly teases","            you about your inherent shyness.","            *set nefertari_rel %+ 25","","            When you are done, you quickly pull on your chiton and","            return to Ptolemy, who is swiping at the pirate Momus","            with a borrowed knife.","","            \"${name}, you missed all the fun!\" Ptolemy IV says.","","            \"No doubt,\" you say.  \"Come along, Ptolemy.  It was a pleasure","            getting to know you better, Nefertari.\"","","            \"Nice 'knowing' you as well,\" she says with a wink.  You look","            down, but Ptolemy IV is too sheltered for double entendres,","            so it seems everyone on this trip will leave happy.","            *set ptolemy_4_rel %+ 10","        #I would like to return the contents of the Library of Thoth to the Great Library.","            \"I will continue to serve you, but this 'Library of Thoth' must stop,\"","            you say.  \"You can continue to talk about it as if it exists, but","            I want our scrolls back.\"","","            Nefertari sniffs.  \"How unimaginative.  Do you really want only","            the thing in front of you?  But I suppose I can oblige.  You're","            right, it hardly matters whether it exists at all.\"","","            You return to your barge with Ptolemy IV and heaping handfuls of","            scrolls, and send Ptolemy's servants back to get the rest of them.","            *set alexandria_knowledge +2","            *set no_more_thoth true","","            \"Wow, Nefertari sure is generous,\" Ptolemy IV says.  \"She even","            let me keep the knife I was playing with.\"","","            You privately wonder to what end she hopes the knife will be put.","            Perhaps none at all.  Perhaps a knife is just a knife.","","        #I only ask to be paid well.","            \"Of course,\" Nefertari says.  \"My agents told me that you refused payment","            at first.  Had I known you had changed your mind…\"","","            \"Well, I have,\" you say.  \"I would like your standard rate, plus","            an advance for the good work I will do for you in Ptolemy's court.\"","","            \"Of course,\" Nefertari says.  \"I am generous with my allies.\"","            She grimaces.  \"On the one hand, it is easiest to pay you here.","            On the other, the prince will wonder why I am showering","            gifts on you while leaving him in the lurch.  Paying him an","            equal sum does not sit well with me.\"","","            \"Easy,\" you say.  \"The prince has no eye for value.  Let the prince","            and myself alternate picking gifts until you have paid me in full, but","            let me know ahead of time where the true value lies.  The prince","            will pick shiny but worthless baubles.\"","","            Nefertari smiles.  \"I do like you, librarian.  Let us follow your","            clever plan.\"","","            Indeed, soon you and Ptolemy are carrying armfuls of gifts back","            to your ship.  Ptolemy has the knife the sailor was letting him","            play with, a toy wooden horse, and a nice Senet set, while you","            walk away with some thousand-year-old Egyptian jewelry that,","            despite its fading paint, is worth more than","            all the money you would have made for the rest of your days","            at the Great Library.","","            \"She's really nice,\" Ptolemy IV says.","","            \"It is good to be her friend,\" you agree.","            *set ptolemy_4_rel %+ 10","            *set nefertari_rel %+ 10","","*page_break","*return","","","*label sosibius_says_no","\"Don't do it, it's a trap!\" Sosibius says.","*if nefertari_deal","    \"Privateer or no, that Egyptian is not to be trusted.\"","*if serve_nefertari","    But you are relatively certain that you, at least, will come to no","    harm on Nefertari's vessel.","","    \"You need not come aboard, Sosibius,\" you say.","","    \"I want to go on the pirate ship!\" says the prince.  \"Please?\"","","    \"It'll be your head if anything happens to the boy!\" Sosibius says","    grumpily.","","    \"We'll be careful,\" you say.","","    Indeed, Nefertari welcomes you aboard her vessel cordially, and","    you can tell from the faint glimmer in her eye that she knows","    exactly who you are and what you've been doing for her.","    *page_break","    *gosub nefertari_belowdecks","*return","","","*label nefertari_agrees_to_come_aboard","","\"Enough, enough, I'll come aboard with a few of my","men,\" Nefertari says.","","What do you really want from Nefertari?","","*choice","    #I only want Ptolemy IV to see that Egyptians should be treated well.","        When Nefertari comes aboard, you do exactly what","        you promised: you feed her the choicest delicacies","        and sweets, and tell her entertaining tales.  She","        pretends to be unmoved by your display of","        generosity, regarding everything with the same","        ironic smile, but you think she is genuinely","        enjoying herself aboard your vessel.  You allow","        even her bodyguards to partake of the delicacies,","        although they seem to prefer the sweets and to spit","        out the delicacies of a more refined palate.","","        You speak of nothing in particular while","        entertaining your guests, but you hope the message","        to Ptolemy is loud and clear.  Indeed, when","        you say goodbye to Nefertari and her bodyguards, Ptolemy","        shouts to their backs, \"You can come to my house","        in Alexandria anytime!\"","","        So, that went well.","","        *set egypt_unrest %-15","        *set nefertari_rel %+15","        *page_break","    *if ((not (nefertari_deal)) and (not(serve_nefertari))) #I want Nefertari in chains, as she says.","        Once Nefertari and her bodyguards board, you direct them","        belowdecks.  \"This way,\" you say, leading them","        into your trap.","","        When Ptolemy's royal guards attack, Nefertari and ","        her pirates put up a good fight, and they take down ","        five warriors before they are captured themselves.","    ","        \"I trusted you!\" Nefertari shouts at you as she","        is led away to the brig.  You shrug.  It's not","        the first time you've been duplicitous for a good","        cause.","","        When your barge pulls away from Nefertari's barge,","        her pirates realize something has happened, and","        they begin to leap aboard your vessel.  With a","        sinking feeling, you realize that her ship is","        faster than yours and there is no getting away","        from all her pirates.  Luckily, Ptolemy's royal","        guards are well trained, and they have the advantage","        of defending their own ship.  They kill fifteen","        pirates before the attackers give up and flee.","","        Nefertari is unlikely to survive her judgment","        at the hands of Ptolemy III when you return","        to Alexandria, but you think it only proper that","        she stand trial for her crimes.  You hope you","        have saved Alexandria some grief by capturing","        this dangerous woman.","","        *set nefertari_rel %-10","        *set nefertari_dead true","        *set egypt_unrest %+10","        *page_break","","    #I want Nefertari to go to bed with me.","        Once Nefertari and her bodyguards come aboard, you ply them all","        with as much good beer and wine as you can, hoping","        it may loosen Nefertari's inhibitions.  Ptolemy","        whines that he wants beer as well, until","        Sosibius finally takes him off your hands.","        ","        *if serve_nefertari","            Once Ptolemy and Sosibius are gone,","            Nefertari says, \"For years you send me scrolls stolen from","            the Great Library, and now you invite me aboard","            your vessel.  Do I interpret that look in your eye","            correctly?\"","","            \"That depends,\" you say.  \"Do you find me attractive?\"","","            One of Nefertari's pirates overhears, and men","            and women alike give a raucous \"Ooooooh!\" ","","            \"In fact, I do,\" Nefertari says coolly.  She gives","            her pirates a supercilious but fond look.  \"You may leave us.\"","","            What then transpires in your cabin is ecstatic, athletic,","            and exhausting.","            *set nefertari_lover true","            *set nefertari_rel %+ 20","","            *page_break","            \"Well, that was fun,\" Nefertari says as she gets dressed","            in her priest-like robe again, \"but I still don't quite","            understand all these favors from you.  What do you want from me?\"","","            Puzzled, you say, \"That was it.\"","","            In the middle of putting on a giant gold earring,","            Nefertari looks at you incredulously for a moment, then laughs.","            \"That was it.  Oh, librarian, what sort of sheltered life do you","            lead, that you think you must shower someone with gifts for years","            before sharing a passionate moment together!  Do you not understand","            that I enjoyed that too?\"  She finishes putting on her earrings","            and checks her work in a hand mirror.","","            \"I suppose you sounded pleased,\" you admit.","","            Nefertari kisses you enthusiastically.  \"You are utterly refreshing.","            From now on, whenever you deliver a scroll, my agent will give you the","            location of my barge.  You should visit often.\"","","            You promise to.","","            You get dressed just in time to hear Sosibius and Ptolemy return,","            loudly debating the merits of different oysters.  You bid adieu","            to Nefertari, who returns to her ship.  Sosibius makes a sign of","            protection against evil as she leaves.","            *set petty %+ 5","        *else","            With Ptolemy gone, you attempt to impress","            Nefertari by telling her stories of your own","            exploits.  Nefertari and the pirates appear to enjoy","            the libations and the stories,","            but after her pirates finish their third round of beers,","            Nefertari cuts short the visit.","","            \"I believe we should be going now,\" she says.","            \"Thank you so much for your hospitality.\"","","            \"Wait,\" you say.  \"Are you sure you don't want","            to stay longer with me?  I want to know you better.","            Much better.\"","","            Nefertari gives you a searching look, then","            laughs.  \"I don't know what kinds of conquests","            you are accustomed to,\" she says.  \"But","            you seem to think that simply because I","            am a woman, I am ready to be bedded.  You","            are a fool.  You may as well proposition","            Ptolemy III for all the good it will do you.","            Good day.\"","","            \"Wait,\" you say, but it is too late, and you","            begin to realize the truth of what she said.","            Why did you think you could seduce the pirate","            captain when you knew so little about her?  ","            You hope that she remembers your","            hospitality in the future, at least, and not just your","            foolishness.","","            *set nefertari_rel %-10","            *set petty %+5","            *set egypt_unrest %-5","            *page_break","    *if (serve_nefertari) #I only want to find out where the scrolls I send her are going.","        Nefertari comes aboard.  At first, you ply her","        with delicacies and sweetmeats and chat about little","        of consequence.  Sosibius glumly makes polite","        conversation as well.  You and Nefertari each try to catch","        the other's eye repeatedly, but you can't get alone together.","        Finally, while Sosibius is distracted by teaching Ptolemy IV how","        to properly eat an oyster, Nefertari murmurs, \"What do you","        want of me anyway, librarian?\"","","        \"I only want to know where the scrolls I give you go,\" you say.","        \"Is it true you have a private library, called the 'Library of Thoth'?\"","","        Nefertari smirks.","        \"You can see my great library if you come aboard my vessel.\"","","        Nefertari announces to Sosibius and Ptolemy that you are going aboard","        her vessel to see her library.  Ptolemy is bored at the thought,","        and Sosibius hopes you die.  So you manage to slip away from them,","        go to Nefertari's ship, and head belowdecks.","","        *gosub library_of_thoth","        *comment she just asked us what we want, and all the previous","        *comment options involved Ptolemy in the results.  We also","        *comment already declined a romantic interest, so let's keep this","        *comment simple.  We know this char is concerned about the scrolls.","","        \"All I want is for these scrolls to be put to better use,\"","        you say in frustration.  \"I had thought I was educating Egyptians,","        not simply helping you create a myth.\"","","        Nefertari, to her credit, looks abashed.  \"You are right, scholar.","        At first, education had been my dream in collecting the scrolls.  But","        then it began to seem impossible that I would ever have a worthy","        collection, and the Egyptians I sought to help had little interest","        in the scrolls.  I gave up.  I should not have.  I stand","        chastised.\"","        *set nefertari_rel %+ 20","","        Nefertari promises to share the knowledge of the Library of Thoth","        better, and you promise to do what you can to help her in the","        future.  You return to your vessel with high hopes that you can","        be a positive influence on Nefertari.","*return","","*label invite_nefertari","\"Why don't you come aboard our vessel instead?\" you say.","\"All the delicacies the prince and Sosibius brought aboard","are yours for the tasting.\"","","\"Hey,\" says Sosibius, offended.","","*if serve_nefertari","    \"Are you certain you wouldn't like to come over here?\"","    Nefertari says.  \"I have some scrolls you might be very","    interested in, librarian.\"","    ","    \"I want to see a pirate ship!\" Ptolemy IV says.","","    Would you like to go to Nefertari's ship instead?  She and Ptolemy seem","    to think you should.","    *choice","        #Very well, Ptolemy and I will go over to Nefertari's ship.","            *gosub sosibius_says_no","        #No, I'd prefer it if Nefertari came over here.","            \"Please, I insist,\" you shout to Nefertari.  \"Come aboard our","            vessel.\"","            *gosub nefertari_agrees_to_come_aboard","","*elseif ((rhetoric >= 6) or nefertari_deal)","","    *if nefertari_deal","        \"I may ally with Ptolemy now, but the king is a fickle master,\"","        Nefertari says.  \"The moment Ptolemy sees me as a threat,","        mark my words, he will try to have me killed, no matter","        how excellent my deliveries to your library.\"","    *else","        \"And how do I know you won't simply clap me in irons?\"","        Nefertari says skeptically.","","    \"That would be poor treatment for a hero such as yourself,\"","    you say, and you give a somewhat exaggerated account of","    Nefertari's exploits on the high seas, leaning on your","    Rhetoric skill to turn mangled tales of thievery into","    epic adventures.","","    *gosub nefertari_agrees_to_come_aboard","","*else","    \"We have some lovely sweetmeats, and, ah…\"  Nefertari's","    look of withering disdain cuts short your appeal.","    \"It's nice over here.\"","","    \"No thank you, scholar,\" Nefertari says.  \"I see we","    are at an impasse, as neither trusts the other.  But I","    appreciate your offer, and I hope you appreciate mine.\"","","    \"Indeed.\"  You sail on past the barge, hoping that","    your offer achieved some modicum of respect from the","    pirate queen.","","    *set egypt_unrest %-5","    *set nefertari_rel %+10","*return",""], "labels":{"introducing_p4":300,"endofnefertari":411,"end_nefertari":593,"sick_3_choice":611,"library_of_thoth":719,"nefertari_belowdecks":753,"alone_with_nefertari":799,"sosibius_says_no":931,"nefertari_agrees_to_come_aboard":956,"invite_nefertari":1160}}