{"crc":211673043, "lines":["*comment ————Chapter 2—————","","*image chap2.png center Chapter Two: The Price of Progress","","*temp euclidDoomed false","","A few days later, an old woman who goes by the name Euclid (\"Glorious\")","shows you around the Great Library.  The main hall reminds you of a temple,","albeit one with three-story-tall bookshelves.","In the center of the room, columns made of red marble, an Egyptian novelty, stretch to the ceiling.  Between these columns rest long tables where scholars sit","reading scrolls and taking notes.  The library must have a dedicated cleaning staff; you notice","the black marble floor is so highly polished that you can see your own face in it.","The ladders that allow access to the high levels of books look a bit daunting;","you hope you won't have to climb any yourself.","","\"Here we come to my favorite section, Mathematics,\" Euclid says, gesturing to one of","the tall bookshelves.  She points to some papyrus scrolls with her cane.  \"These are","all the children I have.  The [i]Elements[/i].\"","","\"You're the famous Euclid?\" you say, surprised.  You had heard of the old mathematician's","work as far east as Cyrene.  Archimedes often spoke highly of Euclid.  But no one ever","mentioned she was a woman.  Perhaps everyone was embarrassed to champion a woman's work?","","\"'Famous' may overstate the case,\" Euclid says, raising a bushy gray eyebrow.","\"But I suppose I've taught quite a few students now at the Musaeum,","so at least they know who I am.\"  ","","\"Doesn't King Ptolemy also consult you for advice?\" you say.","","Euclid shrugs.  \"Sure, and the mathematicians of Alexandria, too.  ","But that's not fame: that's enough people for an [i]episkyros[/i] team.\"","","*gosub sosibiusThreatensEuclid","*if euclidDoomed","    *gosub earlyDeathOfEuclid","    ","    With Euclid dead, you inherit some of her responsibilities at the","    library.  A nearly blind old man who had been friends with Euclid introduces","    you to some of the collections she curated.","","    \"These were hers, the 'stolen scrolls,'\" the old man says, gesturing","    to a tall bookshelf full of scrolls.  \"This was one thing Ptolemy never","    listened to her about.  Ptolemy borrowed these from other libraries,","    with no intention of returning them.","    Euclid wanted him to return the scrolls to the libraries","    they were borrowed from, and he wanted her to just shelve them like anything","    else.  So they sat here, trapped between those implacable forces.\"","","    Uncertain what to make of this, you request an audience with Ptolemy to","    discuss the scrolls.","    *gosub bookPolicy","","    *goto after_books","","Euclid continues the tour of the Great Library, and you come to a large cubbyhole piled with close to ","a hundred scrolls.  On each, in red ink, is a brief note:  \"FROM THE LIBRARIES.\"","","\"These must be the infamous stolen scrolls of Alexandria,\" you say.  \"Borrowed and","never returned, before the other libraries caught on to Ptolemy's gambit.","I wonder what fines Ptolemy III has racked up.\"","","\"I understand he has paid for the scrolls,\" Euclid says wryly.  \"The other libraries just","weren't previously aware they were for sale.\"  She shrugs.  \"You will come to learn","that, while Ptolemy is quite devoted to Alexandria, he is not above pushing down outsiders to","get ahead.  As much as I might frown on it, I wonder if that is the price of progress.\"","","*temp talkToPtolemy false","*gosub bookReaction","","*if talkToPtolemy","    *gosub bookPolicy","","*label after_books","","*temp atLeastSomeCare false","*gosub ptolemyBorn","","*page_break","","*set year 242","*if primary_caretaker = \"you\"","    Over the next few years, ","    you become well acquainted with Ptolemy IV's room in the palace, filled with","    many toys that are replenished as fast as he can break them.","    Young Ptolemy is an unruly child, but you think","    *if evil","        the prince is taking a liking to you nonetheless.","        *set petty %+ 10","        *set ptolemy_4_rel %+ 15","    *else","        some of your lessons about proper behavior are slowly sinking in.","        *set petty %-15","","    Ptolemy also seems to genuinely like you, thanks to all this time you spend with him,","    and that makes your job somewhat easier.","    *set ptolemy_4_rel %+20","*elseif atLeastSomeCare","    Over the next few years, you spend some time as Ptolemy IV's guardian,","    alternating with your duties as a librarian.","    You become well acquainted with his room in the palace, filled with","    many toys that are replenished as fast as he can break them.  Ptolemy IV is an unruly ","    child, and he doesn't seem to be learning good manners from Sosibius—often, he","    greets you by lobbing a wooden soldier or block at your head.  He seems unused","    to being told \"no,\" but you hope your time now will help prepare him for tutoring","    later.","    *if (not(evil))","        *set petty %-10","*else","    Over the next few years, unencumbered by any responsibility for","    Ptolemy IV, you continue to rise in the ranks at the library,","    eventually achieving the post of Head Librarian.","    *set head_librarian true","    *achieve head_librarian","    *if primary_caretaker = \"Berenice\"","        *set petty %+5","    *else","        *set petty %+15","    *if (petty > 50)","        You hear rumors that Ptolemy IV is turning out to be quite a spoiled hellion,","        and you are grateful he is someone else's problem.","","*if egypt_unrest > 50","    Roughly once a year, there is a riot in the Egyptian quarter—it seems the Egyptians","    are not especially happy with Greek rule.  Greek soldiers put the riots down","    forcefully every time.","","*page_break","*gosub serapeum","*page_break","","*gosub caretakingChoice","","One day, as part of Ptolemy IV's education in natural philosophy,","you take him to the Lighthouse of Alexandria.  You stop at the second ","observation balcony, which is so high up that the tourists below on the","first balcony look like ants.","*if invented_optics","    You have brought your light-focusing mirror assembly, and you demonstrate","    for Ptolemy its ability to set pieces of wood down at ground level","    on fire.  Ptolemy is delighted.","    *set ptolemy_4_rel %+ 5","    But your primary lesson for Ptolemy IV today is","    not exactly about optics.  You redirect his attention to the","    ships on the horizon.","*else","    Together, you watch ships disappear over the horizon.","","\"See, even from up here, the ships disappear eventually,\" you say.  \"This","is how we know the world is round.\"","","\"That is nonsense,\" Ptolemy IV says.  \"The world is flat.  Any fool can","see it.\"","","\"Ah, but the curve is slight, and the world is very big,\" you say, and","suddenly, looking down at the shadow the lighthouse casts over Alexandria,","you have an idea.  By measuring that shadow, and comparing it with another","at the same time of day elsewhere, you could calculate the size of the Earth.","In fact, there is said to be a well in the town of Syene to the south where","there is no shadow on the summer solstice, making the calculation simpler.","You would only need to measure the distance to the well.","","\"Ptolemy, how would you like to take a trip down the Nile to survey your empire?\"","","*finish Chapter 3: A Trip Down the Nile","","","*comment ————Euclid————","","*label sosibiusThreatensEuclid","\"Ah, there you are, Euclid,\" says Sosibius, surprising the two of you.","\"I need to have a word with you.\"  The gaunt man is dressed in a","chiton dyed in rich indigo, appropriate for a fine banquet.","","\"The Serapeum is the public branch of the library,\" Euclid says coldly.","\"This building is for scholars, not parasites.  How did you get in?\"","","\"I am simply a man who naturally commands respect,\" Sosibius says,","leaning on a bookshelf in a way that crumples the scrolls.","\"I find that particularly in this outfit, I can go where I please.","Now tell me: why did you badmouth me to King Ptolemy after my audience with him","yesterday?  You know how much Ptolemy values your opinion.  What was in that","for you?\"","","\"I speak the truth to Ptolemy, as I did to his father, and his father before","him,\" Euclid says.  \"And the truth is that you are a worthless human being.\"","","\"Oh, quite the contrary,\" Sosibius says.  \"I am a man of means, favored by the","gods.  And let me explain the import of all that.  A man of means can often make","good things happen for his friends.  Would you like some rare scrolls?","I can make that happen.  But I am also favored by the gods.  And that means","that bad things often happen to those who stand in my way.\"  He raises his","eyes to the heavens in mock piety.  \"Oh, it is a curse to see so many people","laid low, when they did not know what forces they dealt with!\"","","You look around to see whether any other librarians are within earshot,","but these mathematical scrolls are in an isolated alcove of the library.","The three of you are alone.","","*choice","    #I tell Sosibius to leave, and I encourage Euclid to tell Ptolemy about these threats.","        *gosub trial_end","        *set euclidDoomed true","        \"Get out of here, Sosibius,\" you say.  \"No one here is interested","        in what you have to say.\"","","        \"Precisely,\" Euclid affirms.","","        A look of rage passes briefly over Sosibius's face, but he masks","        it quickly with his usual blithe demeanor.  \"Suit yourself,\" he","        says, and he strides out of the library.","","        \"You must tell Ptolemy about this,\" you say to Euclid.","        \"A man like that must not be allowed near the prince.\"","","        Euclid nods.  \"Indeed.  Come with me, so you can vouch for my","        testimony.\"","        *comment Later reduce petty, kill Euclid","        *page_break","        *return","","    #I try to placate Sosibius, then I encourage Euclid to avoid needlessly provoking him.","        *gosub trial_end","        \"You can't threaten me,\" Euclid says to Sosibius.  \"I will speak","        my mind until the day I die, and nothing you do can change that.\"","","        \"All right then,\" Sosibius says.  He raises his hands in the air.","        \"Your fate is in the hands of the gods.\"","","        \"Sosibius, leave her alone,\" you say.  \"From what I've heard,","        Euclid sees fault in everyone.  Do you think you're going to be","        an exception?  Surely Ptolemy takes her complaints with a grain of","        salt.\"","","        \"Excuse me?\" Euclid says, now angry.","        ","        Sosibius laughs.  \"True enough!  Of course, I should have thought","        of that angle.  Perhaps I've nothing to fear from Euclid, if everyone","        just ignores the old bat.\"  He","        wags his finger at her.  \"But you've done nothing to improve your","        standing with me, either.  Pray the Fates do not find a use for you","        in their weave.\"  He nods to both of you.  \"Good day, librarians.\"","        With a flourish, he leaves the mathematics section.","","        \"You undermined me!\" Euclid says.","","        \"That man was threatening to kill you,\" you say.  \"I think","        he would, too.  I may have made you","        look bad to Sosibius, but I also think I saved your life.\"","","        Euclid sighs.  \"Perhaps you are right.  I try not to care what","        people think of me; that's what a good Stoic ought to do.  I am","        a mathematician, not a politician, and the mathematics will be","        best served if I don't get into petty arguments.\"","","        *page_break","        *return","","    #I tell Sosibius that I, at least, am interested in his favors.","        *gosub trial_end","        You signal for Sosibius to follow you into a corner, which he does.","        He seems tantalized by the prospect of sharing a secret.","","        \"I cannot exactly speak for Euclid,\" you murmur, \"but I, at least,","        am a very practical person.  I would be happy to recommend you","        to the king and queen, for whatever my recommendation is worth,","        if you could procure something for me.\"","","        \"Of course, of course,\" Sosibius says.  \"What would you like?\"","        *choice","            #Some well-made tools for my workshop.","                *set techne +1","            #Some cadavers that have died of specific diseases.","                *set medicine +2","            #His recommendation to Ptolemy III and Berenice, in turn.","                *set berenice_rel %+ 10","                *set ptolemy_3_rel %+ 10","","        \"It will be done, for certain,\" Sosibius murmurs.  (You find out later,","        shortly after you write your letters of support to the king and queen,","        that Sosibius is as good as his word.)","        *set petty %+ 10","","        When you break from your huddle, Euclid is scowling at you.","","        \"Well, what about you?\" Sosibius says to Euclid.  \"Would you","        like to make a deal?\"","","        \"Get out of my library,\" Euclid says.","","        \"It's a bad time, I see,\" Sosibius says.  \"Well, discuss it with","        your friend, ${name}.  Perhaps","        *if male","            he","        *else","            she","        will help you see reason.\"  He bows with a flourish, and leaves.","","        You answer Euclid's dubious look with:  \"I got him out of our hair,","        didn't I?  He went away happy, when a moment ago he was making","        threats.\"","","        \"I am not interested in dealing with devils,\" Euclid says flatly.","","        \"Then you should be glad I did it for you,\" you say.","","        Euclid sighs.  \"I suppose.  Come, let us finish this tour.\"","        *page_break","","        *return","","*comment ————-Library Policies————","","*label bookReaction","*choice","    #\"So long as it improves the library, I'm happy.\"","        Euclid sighs.  \"So you're on Ptolemy's side.  Well, I can hardly blame you.\"","","        \"We must not be afraid to use any and all methods to advance the library,\" you say.","        ","        In the weeks that follow, more books come in from other libraries, borrowed and never","        to be returned, and you quietly file them with the others.  You are happy to note","        that some of these include interesting tracts on poisons and their antidotes.","        ","        *set medicine +1","        *set petty %+ 5","        *set idealist %-10","        *return","    #\"I will copy the scrolls myself, so that the owners can get back the originals.\"","        Euclid's bushy gray eyebrows rise.  \"I am impressed that you would devote","        so much of your own time to this cause.\"","","        *if techne >= 5","            \"It will not be so tedious as you might think,\" you say.  \"I have an idea","            for a machine to make the work lighter.","            I can imagine a machine that duplicates the motion of a pen with a","            second pen nearby.  All I would need to do","            is trace the original, which seems much less laborious than looking back and forth.\"","","            \"Clever,\" Euclid says, impressed.","","            *gosub scrollcopier","","        *else","            \"It will be worth it,\" you say.","","            You devote the evenings of your first several months at the library to copying the","            stolen scrolls by hand.  You find that the act of meticulously getting the wording","            right has you thinking quite a bit about language, and your thinking about rhetoric","            improves as a result.","            *set idealist %+ 20","            *set rhetoric +1","","        *return","    #\"I think I should have a talk with Ptolemy about this.\"","        *set talkToPtolemy true","        Euclid smiles.  \"I knew I liked you.  I wish you luck.\"","","        *return","","*label bookPolicy","*page_break","","Ptolemy grants your wish for an audience, and you soon find yourself back in the throne room.","Your footsteps echo in the large chamber as you approach Ptolemy III on his throne.","It occurs to you that the throne room is rather Spartan and empty compared to how opulent it could be;","besides the golden thrones, there is very little decoration in the room.  Ptolemy is a pragmatic man.","","\"You said you had some concern about the books from other libraries?\" Ptolemy says.","\"I hope you don't presume to judge my ethics, but have some more practical concern.\"","","*choice","    #\"We need to set an example: not just in knowledge, but goodness.  We must return the books.\"","        \"Goodness, hmm?\" Ptolemy III says, sounding amused.  \"Tell me what is so good about","        goodness.\"","        ","        *if rhetoric >= 4","            You do tell him, citing well-spoken philosophers and orators from","            the past several centuries.  You have the advantage that most philosophers","            love goodness, from the Stoics to Plato—there is very little controversy there.","","            \"Enough,\" Ptolemy says.  \"I see","            that in the long term, Alexandria will seem stronger if we also act with virtue.","            We will return the books.\"","            *set ptolemy_3_rel %+10","","            You smile in satisfaction.  \"You won't regret it, I'm sure.\"","","            In the near term, the library's holdings are inarguably diminished.","            But you think your argument may have longer-lasting impact on","            Ptolemy's policies, as well as his philosophy in raising his son.","            *set idealist %+10","            *if alexandria_knowledge > 0","                *set alexandria_knowledge -1","            *set petty %-15","            *set egypt_unrest %-10","        *else","            *set idealist %+10","            Caught off guard, you stammer, \"Well, of course goodness is good.  It can't","            be otherwise…\"","","            Ptolemy III shakes his head.  \"Alexander showed that a ruler needs to be","            aggressive and take what he can.  I'm sorry, Librarian, but the needs of","            Alexandria come first.\"","","            You walk away from the meeting feeling embarrassed—Ptolemy III must","            now think you're naive.  You remind yourself to brush up on your Rhetoric","            skills when you have a chance.","            *page_break","","        *return","    #\"We should at least pay for the books, instead of simply stealing them.\"","        \"That is exactly what I am doing,\" Ptolemy says.  \"When I get missives","        with fines for the lost books, I pay them.  They may not think of my acquisition","        a purchase, but I do.\"  Ptolemy looks slightly annoyed.  \"Now, did you","        have any real business with me?\"","        *set ptolemy_3_rel %-5","","        You save face by reporting on some other recent acquisitions, embarrassed to","        find that Ptolemy wasn't as underhanded as you had thought.","        *set idealist %+ 10","    ","        *return","    #\"We should go further, and begin confiscating books from ships in port and copying them ourselves.\"","        *set idealist %-10","        \"Brilliant,\" Ptolemy III says.  \"I like it.\"","        *set alexandria_knowledge +1","","        \"It will take time to copy all of those books, but it will be worth it.\"","","        \"But we must keep the originals,\" Ptolemy says.  \"The power","        of the knowledge may be diluted in the copies.\"","","        You hesitate to correct Ptolemy.  Many people who can't read or write","        ascribe magical power to scrolls and books, and even some learned people","        feel the same way.  Including Ptolemy, it seems.  ","        *fake_choice","            #\"I agree.\"","                Ptolemy III smiles.  \"It shall be so.\"","                *set idealist %-10","            #\"As you wish.\"","                Ptolemy III smiles.  \"Indeed.\"","                *set ptolemy_3_rel %+10","            #\"I think it would be more proper to return the originals.\"","                \"What is proper?\" Ptolemy III says.  \"What I will, that is proper.\"","","                *if rhetoric >= 4","                    \"But a wise ruler knows that his subjects will imitate his behavior,\"","                    you say, and the two of you have a brief exchange about the matter before","                    Ptolemy waves the problem away.","","                    \"Very well, they shall keep the originals,\" he says.","                    *set idealist %+10","","                    You congratulate yourself on your victory for propriety.","                *else","                    You find yourself unable to muster an argument against this,","                    and Ptolemy's will is carried out.","                    ","            #\"The power is in what is written, not the object itself.\"","                *set idealist %-5","                \"Oh, no, I think there you are wrong,\" Ptolemy III says.  \"Whatever","                many people believe has power, has power.  I am not being","                superstitious when I say that to have the originals in the library","                would be more powerful, as people around the world stand in awe","                of our collection.\"","","        Soon, all ships in Alexandria are being searched for books while in port. As more and more books are","        confiscated, the library quickly begins to grow.  You find your","        days consumed with copying scrolls, and more and more, you see that the scrolls you","        organize in the library have been marked \"FROM THE SHIPS.\"","","        *if techne >= 5","            As you copy scroll after scroll, you begin to wonder whether","            there might not be a better way.  Gears and rods can","            transfer motion from one place to another—might not","            they be able to convey the movements of a","            scribe's pen to a second nearby","            pen?","","            *gosub scrollcopier","","        *return","    *if (not(nefertari_deal)) #\"We should reach out to the pirate queen Nefertari and hire her as a book privateer.\"","        Ptolemy III laughs.  \"Brilliant!  Why not set that pirate to work for us?","        I will send out some scouts to contact her.\"","        *set idealist %-20","        *set petty %+20","","        Through shady channels you know better than to learn too much about,","        Ptolemy makes a deal with Nefertari.  Soon, rare books from all manner of vessels","        are being plundered for the Great Library.","        *set nefertari_deal true","        How do you feel when you see these works appear in the library?","        *fake_choice","            #Quite satisfied.","                You enjoy the thrill of feeling a rare stolen work in your hands.","            #A bit nervous.  Surely someone will begin to notice.","                You feel a bit of anxiety every time you catalogue one of these","                stolen works, but nothing seems to come of it.","            #Regretful.  I was being sarcastic when I suggested this plan.","                Ptolemy apparently has no shame when it comes to expanding the library","                using any means necessary.  You thought he would take the hint.","","        Regardless, the library's collection begins to grow at a very quick rate.","        *set alexandria_knowledge +2","            ","        *return","","","*label ptolemyBorn","*set ptolemy_4_born true","After a few months' time, Ptolemy IV is born to Berenice.  Many of the librarians","copy scrolls as gifts to the young heir, optimistic that he will one day read them.","","What is your gift to baby Ptolemy IV?","*temp gift \"gift\"","*choice","    #A book of poems by Aeschylus.","        *set gift \"book of poems\"","        You hope that one day, the young heir will see the value of beautiful","        language and art.","        *set ptolemy_4_rel %+10","    #A book of Stoic philosophy.","        *set gift \"book of philosophy\"","        The Stoics advise that a person seek virtue and pay no heed to ","        wealth and the opinions of others—wise words, which you hope young Ptolemy will","        one day read and take to heart.","        *set petty %-10","    #Senet, an Egyptian board game.","        *set gift \"board game\"","        You purchase a small Egyptian board game from an Egyptian merchant, ","        optimistic that by playing with at least one Egyptian toy, Ptolemy IV","        might learn to respect Egyptian culture.  For a few coins more, you","        get a lesson from the merchant on how to play.  The game","        seems to involve throwing sticks that act as dice and moving around a board until the","        afterlife is reached.  There isn't much to it, and you feel confident that","        you will be able to teach young Ptolemy the rules at an early age.","        *set egypt_unrest %-10","        *set ptolemy_4_rel %+5","","In the throne room, you wait in a long line of scholars, merchants, and priests,","all of whom present gifts to Berenice.  Tiny Ptolemy IV is swaddled on her lap.","","\"He's a bit young for this, but here you are,\" you say, presenting the ${gift}","to Berenice.","","\"It's good to see you, ${nickname},\" Berenice says.","","\"I assume my tutoring isn't needed quite yet,\" you say.","*if euclidDoomed","    \"Do you need any other assistance with the prince?\"","","    \"No,\" Berenice says.  \"Thanks to Euclid's warning, I will be taking","    care of Ptolemy.\"","","    *set primary_caretaker \"Berenice\"","","    \"You must value Euclid's opinion highly,\" you say.","","    Berenice scowls.  \"You must be thinking of my husband, who commanded me to","    do this because of Euclid's warning.  I personally never","    cared for the woman.  She criticized me for","    competing in the Olympics and never let me forget my various","    sins.  When she and I disagreed, my husband always took her side","    because his grandfather did the same.\"","","    Ptolemy IV, sensing Berenice's displeasure, begins to wail.","","    \"Suffice it to say, I'm somewhat relieved Euclid is gone,\"","    Berenice says loudly over the prince's wail.  \"Add that to my","    sins if you like.\"  Surprisingly, no one in line looks affronted.","    \"Now, if you please, there are many more people in line.\"","    *return","*else","","    \"No, he has a caretaker,\" Berenice says, pointing.","","    You follow Berenice's gesture and see Sosibius chatting with several","    wealthy-looking men who have left the line.  Everyone in","    the small crowd, including Sosibius, wears chitons with colorful, exotic dyes: indigo,","    sky blue, vermilion.  Sosibius laughs at something one of the merchants says, and","    it sounds forced.","","    \"I see his ambitions are moving right along,\" you say.","","    \"I don't see you volunteering to take care of young Ptolemy,\" Berenice says.","    \"Though, to be fair, I have little interest in the dirtier business myself.","    I have other business to attend to—taxes and petitioners and construction projects","    call my attention.\" ","","    *choice","        #\"You're right, of course.  Sosibius is welcome to take care of the child.\"","            Berenice nods.  \"I thought so.  He comes from a good family, and has","            the recommendations of several upstanding people in court.  It all should be","            fine.\"","        #\"I think you should spend more time with the child, not Sosibius.\"","            *if berenice_rel >= 55","                Berenice sighs.  \"If I didn't trust you, I would say you should","                learn your place.  But because it's you, I will take what you say","                under consideration.\"","","                \"Influence on a young mind is its own kind of power,\" you say.","                \"Consider that.\"","                *set primary_caretaker \"Berenice\"","","                You leave the throne room confident that you have convinced","                Berenice to take a more active role in young Ptolemy's upbringing.","            *else","                Berenice's look turns cold.  \"You need to learn your place, scholar.","                I have more important things to do than change diapers.\"","","                You apologize and leave the throne room embarrassed.","                It was probably foolish to attempt to lecture a monarch on","                the use of her time.","        #\"If you will let me, I can take care of the child instead.\"","            \"That would require giving up your scholarly ambitions at the library,\"","            Berenice says.  \"Are you certain?\"","            *choice","                #\"Yes, raising Ptolemy IV right is more important than my scholarship.\"","                    *if berenice_rel >= 50","                        *set primary_caretaker \"you\"","                        *set atLeastSomeCare true","                        \"Very well,\" Berenice says.  \"I suppose entrusting Ptolemy to you","                        instead of Sosibius might give him a head start in his education.","                        I will inform Sosibius that his services won't be necessary.\"","","                        *gosub careOfPtolemy","                ","                    *else","                        *gosub bereniceSaysNo","                #\"No, I simply meant I could take care of the child sometimes.\"","                    *if berenice_rel >= 50","                        Berenice considers your offer, then nods.  \"Very well, I will have you","                        and Sosibius both take care of my son.\"","                        *set atLeastSomeCare true","","                        *gosub careOfPtolemy","                    *else","                        *gosub bereniceSaysNo","                #\"On second thought, Sosibius can take care of the child after all.\"","                    Berenice nods.  \"That's what I thought.\"","","                    You leave just as Sosibius forces another annoying laugh, and you","                    wonder a little that the man should be so eager to deal with","                    a fussy baby.","    *return","","*label careOfPtolemy","You begin from that point forward to","*if not(primary_caretaker = \"you\")","    sometimes","take care of young Ptolemy IV: changing diapers, feeding him,","and most of all, trying to get him to stop crying and","screaming.  He is a fussy, fussy baby, but you bond with him","regardless.","*return","","*label bereniceSaysNo","Berenice considers your offer, then shakes her head.  \"I'm","sorry, but I simply don't trust you with my son.  I hardly","know you.  Sosibius, at least, comes with recommendations from","upstanding people of the city.  I'm sorry.\"","*return","","","*label serapeum","","One day, Ptolemy III summons you to the throne room to discuss the Serapeum, the lending","branch of the Great Library that doubles as a temple to a god named Serapis.  \"The high priest of the Serapeum has lost faith in Serapis,\" Ptolemy says.  \"I need you to deal with him somehow.\"","","\"Why must our library be a temple at all?\" you say.","","\"My grandfather invented Serapis to bring the Egyptian and Greek people together,\" Ptolemy III says.","\"When people come to get books from the library, they see Serapis.","They are reminded that there is a god who watches over both peoples and wants their unity.\"","","\"But you're saying that's a lie,\" you say dubiously.","","\"A lie that I hope lasts for centuries,\" Ptolemy III genially agrees.  \"So what will you do about this reluctant priest?\"","","*choice","    #I will go convince the priest that the fake god Serapis exists.","        *gosub serapeumDescription","        *gosub priestDescription","","        You beckon the priest to lean in close.","        \"I hear you have lost your way,\" you say to the priest under your breath.","","        \"I have heard the rumor that Serapis is an invention of the Ptolemies,\" the priest","        says.  \"And now, I can't unhear it.  Where is the evidence for his existence?","        Why did nobody know of this god until recently?\"","","        *if rhetoric < 4","            \"But what evidence do you have that he doesn't exist?\" you say.","            \"Perhaps this is just a test of your faith.\"","","            \"One could say the same thing about any invented god,\" the priest says.","            \"I'm sorry, I've lost my faith.\"","","            You find yourself unable to convince the priest of the existence of Serapis.","","            \"I appreciate the effort,\" Ptolemy III says, back in the throne room.  \"I suppose","            we'll have to do this the blunt way.  Go back to him and tell him that","            if he does not develop some faith fast, we shall hasten him to his","            ultimate enlightenment with an execution.\"","","            You reluctantly convey this message to the priest of Serapis, who scowls","            but promises to comply.","            *set ptolemy_3_rel %+5","            *set egypt_unrest %+10","        *else","            \"What evidence do we have that any of the gods exist?\" you say.  \"The gods","            make themselves known through portents in our everyday lives.  If you mean","            to say that you have felt the influence of none of the gods at all, then","            I question your sanity.  Do you really think not one of the gods exists?","            And if you have felt the influence of other gods, but not Serapis, then perhaps","            it's because your faith in Serapis is wavering, and he will show himself again","            when the time is right.\"","","            The priest nods.  \"You're right—it would be too strange to think not one of the","            gods exists.  And if I believe in one, I may as well believe in them all.\"","","            You report back to Ptolemy that the priest regained his faith in Serapis,","            and Ptolemy is pleased with you.","","            *set ptolemy_3_rel %+ 10","            *set serapis_believed true","            *set egypt_unrest %- 10","","        *return","    *selectable_if (techne >= 7) #I will install some doors at the Serapeum that seem to open by themselves, amazing the credulous. (Requires Techne: 7)","        *gosub serapeumDescription","        ","        It is a building that inspires wonder, but you think it would","        inspire still more wonder if the doors were to open by themselves.","","        Of course, nothing moves by itself, so you need to decide what would actually","        provide the motive power for the doors.  A simple pulley of some kind, pulled","        surreptitiously, seems too obvious; people would look for sleight of hand,","        and the trick would be given away too soon.  You decide to go with fire, which","        has an air of holy magic to it already and is unexpected.  Some may open doors with ","        ropes, but who opens doors with fire?  Fire could make something expand…but","        it would need to expand quite a bit to push the doors.  Hydrargyrum, perhaps: the","        metal of Mercury, beloved of alchemists.  Hydrargyrum could expand into a bucket and ","        weigh it down enough to pull a rope that, with the help of a pulley, could haul open the door.  You nod to yourself,","        pleased that between your invention and divine intervention, the divine explanation","        will seem simpler.","","        With the blessing of Ptolemy, you engage in a construction project underneath the","        doors.  When you are finished, the effect works as follows: lighting a fire","        on an altar next to the doors heats a metal globe beneath the altar, which causes the","        hydrargyrum inside it to expand through a siphon into a bucket, which pulls on a","        system of pulleys, which opens the doors.  When the fire goes out, the liquid metal is","        sucked the other way through the siphon, and the doors close.  With the operation","        of the device hidden in a chamber beneath the doors, the effect will be indistinguishable","        from a miracle.","","        *page_break","        *set invented_auto_doors true","        *achieve auto_doors","","        And indeed, when construction is finished, many people come to the Serapeum","        to marvel at the doors.  Of those, perhaps half bother to actually go inside,","        but many of those are delighted to learn that they can freely borrow scrolls","        of popular works and classics from the Serapeum.  Watching the public leave the","        library-temple with armfuls of scrolls, you realize that in your convoluted way,","        you have increased knowledge in the city.  You feel quite satisfied.","        *set alexandria_knowledge +1","        *set egypt_unrest %- 5","","        The priest, who necessarily knew of your construction efforts, becomes","        more despondent, since it is obvious to him your miracles are mere trickery.","        *if rhetoric >= 4","            But you tell him that it is only by the will of the gods","            that the world is orderly and beautiful enough for your invention to be possible,","            and that cheers him up a bit.","            *set egypt_unrest %- 5","        *else","            But Ptolemy is happy with your efforts, and he allows the priest to stay.","","        *return","    #I will go convince the priest to pretend Serapis exists.","        *gosub serapeumDescription","","        *gosub priestDescription","        \"Can I help you?\"  The priest seems somewhat nervous.","","        You beckon the priest closer.  \"People have begun to notice your lack of faith,\"","        you whisper.  \"I suggest you make a better show of it.\"","","        \"But this god is a lie,\" the priest whispers.  \"I was a priest of Osiris before this.","        He made sense to me.  Whoever heard of a new god?\"","","        \"Like the city, Serapis is part Greek and part Egyptian, and that is","        something new,\" you say.  \"Think of Serapis as a desire for peace in the city.","        Surely you can believe in that.\"","","        After a moment, the priest nods.  \"I see.  You are right; I can believe in that.\"","        *set rhetoric +1","        ","        When you return to Ptolemy, he is delighted to hear that you have convinced the priest","        to see reason.","        *set ptolemy_3_rel %+10","","        *return","    #I will go confide in the priest that Serapis is a lie, and see whether he confides in me in turn.","        *gosub serapeumDescription","","        *gosub priestDescription","        \"Can I help you?\"","","        \"Did you know,\" you confide in a low voice, \"that Serapis was invented by","        Ptolemy's grandfather?  The god doesn't exist.\"","        *set egypt_unrest %+10","","        \"I thought as much,\" the priest grumbles.  \"Whoever heard of a new god?","        It's hubris, and Ptolemy may one day see his hubris come back to bite him.\"","","        \"Are there those who oppose Ptolemy, then?\" you ask.","","        \"They are not very organized,\" the priest says.  \"I think Nefertari is their","        leader if anyone","        *if nefertari_deal","            is.\"","","            \"Nefertari?\" you say.  \"But she works for Ptolemy.  She's stealing","            scrolls for the Great Library.\"","","            The priest looks amused.  \"What she tells her followers is that the","            great Ptolemy and Berenice recognize her as an equal, and that someday soon,","            her empire of the sea will rival Alexandria.\"","","            You suppose this news is not entirely surprising.","        *else","            is.  But","            *if egypt_unrest < 50","                there is very little resistance.  We Egyptians are mostly accepting","                of Greek rule at the moment.\"","            *else","                it would take worse leadership than Ptolemy's to lead to rebellion.","                Most Egyptians would admit that Ptolemy is an effective leader.\"","","        \"So what will you do now that you know that your god is a lie?\"","        you say.  \"Will you leave and join the resistance?\"","","        The priest snorts.  \"Nonsense.  I am too old to be a revolutionary.","        My talents lie in shelving scrolls and filling out logbooks.\"","        He looks thoughtful for a moment.  \"But if [i]you[/i] were interested","        in helping the cause, you could bring them scrolls from the Great Library.","        I think they would like that very much.\"","","        \"Those are mostly academic,\" you say.  \"Why would they want those?\"","","        *set priest_talked_about_thoth true","        \"Nefertari wants to rival Alexandria,\" he says.  \"One can't credibly","        rival Alexandria without a Great Library:  the 'Library of Thoth,'","        I've heard her library called, though somewhat in jest.  I think it's probably","        just a bookshelf on her ship.\"","","        \"Do you plan to bring scrolls to her from the Serapeum?\" you ask.","","        \"No,\" the priest says, but he doesn't say it very firmly.  ","","        *choice","            #I try to find out whom I could contact to begin helping Nefertari, then do so.","                That's a somewhat odd thing to do, given your position in the Great Library.","                Why do you want to help Nefertari?","                *temp why_help","                *choice","                    #I think I'm in love with her.","                        *set nefertari_rel %+ 10","                        Ah, love.","                        *set why_help \"Nefertari\"","                    #I just hate to see the Egyptians so downtrodden.","                        *set egypt_unrest %+ 5","                        *set idealist %+ 10","                        *set elitist %- 10","                        It's true, they do not have easy lives in Alexandria.","                        *set why_help \"the Egyptian people\"","                    #I don't know; I'm just a whimsical person.","                        *set idealist %+ 10","                        *set elitist %+ 10","                        Sometimes you just want to see what happens, right?","                        *set why_help \"fun\"","","                You get a location and a time from the priest.  \"Stay out of trouble,\"","                you warn him.","","                \"You too.\"  He's grinning as he waves goodbye.","                ","                Just after sundown, you go to a gymnasium in the Egyptian quarter and","                deliver your first parcel of scrolls.  The man who takes them is wearing","                a heavy cloak, hood drawn, over a Greek chiton.  He begins to hand","                over some silver pieces in exchange, but you wave them away.  \"I'm doing this for","                ${why_help},\" you say.","","                The mysterious man shrugs and stalks off with the scrolls.","                ","                Over the years you will deliver many scrolls to Nefertari.  You wonder if","                she will ever take notice.","                *set alexandria_knowledge -2","                *set nefertari_rel %+ 20","                *set egypt_unrest %+ 15","                *set serve_nefertari true","","            #I try to find Nefertari's contact, then tell the king about the contact and the priest.","                \"If I were interested in helping the cause,\" you say, \"have you heard","                whom I might get in touch with?\"","","                \"I may have overheard a loyal worshipper spreading some rumors,\" the priest","                says, and he gives you the name of a gymnasium and a time.","","                But when the time arrives, it is not you who is waiting there, but Ptolemy's","                royal guard, who capture Nefertari's man and hold him for questioning.","                The priest of the Serapeum is held, too.","","                The contact can be linked to several big heists around the city, ","                and after his interrogation, he is executed with little fanfare.  But nothing","                sticks to the priest, who really has done nothing wrong.  (Yet.)","                But perhaps you've at least scared some elements of this resistance;","                and Ptolemy, pleased with the contact's capture, takes to calling you","                \"my clever librarian.\"","                *set nefertari_rel %- 20","                *set egypt_unrest %- 10","                *set ptolemy_3_rel %+ 10","","            #I should stay out of all this.","                \"Just don't do anything foolish,\" you warn the priest.","","                The priest shrugs and smiles.  \"Goodness, no, I'll just do the","                smart thing and worship this inanimate hunk of stone.\"  He gestures","                to the statue of Serapis.","","                You shrug: he has a point.  \"Goodbye, then.\"","","                You report to Ptolemy that he has nothing to fear from the priest,","                omitting mention of Nefertari and the resistance.  Ptolemy takes","                your word at face value, and there the matter rests.","","        *return","","*label serapeumDescription","The Serapeum, a beautiful new marble building, stands on a hill in the","western part of the Greek district.  Huge bronze double doors","lead into the temple.","","On entering, you are impressed with the giant statue of Serapis","that dominates the main hall.","A basket balanced on the god's head is covered with gold leaf.","The obsidian statue of Cerberus at the god's feet reminds Egyptians and Greeks alike that this","is a god of the underworld.","","To the left and right, beyond the tall marble columns, tiny cubbyholes hold scrolls from","floor to ceiling.  A few Greeks and Egyptians on ladders sift through these scrolls,","looking for the books they want.","","*return","","","*label priestDescription","","The priest is an Egyptian man, his head shaven and his eyes dark with kohl.","*return","","","*label caretakingChoice","*set year 241","Soon enough, Ptolemy IV celebrates his fourth birthday, and you are expected","to begin tutoring him in earnest.  What subject will you prioritize?","*if primary_caretaker = \"you\"","    When he was younger, you read him poems to help him drift off to","    sleep; perhaps he still likes them.","*else","    You know he likes poetry.","*choice","    #Mathematics, to hone his intelligence.","        You find Ptolemy is not a very good pupil when it comes to mathematics.","        He struggles with even basic addition.  Even worse, he comes to dislike you","        a little for trying to foist mathematics upon him, shrieking when you bring","        out your chalk and string.  Still, being forced to endure anything he doesn't","        like is probably good for the child.","        *set petty %-10","        *set ptolemy_4_rel %-10","    #Ethics, the most important subject for a ruler.","        *if petty >= 50","            You try to teach young Ptolemy how to be good, but it is an uphill struggle.","            The child seems naturally selfish and unconcerned with anyone else's well-being.","            Still, you think some of what you say sinks in.","        *else","            The child is a diligent pupil, and he seems surprisingly willing to tackle","            the ethical challenges you pose to him.  You hope your instruction","            will serve the young master well when he takes the throne.","        *set petty %-5","    #Poetry, since he seems to have a liking for it.","        You find young Ptolemy does enjoy poetry, and he comes","        to look forward","        *if primary_caretaker = \"you\"","            to poetry time every day.","        *else","            to your visits.","        He even tries to make up his own four-year-old","        poems, which you humor.","        *set ptolemy_4_rel %+ 10","        *set petty %+ 5","","A month into your tutelage of Ptolemy IV, you get a letter from your friend, Archimedes.","*if euclid_dead","    He writes that he was saddened to learn of the loss of Euclid,","    and that he would like to pay his respects at her tomb.","*else","    He's coming to Alexandria for a week, and he would like to visit both","    you and Euclid, whom he has always admired.","","*if primary_caretaker=\"you\"","    But your volunteering to be the primary caregiver for the prince has limited","    your options for Archimedes's visit.","*else","    If you tried, you could probably get ${primary_caretaker}","    to take care of young Ptolemy for a week so that you could collaborate with","    Archimedes.  Even in only a week, you two may invent something truly interesting.","","*choice","    #I'm afraid I must give priority to young Ptolemy IV and see Archimedes only briefly.","        You write back to Archimedes expressing regret that your duties are to young","        Ptolemy now, and that you will try to see your friend if you can.","        ","        You do see Archimedes some evenings during the week that he visits.  His beard has","        become more tousled and unruly since the last time you saw him, and he still","        has his head in the clouds more often than not.  The two of you drink wine","        together, and he has interesting ideas about light that you wish you had","        more time to work on.  Soon enough, he says goodbye, and your friend is once","        again sailing west across the sea.","","    *if (not(primary_caretaker=\"you\")) #Archimedes and I will make a great discovery if we work together.  $!{primary_caretaker} can take care of young Ptolemy.","        You give up your tutoring duties for the week, putting Ptolemy entirely in the","        care of ${primary_caretaker}.","        *if primary_caretaker = \"Sosibius\"","            *set petty %+10","        *else","            *set petty %+5","","        *set arch_rel %+15","        When you see your friend at the docks, you run up to him and give him a great","        bear hug.  Archimedes looks a bit bedraggled—hair unkempt,","        great beard untrimmed—but he always has.  He smiles to see you.","        \"You're looking well, ${nickname}!","        Is your mind open for business?  I have been thinking about…these.\"","        He pulls some colored shards of broken glass from his traveler's pouch.","","        The next few days are a delightful blur as you and Archimedes walk the city,","        discussing light.  Archimedes has been playing with shards of curved glass,","        noticing the patterns that play out on the ground below, and you make a game of who","        can make the brightest patch of light.  From such experiments, you work out the","        equations for the angle at which light travels through the glass.  You go on","        to play with mirrors and diffuse surfaces, and work out equations for these, too.","","        *comment gosub archRomance here, but let's cut this - Archimedes","        *comment romance feels weird","        ","        Finally, the two of you decide to create a truly","        huge mirror for focusing light powerfully enough to burn wood.  Your first plan is to use a large parabolic mirror for the purpose, but you","        both quickly come to the conclusion that this would be among your more impractical","        inventions; there would be only one focal distance at which the light could burn.","        It's you who suggests instead a kind of adjustable mirror made of many small","        mirrors.  If the hinged arms connecting the mirrors to a central rod were adjusted, the parabola","        of the assembly of mirrors could be made larger or smaller, and the light could be","        made to burn things near or far.  Archimedes finds the idea very agreeable, as","        using many small surfaces to approximate a large curve is something he has worked","        out the mathematics for already, and you both eagerly head off to find supplies.","        *page_break","        ","        The two of you scour Alexandria for all the hand mirrors you can","        purchase—Archimedes is surprisingly wealthy, perhaps because he only spends","        money on things like this.  Then you spend the next several days hunkered down in a Musaeum","        workshop.  In this environment, Archimedes sheds his dreamy absentmindedness;","        he is all business when it comes to measuring angles and hammering","        brass.  It is arduous, time-consuming work, and you worry that Archimedes will have","        to leave for Syracuse before it is done.  When you finally finish it, on the last","        day of Archimedes's visit, the mirror assemblage stands","        twice as tall as you.  With the control rod jutting out the back,","        it is as long as a horse.","","        To test your assembly of mirrors, the two of you carry it all the","        way across Alexandria, up the long promontory known as the heptastadion to the","        lighthouse, then up the long, steep ramps inside to the large first balcony of the","        structure, where tourists mill about and admire the view.  They show a little curiosity","        toward your contraption, but not","        as much as you think they should; perhaps Alexandrians are used to crazy scholars.","        An enterprising merchant on the balcony is selling wooden replicas of the lighthouse; you purchase","        one, run it all the way down to ground level and leave it there, then run back up again.","        Panting, you aim the mirror assemblage at the miniature lighthouse and focus the beam","        with your control rod.","        ","        For a few moments, nothing happens.  Then the knickknack bursts into flame.","","        You and Archimedes laugh with glee to see the power of your mirror, and the lighthouse","        tourists burst into applause.","        *set invented_optics true","        *page_break","        *achieve optics","","        \"Too bad I can't bring this back to King Hiero,\" Archimedes says.  \"He always","        likes it when I can find some practical application for my fancies.\"","","        \"It may one day prove useful for Alexandria's defense,\" you say.  \"If it does,","        I'll let you know.\"","","        You finally bid Archimedes farewell on the seventh day, glad you took","        the time to see him.","","    #Archimedes could help me tutor young Ptolemy.","        On his arrival at the docks, you greet Archimedes with a great bear hug, and then","        inform him that he will help tutor young Ptolemy.  \"I had hoped to talk to","        you about the mysteries of light, but very well,\" Archimedes says.","","        Young Ptolemy is scared of Archimedes at first—his giant","        beard, his somewhat unfresh smell—and Archimedes needs to go take a bath before","        Ptolemy stops screaming.  But once you get down to business, Archimedes is an","        apt tutor, using Ptolemy's toys to illustrate physical principles.","        Ptolemy learns a valuable lesson in not judging people by appearances.","        *set petty %-10","","        *comment archRomance was here, but feels weird—cut","","        Archimedes bids you adieu at the end of the week looking a bit tired from his","        time with Ptolemy.  He may think twice about coming back, you realize.","        But at least Alexandria's future is on the right track.","        *set arch_rel %-10","","*return","","","*label scrollcopier","","Over the course of weeks, you develop your invention, starting","with a prototype that attaches a central brass rod to two flexible","brass arms that are connected below the joints by another brass bar, which","keeps the pens underneath moving in tandem.","*if (not(euclid_dead))","    Euclid drops in and offers occasional advice on how the invention might","    be made more elegant, taking advantage of similar angles between","    the parallel lines of rods.","You affix an inkwell in the same place","on both sides so that both pens can be dipped simultaneously.","","Finally, you test your invention by copying the stolen","scrolls.  Your first few copies are sloppy, so you tighten your","machine in places and lubricate it in others.  Through a series of","iterative improvements, your copies eventually become quite good.","Thanks to your invention,","you copy all the stolen scrolls in just a few days, and you send the","originals via courier back to their masters.","","When word of your invention gets out among the scholars at the Great Library,","you are celebrated and taken out to the most delicious restaurants in Alexandria.  ","The ability to easily make their","own copies of their favorite works from the library","is a dream come true for them.  Members of the engineering faculty of","the Musaeum make copies of your invention for the Musaeum and","library, and these devices are soon in constant use by all the","scholars.","","You have succeeded in making yourself very popular in a short time!","","*page_break","*achieve copier","","*set invented_copier true","*set idealist %+ 10","","*return","","*label earlyDeathOfEuclid","You and Euclid go to the palace.  When Euclid explains the situation","to one of Ptolemy's guards outside the throne room, the guard leaves,","then returns a bit later to ask Euclid to testify, alone.  Euclid enters","the throne room.","","Euclid emerges a little while later and signals that you should enter","the throne room without her.","","Ptolemy III and Berenice sit on their thrones, looking","unhappy.  To your relief, Sosibius is not there.","*set petty %- 15","","Knowing that Euclid would have told them the exact truth, you relate the","events exactly as they happened.  When you are done, Ptolemy III frowns","in Berenice's direction.","","\"So that's what Sosibius said,\" Berenice says, frowning.","","\"Indeed,\" Ptolemy III says.  \"And the question is, in what [i]way[/i] did","he say all that?  Was he relating a genuine belief that he is favored by the","gods, or was he threatening Euclid?\"","","\"It was obviously a threat,\" you say.  \"Both Euclid and I agree.\"","","Ptolemy III sighs.  \"If you and Euclid wished to increase our suspicion of","Sosibius, you have succeeded.\"","","\"He will not be taking care of our child when he is born,\" Berenice says.","She looks to Ptolemy III for confirmation.","","Ptolemy III nods.  \"But we can't banish him from court just for this,\" he","says.  \"He will remain on, and we may forgive him in time.  He has done","us much service already.  Perhaps you and Euclid read a threat where there","was none.  Perhaps he threatened, but did not intend to carry it out.  I do","not see in his words alone sufficient cause to punish him.  But we will","be wary.\"","","It is the best you can do, you suppose.","","The next day, when you see Euclid at the library, you convey what the king","and queen said to you.","","\"They told me that as well,\" Euclid says sadly.  \"Their verdict does not do","much to protect me.\"  She shrugs.  \"But I am old, and an old mathematician","is not much use to anyone.  So perhaps this was the wisest course of action","after all.\"","","\"Don't say such things,\" you tell her, but you have a bad feeling about this.","*page_break","","When Euclid does not come into the library the next day, you fear the worst.","You ask around and try to find out where she lives.","","When you do find the house, a small, humble abode in the middle of the oldest","part of the Greek quarter, the servant at the door turns you away, telling you that Euclid does","not want to see you.  You ask what the matter is, and why Euclid","did not come to the library.  The servant insists that Euclid does not want","to see you.","","Disheartened, you return to work.","*page_break","","*set euclid_dead true","*set euclid_died_early true","In a few days, Euclid is dead.","","The coroner proclaims that the cause","was simple old age, and this assessment would seem entirely believable to anyone but","you, because you were there when Sosibius threatened her.  Even you aren't","entirely sure, though.  Euclid was old.  This coroner seems to have found","nothing amiss.","","*if (not(evil))","    It will continue to bother you for a long time.","*page_break","*gosub euclidFuneral","","*return","","","*label euclidFuneral","Euclid's funerary rites are a simple, quiet affair in her home,","attended by all fifteen mathematicians in Alexandria.  Their awe","of her is palpable.","","Euclid's procession to the necropolis west of the city begins at dawn.","At first, it is just you and the fifteen mathematicians.","No one in the city particularly takes note","until Ptolemy III joins the rear of the procession with an honor guard.","","\"Even my grandfather was in awe of her,\" Ptolemy III says to you.","\"Surely she deserves my respect as well.\"","","Thereafter, the procession draws curious looks from commoners and","merchants on the street, all puzzled at what kind of scholar could get","the great king to attend the procession.","When you reach the necropolis, Ptolemy III departs, and once again","it is only the mathematicians, two of whom carry Euclid's body into","the tomb.  The others silently contemplate their loss.","*page_break","*return","","","*label trial_end","*check_purchase adfree","*if choice_purchased_adfree or not(choice_purchase_supported)","  *label purchased","  *return","Remember earlier how we told you that the first chapter is available for free? This is the end of the free content.","","[i]To find out what happens next, please purchase the remaining chapters.[/i]","","*purchase_discount adfree 2019-07-09 $2.99 $1.99 purchased","*abort",""], "labels":{"after_books":72,"sosibiusthreatenseuclid":168,"bookreaction":312,"bookpolicy":359,"ptolemyborn":509,"careofptolemy":647,"berenicesaysno":657,"serapeum":665,"serapeumdescription":941,"priestdescription":959,"caretakingchoice":965,"scrollcopier":1132,"earlydeathofeuclid":1172,"euclidfuneral":1253,"trial_end":1276,"purchased":1279}}