{"crc":1107405354, "lines":["screenshots!","*page_break","*set year 242","*set ptolemy_4_born true","*set techne 10","*set medicine 1","*set rhetoric 1","*set name \"Eratosthenes\"","*set nickname \"Beta\"","*set idealist 63","*set petty 53","*set ptolemy_4_rel 40","*set berenice_rel 59","*set arch_rel 60","*set invented_copier true","One day, Ptolemy III summons you to the throne room to discuss the Serapeum, the lending","branch of the Great Library that doubles as a temple to a god named Serapis.  \"The high priest of the Serapeum has lost faith in Serapis,\" Ptolemy says.  \"I need you to deal with him somehow.\"","","\"Why must our library be a temple at all?\" you say.","","\"My grandfather invented Serapis to bring the Egyptian and Greek people together,\" Ptolemy III says.","\"When people come to get books from the library, they will see Serapis.","They will be reminded that there is a god that watches over both peoples and wants their unity.\"","","\"But you're saying that's a lie,\" you say dubiously.","","\"A lie that I hope lasts for centuries,\" Ptolemy III agrees genially.  \"So what will you do about this reluctant priest?\"","","*fake_choice","    #I will go convince the priest that the fake god Serapis exists.","    *selectable_if (techne >= 3) #I will install some doors at the Serapeum that seem to open by themselves, amazing the credulous. (Requires Techne: 8)","    #I will go convince the priest to pretend Serapis exists.","    #I will go confide in the priest that Serapis is a lie, and see whether he confides in me in turn.","","*set name \"Penelope\"","*set nickname \"Eris\"","*set year 232","*set techne 8","*set medicine 2","*set rhetoric 1","*set idealist 64","*set elitist 40","*set alexandria_knowledge 6","*set egypt_unrest 64","*set petty 52","*set ptolemy_4_rel 44","*set ptolemy_3_rel 45","*set berenice_rel 63","*set arch_rel 62","*set nefertari_dead true","*set invented_auto_doors true","*set invented_optics true","*set invented_copier false","*set invented_geography false","*set pet \"none\"","*set pet_name \"your pet\"","","\"Which brings me to my question to you, O wise tutor of my eldest son.\" Berenice gestures expansively to Alexandria, across the lake. \"The city knows I killed Demetrius.  My son does not. We have managed to keep him ignorant of this fact about me, partly by keeping him from his peers. No doubt every thirteen-year-old boy in Alexandria would love to inform my boy about my past in the most insulting way possible. So instead, we keep him in the company of those who know better than to tell him such things, such as you and Sosibius.\"","","You blink for a moment, trying to consider the ramifications of this conspiracy to keep Ptolemy in the company of people who would not tell him the truth. \"And you want to know whether it's time to let young Ptolemy know about your past.\"","","Berenice grins. \"Precisely. I knew you were a sharp one, librarian.\"","*fake_choice","    #\"Yes, you should let him know your husband died because of his lechery.\"","    #\"Yes, you should let him know that even great heroines must sometimes take actions others deplore.\"","    #\"No, don't tell him now. I can write your story for him to read later.\"","","*set name \"Hypatia\"","*set nickname \"Sophist\"","*set year 226","*set techne 8","*set medicine 2","*set rhetoric 4","*set idealist 46","*set elitist 73","*set alexandria_strength 2","*set alexandria_knowledge 5","*set egypt_unrest 56","*set petty 57","*set ptolemy_4_rel 63","*set ptolemy_3_rel 51","*set berenice_rel 59","*set arch_rel 66","*set nefertari_dead true","*set invented_optics true","*set invented_geography false","*set invented_auto_doors false","*set pet \"peacock\"","*set pet_name \"Hera\"","","\"You can't die,\" Berenice says to Ptolemy. She brings his hand to her mouth for a kiss. \"I thought you were supposed to be a god—isn't that what we told the people?\"","","\"Even Alexander died, my dear,\" Ptolemy says.  \"I may have claimed to","be a god, but I never claimed to be a better man than he.\"  He then notices","your arrival for the first time.  \"Librarian!  I'm glad you've come.\"","","\"You must help him,\" Berenice says.  \"To see him so frail…it's","unnatural.  Something is very wrong.\"","","\"Do you suspect poison, my dear?\" Ptolemy says.","","\"You have many enemies,\" Berenice says.","","\"Tell me, ${name}, do you think this is poison?\" Ptolemy asks.","*fake_choice","    #I tell him I think he was poisoned by Sosibius, then attempt to cure him.","    #I tell him I think his son poisoned him, then attempt to cure him.","    #I do not venture an accusation, but I do try to cure Ptolemy III's poisoning.","    #I say nothing and do not cure him, for I have made a deal with the poisoner.","","","*set name \"Heron\"","*set year 226","*set nickname \"Prometheus\"","*set techne 10","*set medicine 2","*set rhetoric 6","*set idealist 58","*set elitist 63","*set alexandria_strength 1","*set alexandria_knowledge 6","*set egypt_unrest 46","*set petty 76","*set ptolemy_4_rel 73","*set ptolemy_3_dead true","*set berenice_dead true","*set nefertari_dead false","*set arch_rel 57","*set nefertari_rel 57","*set invented_copier true","*set invented_auto_doors true","*set invented_optics true","*set invented_fire_engine true","*set invented_robo_arch true","*set pet \"monkey\"","*set pet_name \"Thoth\"","","How will you defend the Great Library?","*fake_choice","    #I install the giant mirror assemblage Archimedes and I invented and set the mob on fire.","    #I hose down the mob with my fire engine.","    #I give an impassioned speech to dissuade the mob from attacking. (Requires Rhetoric: 4)","    *selectable_if (medicine >= 4) #I will tend to the wounded who fall defending the Great Library. (Requires Medicine: 4)","    #I bring over ballistae to defend the Great Library. (Requires Techne: 4)","    #I will fight, risking my life to save the Great Library.","    #On second thought, I think I want to run away.","","*set year 226","*set name \"Sophia\"","*set nickname \"Pythia\"","*set techne 5","*set medicine 4","*set rhetoric 12","*set idealist 52","*set elitist 65","*set alexandria_strength 2","*set alexandria_knowledge 6","*set egypt_unrest 63","*set petty 72","*set ptolemy_4_rel 67","*set ptolemy_3_rel 46","*set berenice_rel 59","*set arch_rel 57","*set nefertari_rel 50","*set invented_copier true","*set invented_optics true","*set invented_auto_doors false","*set invented_fire_engine true","*set invented_geography true","*set invented_robo_arch true","*set head_librarian true","*set pet \"giraffe\"","*set pet_name \"Pharos\"","","\"Well, if it isn't the librarian.\" You turn and see that Nefertari is exploring the palace with two Egyptian swordsmen as guards. The Egyptian woman is wearing a priestess's garb and copious amounts of jewelry. \"How do you like the revolution I engineered?\"","","\"What are you doing here in the palace?\" you ask.","","\"I am looking for those who would be loyal to me in a new regime, and killing the rest,\" Nefertari says. \"How about it? Would you be willing to serve me as Head Librarian?\"","*fake_choice","    # \"Very well, I will serve you as Head Librarian.\"","    # I agree to help, but then attempt to kill Nefertari at the earliest opportunity.","    # I try to convince Nefertari to call off the attack.","","*finish",""], "labels":{}}