{"crc":-234873896, "lines":["*image chap6.png center Chapter Six: Civilization Under Siege","","*temp withArchimedes false","*temp guardsRevolt false","*temp egyptRevolt false","*temp defendedLocation \"Great Library\"","*temp rhetoricThresh 4","*temp techneUnused false","*temp plotToKillN false","","*temp ptolNum \"III\"","*if ptolemy_3_dead","    *set ptolNum \"IV\"","","*if ((petty >= 50) and (not (ptolemy_4_dead))) and ptolemy_3_dead","    *set guardsRevolt true","","*if egypt_unrest >= 50","    *set egyptRevolt true","","*temp child_ruse false","*temp kid false","*if (berenice_romance and male) and (not(berenice_dead))","    *set kid true","    Soon, Berenice gives birth to your son. Given the timing of the","    birth, Berenice begs you to allow the public to believe the child was fathered by","    Ptolemy III.  In exchange, she will publicly admit that you two are lovers.","","    Do you agree to this ruse?","    *fake_choice","        #I don't mind.  I would prefer not to be stuck taking care of another child anyway.","            *set child_ruse true","            Despite your lack of interest in the child, Berenice","            lets you pick out a name; she says she is no good with them.","        #I don't mind, as long as I get to see the child regularly.","            *set child_ruse true","            As another conciliatory gesture, Berenice lets you pick the child's name.","        #No, I insist that the child be publicly recognized as mine.","            Reluctantly, Berenice agrees to admit that the child does not belong to","            Ptolemy III, but is yours.","","    What is the name of your son?","    *input_text child_name","","    When ${child_name} is born, Berenice does not hand the child over to wet nurses and tutors, but","    tries caring for the child herself for a change.  You think she is much more attached","    to ${child_name} than she ever was to Ptolemy IV and his siblings.","","*if (ptolemy_3_romance and (not(male))) and (not(ptolemy_3_dead))","    *set kid true","    You soon bear a child, a handsome young son, and the easy","    birth is widely hailed as nothing short of a miracle.  To his credit,","    Ptolemy III claims the son as his own from the beginning.","","    Ptolemy III insists that you are the learned one, better at naming.","    What is your son's name?","    *input_text child_name","","    Though ${child_name} is born out of wedlock, Ptolemy III treats the child","    as the equal of any of his sons and daughters by Berenice.  This includes","    arranging for a royal tutor when ${child_name} is older, but, to no one's surprise,","    the tutor is expected to be you.  (At least you'll be paid from the royal treasury.)","","    You had somewhat hoped that Ptolemy would consider marrying you as a result","    of ${child_name}'s birth.  But Ptolemy delays; you think he is stalling to","    see whether some marriage with more political advantage might turn up.","    Meanwhile, with all of Berenice's children older than ${child_name}, you have little hope","    that ${child_name} will one day reach the throne.","","*if (not (guardsRevolt or egyptRevolt))","    *set year 212","    Ptolemy ${ptolNum} rules wisely for many","    *if kid","        years, providing an amazing city for ${child_name} to grow up in.","    *else","        years.","    The king is loved by","    everyone, from the elites to the Egyptians.","    *if ptolNum = \"IV\"","        You think your careful tutelage is likely responsible for this stability; Sosibius failed","        to corrupt your young pupil.","        *if agathoclea_lover","            Even though Agathoclea remains Ptolemy's favorite mistress,","            *if (not(sosibius_dead))","                Sosibius and her brother do not have as strong a hold on her as you might have","                feared, and she has blossomed into her own woman.","            *else","                without Sosibius around, she and the king are free to pursue their love without","                strings attached.","","        Ptolemy does make a few changes to Alexandria, however, guided by the principles","        that you instilled in him.","","        *gosub nonpettyChanges","        *page_break","    *else","        *gosub ptolemy_3_changes","    *set alexandria_knowledge +1","","    *if berenice_romance and (not(berenice_dead))","        As for you and Berenice,","        *if male","            the two of you are married shortly after ${child_name}'s fifth birthday.","            Berenice will never forget her ex-husband, but she tells you that","            you are wise and handsome and enough for her.","            *set married_berenice true","","            ${child_name} proves to be a very quiet child: hardly speaking at all,","            but intensely curious about the world.  You do your best to apply","            your lessons learned from tutoring Ptolemy, and the boy appears","            to be growing up fine.","        *else","            your bond deepens with each passing year, until one day, you find","            an Egyptian cult willing to bless the two of you as married.","            Though marriage with another woman is not exactly a Greek tradition,","            Alexandria is a permissive city, and when you explain to people","            that a real cult married you, people seem to accept that.","","            *set married_berenice true","        *achieve royal","","    *goto saveArchimedes","","*if (not(ptolemy_3_dead))","    *gosub ptolemy_3_changes","*else","    *if ptolemy_4_dead","        *bug","    *if petty >= 50","        *gosub pettyChanges","    *else","        *gosub nonpettyChanges","","*if guardsRevolt","    The elites of the city become increasingly upset with the frivolous way Ptolemy","    IV spends their taxes.  Petitioners come to Ptolemy asking","    for aid when their crops fail or their businesses fall on hard times,","    and they are rebuffed.  The volunteer military chafes, and whispers","    of revolt spread.","","*if ptolemy_3_dead","    You feel that it is a different city from that of your youth, but you also wonder","    how much is in your power to change.  You are fifty, and","    while you are respected in the Great Library, you now have little sway over ","    popular opinion or Ptolemy IV.","*else","    The city benefits from the combined wisdom of you and Ptolemy III.","    Officially, he is a god and you are simply a librarian.  But you find that he","    defers to you when you are right, and he does not when, in retrospect, you are","    not.  You make a good team.","","*if guardsRevolt","    You sometimes hear the whispers behind Ptolemy IV's back: the military","    claims he is soft and unworthy of the legacy of Alexander the Great.","    For his part, Ptolemy IV foolishly","    tries to command the military's respect by ordering them to perform","    menial tasks around the palace, such as fetching him food and fanning him.","    You tell him that this strategy will backfire, but he does not listen.","*elseif egyptRevolt","    Though the Egyptians of the city once accepted Ptolemy ${ptolNum} as","    the new pharaoh, the monarch has paid little attention","    to reconciling the Greek and Egyptian populations of the city.","    *if nefertari_dead","        Meanwhile, Nefertari has gained a small cult following in death,","        and a group calling itself the \"Friends of Nefertari\" has begun","        vandalizing Greek merchant stalls and public buildings.  Ptolemy","        ${ptolNum} obliges the merchants with harsh penalties for Egyptian","        vandalism, further dividing the city.","    *else","        Meanwhile, Nefertari's pirate fleet off the coast only grows in","        strength, and Egyptians inspired by Nefertari begin to dream of","        reclaiming their empire.","","*page_break","Finally, the city can withstand the tension no longer, and you are ","roused from your work in the library by the sound of shouting in the streets.","Going outside, you find","*if guardsRevolt","    a mob of Greeks","    *if egyptRevolt","        and Egyptians","    led by hoplites in full armor, about to attack the palace.  The military","    has rebelled!","    *if egyptRevolt","        In addition,","*if egyptRevolt","    crowds of Egyptians are taking torches to Greek shops and municipal","    buildings.","        ","    *if serve_nefertari","        This is it!  The revolution you and Nefertari have been waiting for!","    *elseif (evil and (not(ptolemy_4_dead))) and (not(kid))","        You sense an opportunity.  Much can happen in the chaos of a revolt.","        But for the moment, you decide to head straight to the palace to check on Ptolemy IV.","        He is the key to your future plans.","        *goto begin_palace","    *elseif (not(kid))","        The Great Library is in danger!","","*temp usedOptics false","*temp usedFireEngine false","*temp usedBallista false","*if egyptRevolt or kid","    *set library_safe false","    *set palace_safe false","    *set lighthouse_safe false","    *set colossus_safe false","    *temp colossusUsed false","","    *label chooseDefended","    *if serve_nefertari","        Where will you go?  Nefertari told you to go to the palace when the","        revolution began, but perhaps you can protect some of Alexandria's","        treasured locations from the mob before you join her.","    *elseif kid","        *if berenice_romance","            Berenice","        *else","            Ptolemy III","        and ${child_name} are in danger!  You should probably run to","        the palace.  At the same time, the wonders of Alexandria may","        all go up in flames tonight if nobody defends them.","        Where will you go?","    *else","        Which location will you defend?","        *if (not(berenice_dead))","            Berenice and","        *if ptolemy_4_dead","            Ptolemy III","        *else","            Ptolemy IV","        *if berenice_dead","            is","        *else","            are","        likely to be at the palace.","    *choice","        *hide_reuse #The Great Library.","            *set defendedLocation \"Great Library\"","        *hide_reuse #The palace.","            *set defendedLocation \"palace\"","        *hide_reuse #The lighthouse.","            *set defendedLocation \"lighthouse\"","        *if (colossus_built and (not(colossusUsed))) #The unfinished Colossus of Alexandria.","            *set defendedLocation \"Colossus\"","            *set colossusUsed true","","    *if (not(defendedLocation = \"palace\"))","        *if (defendedLocation = \"Great Library\")","            *gosub libraryPrelude","        *gosub howDefended","        *goto chooseDefended","*else","    *set palace_safe false","    Will you defend the palace?","    *temp whoToSave \"the royal family\"","    *if (ptolemy_3_dead and berenice_dead) or (evil and (not(ptolemy_4_dead)))","        *set whoToSave \"Ptolemy IV\"","    *choice","        #Yes, I want to save ${whoToSave}.","            *comment We're just going to fall through all the way to the palace here.","            *comment Not the best organization, I admit","        #No, I will join the rebels.","            *comment palace_safe remains false in these cases","            You approach the back ranks of the rebelling soldiers who are attempting","            to break through to the palace.  The palace gates form choke","            points for the fighting, leaving the rebels at the back ","            free to receive you.","","            \"Who are you?\" one of them asks, pointing a spear in your face.","","            \"I'm here to help,\" you say.  \"I don't like Ptolemy IV either.\"","","            *if ptolemy_4_rel > 50","                \"Wait, I've seen ${phim} before at court,\" says an old man","                with a golden shield.  ","                *if male","                    \"He","                *else","                    \"She","                was always a favorite of the brat.\"","","                \"Hostage?\" says the first soldier.","","                The old man nods.  \"Hostage.\"","","                \"But I'm here to help!\" you insist as one of the soldiers","                ties you up.","                ","                You do end up helping the rebels—but as a human shield","                and hostage.  When the fighting at the gates","                has ceased, you are frog-marched into the palace behind","                the advance guard.","                *if (not(berenice_dead))","","                    You step over Berenice's body on the way in.","                    *set berenice_dead true","","                Each confrontation begins with a demand for the loyalists","                to throw down their weapons, \"or the librarian dies.\"  The","                tactic doesn't always work, but it sometimes buys the rebels","                enough time to strike first.","                When the rebels finally break down the door","                to Ptolemy IV's room, and the young man sees you with a sword","                at your throat, he is delayed just long enough for a rebel","                to put an arrow through his heart.","                *set ptolemy_4_dead true","","                When the fighting is over, and the revolution won, you find that the","                rebels are honorable in their own way, and they let you","                go.  You live out the rest of your days at the Great Library in peace,","                although somehow the students at the Musaeum hear of your","                humiliation, and they do not let you hear the end of it.","","                It is true that you were once on good terms with Ptolemy IV,","                but when you saw what he became, you had to turn against him.","                [i]The ability to change one's mind is precious[/i], you think.  Too","                bad the world never thinks so.","                *set archimedes_dead true","                *finish Chapter 7: The Test of Time","            *else","                An old man with a golden shield—a noble, most likely —","                gives you an appraising look.  \"Yes, I've seen you before.","                You were the brat's tutor.\"","","                \"I swear I'm not on his side,\" you say.","","                The old man laughs.  \"I know.  We heard about the tantrums","                that brat would throw at you!  Poor librarian, of course you","                can join us.\"","","                You join the rebels.  How will you help them?","                *fake_choice","                    #I bring my inventions to bear on attacking the palace.","                    #I inspire them with passionate speeches against Ptolemy.","                    #I will tend to the wounded among the rebels.","                You go with the rebels to the palace.","        #No, I will defend the Great Library in case the mob goes there next.","            *label defendTheLibrary","            You run back to the library to ensure it is safe.  Many of","            the other librarians have the same idea, and you join their","            vigil outside the library.  In the distance, you can see","            the gathered torches of the mob around the palace, and you wait","            for them.  Those torches could too easily be turned against the","            library, you reason.","","            Soon, the palace goes up in flames, and as the night goes on,","            the mob does eventually turn up at the library.","            *set defendedLocation \"Great Library\"","            *gosub howDefended","","            *comment howDefended either makes library safe, kills protagonist,","            *comment or goto's out of this","            *if not(library_safe)","                *bug","","            As the sun rises, your fellow librarians congratulate you:","            it was your plan that saved the Great Library from being burned","            to the ground.  Ptolemy ${ptolNum} may have died this night,","            but civilization itself is safe.","            *if (ptolNum = \"III\")","                *set ptolemy_3_dead true","            *else","                *set ptolemy_4_dead true","            *set alexandria_falls false","","            As everything gets back to normal,","            *goto greatDiscoveries","","*label begin_palace","*temp mob \"soldiers\"","*if egyptRevolt","    *set mob \"mob\"","*if kid","    *comment Let us extract ourselves from the main narrative to","    *comment avoid confusion!","    *if berenice_romance","        *goto berenice_and_kid","    *else","        *goto ptolemy_and_kid","*if (not(berenice_dead))","    As you approach the palace gates, you find Berenice single-handedly","    defending the passage to the palace courtyard.  Surrounded by","    *if egyptRevolt","        a mob armed with torches and scythes and crude tools,","    *else","        nobles wearing fine, hardly used armor and bearing largely ornamental","        shields,","    Berenice makes a quick swipe with her sword every time they get close.","    *choice","        #I try to convince Berenice that she is in no condition to fight.","            *if rhetoric < 4","                \"Berenice!\" you yell.  \"It isn't worth it!  Save yourself!\"","                But Berenice pays you no heed.","                ","                *gosub mobKillsBerenice","            *else","                \"Berenice!\" you yell.  \"The palace is only stone.","                You are more valuable—save yourself!\"","","                Berenice catches your eye, nods, and makes her retreat into","                the palace.  As the","                *if egyptRevolt","                    mob surges forward,","                *else","                    rebel soldiers surge forward,","                you hope she finds her way to safety.","        #I try to convince the ${mob} that Berenice is not to be attacked.","            *if rhetoric < 6","                \"Berenice is an honorable, noble woman!\" you shout to the ${mob}.","                \"Leave her alone!\"","","                But your words fall on deaf ears.","                *gosub mobKillsBerenice","            *else","                \"You all should be ashamed!\" you shout.  \"To attack","                Berenice, our beloved queen, for what?  Do you truly think she","                is responsible for your problems?  Think about what you","                are doing!","","                You continue with a short speech extolling Berenice's virtues,","                during which your audience nervously fidgets.  Finally, the","                *if egyptRevolt","                    mob begins","                *else","                    rebel soldiers begin","                to skulk away.  It worked—Berenice is safe.","","                *if berenice_romance","                    \"Thank you,\" Berenice says, and she rewards you with a kiss.","","                    \"You're too old for this sort of thing,\" you jest.","","                    \"Look who's talking,\" she says.  \"Listen, I know you're not going","                    to like this, but I need to keep trying to defend the city.","                    Don't try to stop me.\"","","                    \"How could I?\" you say.  \"It's why I love you.\"","","                    Berenice takes off at a run into the night.  \"I'll stay out of trouble","                    this time!\" she yells.","","                    \"I don't believe you!\" you call back.  But Berenice is Berenice,","                    and that is why you love her.","","                *else","                    \"Thank you,\" Berenice says as you join her at the gate.","                    \"I'm in your debt.\"","","                *set palace_safe true","        *selectable_if (invented_fire_engine) #I use my fire engine to hose the ${mob} down.  (Requires Invention: Fire Engine)","            You work the pump of your fire engine and point the hose at the","            ${mob}.  The watery spray quenches the","            *if egyptRevolt","                mob's","            *else","                soldiers'","            torches and plunges them","            into darkness.  Meek without their light, the","            *if egyptRevolt","                Egyptians","            *else","                rebels","            lose their courage and disperse.","","            \"Thank you,\" Berenice says as you join her at the gate.","            \"I owe you much.\"","        *if (serve_nefertari or evil) #I simply shoulder my way past Berenice.","            You shove past Berenice.  You need to get to","            *if serve_nefertari","                Nefertari!","            *else","                Ptolemy IV!","","            \"It's not any safer in there, librarian,\" Berenice says.  But you ignore","            her, and soon you hear her screams as the mob falls on her.","            *set berenice_dead true","    *page_break","            ","*else","    On your arrival, you see that the","    *if egyptRevolt","        mob has","    *else","        rebels have","    already burst through the gates","    of the courtyard, which now hang loosely by single hinges.  The stone gods","    of the courtyard have lost heads and arms to the mob, and you suspect that","    the looting is more extensive inside.","","*if (guardsRevolt) and (not(sosibius_dead))","    You catch sight of a pudgy Sosibius sneaking out the back of the palace with","    a cart full of tapestries and small statues.  ","","    *if evil","        This could be your chance to kill him, leaving Ptolemy IV under your","        control alone.","    *temp nonlethal false","    *choice","        #I leave him be.","            Sosibius is welcome to his spoils, you think.  You leave him be.","        #He has the right idea—I begin looting as well.","            You find a laundry cart in the palace yourself, and begin ","            running through the palace, piling on all the art objects you","            can.  Soon, you have a tidy pile of small statues,","            vases, paintings, and tapestries.","            *if serve_nefertari","                But you set aside the cart for later.  You must find Nefertari!","                You enter the palace.","","                *goto skip_to_nefertari","","            You sneak the goods back to your home and await the dawn.","            Eventually, you sell the goods one by one to passing merchants","            who would not recognize the goods of the palace, and you end","            up a surprisingly wealthy librarian.","            ","            But Alexandria itself is never quite what it was.  Under the new","            martial rule that follows the execution of Ptolemy ${ptolNum}, the Great Library and","            Musaeum in particular begin to wither from lack of funding.","            As despondency sets in among the scholars, you find your own will","            to pursue knowledge flagging as well, especially as you have","            come to find the expenditure of your wealth more immediately gratifying.","            Like the new Alexandria, you do well for yourself on the surface, but your","            greatest years are behind you.","            ","            *set alexandria_knowledge -1","            *set alexandria_falls true","            *set archimedes_dead true","            *finish Chapter 7: The Test of Time","        #I try to chase him away from his plunder.","            *set nonlethal true","            *goto fightSosibius","        #He's not getting away—I try to kill him.","            *label fightSosibius","            You run after Sosibius, who catches sight of you and begins","            pushing his cart faster.  But he won't abandon his cart of","            plunder, and you catch up to him, tackling him to the ground.","","            The cart rolls away as you engage in a wrestling match with","            Sosibius.  He is heavier and tries to pin you, but he is soon","            panting with unfamiliar exertion.","            ","            *if nonlethal","                You leave him panting on the ground, and drive his cart of","                ill-gotten goods back to the palace.","            *else","                You put your hands around","                his neck and squeeze, and though he struggles at first, he","                eventually goes limp.","                ","                Sosibius is dead.  You congratulate yourself on having finally","                *if evil","                    killed your rival.","                *else","                    rid the kingdom of the man.","                *set sosibius_dead true","","*if serve_nefertari","    *goto skip_to_nefertari","","*if guardsRevolt and (not(ptolemy_4_dead))","","    You run through the palace looking for Ptolemy IV.  In most rooms,","    there are already rabble looting the treasures of the palace.","    ","    You find Ptolemy IV in his bedchambers, backed into a corner by","    one of his own royal guard.  The guard wears bronze armor and a helmet","    and bears a shield and spear, while Ptolemy IV only has his bedclothes.","","    \"Alexandria is falling because of you,\" the guard tells the","    cowering Ptolemy.  \"You are the sickness that must be purged.\"","","    *if evil","        Oh, if only this guard knew where the true sickness lay!","        *if (berenice_dead and ptolemy_3_dead) and sosibius_dead","            In fact, this guard has unwittingly presented you with the","            perfect situation: Ptolemy is depending on you for his","            very life.  If you can manage to save Ptolemy IV tonight,","            he will be eating out of your hand from now on.","            With Ptolemy III, Berenice, and even Sosibius all dead,","            you're certain that you will be able to take control","            of weak Ptolemy IV and the kingdom.","","            Assuming you don't die.","    *choice","        #I attack the guard alone.","            You leap onto the guard, who ","            *label attackGuardAlone","            throws you to the ground","            and stabs you in the shoulder with his spear.  Excruciating ","            pain blossoms from your wound.","            ","            Ptolemy IV uses the distraction","            to run.  The guard turns to follow Ptolemy, and you try to get","            up, but the guard whirls around and stabs you again, this","            time in the belly.  You begin coughing up blood.","","            \"Hmph,\" the guard says.  \"So there is heroism in this kingdom","            after all.\"  He leaves you to die.","","            *if evil","                How ironic that in attempting to take control of the kingdom","                once and for all, you actually ended up sacrificing yourself","                for the prince.  Perhaps, deep down, that is what you wanted?","","                Historians will never quite figure it out.","            *else","                You have saved young Ptolemy, but at the cost of your life.","            *set mc_dead true","            *set archimedes_dead true","            *finish Chapter 7: The Test of Time","        #I tell Ptolemy to attack the guard with me.","            \"Fight him with me!\" you tell Ptolemy.  \"Get ready … now!\"","","            *if ptolemy_4_rel > 50","                You and Ptolemy IV attack the guard at the same time.","                As the guard moves to attack Ptolemy IV with his spear,","                you grab the spear butt and pull.  Ptolemy gets","                close enough to land a solid punch on the guard,","                and the two of you wrestle the guard to the ground,","                disarming him.  Ptolemy finally drives the guard's","                own spear into his chest.","                *set ptolemy_4_rel %+ 20","                ","                \"I owe you my life,\" Ptolemy IV says.  \"Thank you.\"","","                \"You've gotten the kingdom into quite a mess,\"","                you say.  \"Do you promise to heed my advice from now on?\"","","                \"I promise,\" Ptolemy says.","","                *if berenice_dead and (ptolemy_3_dead and sosibius_dead)","                    And what do you do with the prince's pledge?","                    *choice","                        #I take the place of Sosibius, manipulating the prince until I rule Alexandria.","                            *set evil true","                            *set you_are_sosibius true","                            \"Excellent,\" you say.  \"Do as I say, and we shall best the rebels yet.\"","","                            With your guidance, Ptolemy IV musters the support of the loyalist guards,","                            and the revolution is beaten back.","                            ","                            Ptolemy now worships you.  He has the utmost faith in you.  Anyone","                            he has ever trusted more is dead.","","                            It is the perfect time to take control of Alexandria.","","                            *set alexandria_falls true","                            *finish Chapter 7: The Test of Time","","                        *if (evil) #I admit, I have had a change of heart.  I will advise him wisely from now on.","                            Though you had once dreamed of controlling the kingdom","                            through Ptolemy IV, you are getting too old for that sort of thing.","","                            \"It can be hard to change,\" you say to Ptolemy IV.","                            \"But it's worth it.\"","","                            When the revolution fails, Ptolemy IV goes back to ruling Alexandria.","                            *set petty %- 20","                            You remain his trusted advisor until the end of your days,","                            and only sometimes dream of taking over the kingdom.","","                            *set alexandria_falls false","                            *finish Chapter 7: The Test of Time","                        *if (not(evil)) #I help him rule wisely from now on.","                            You take pride in the fact that you would never","                            abuse Ptolemy IV's trust.","","                            \"Come,\" you say.  \"Let's see if we can work","                            on a plan to push back those rebels together.\"","","                            You and Ptolemy IV round up the loyalists among","                            the royal guard, using the memories of the deceased","                            Berenice and Ptolemy III to stir them to action.","                            The loyal guards rally, and they beat back the","                            revolution over the course of the night.","","                            When the revolution fails, Ptolemy IV goes back","                            to ruling Alexandria.  You become his trusted","                            advisor, and resolve to advise him wisely ","                            for as long as you live.","","                            *set petty %- 20","","                            Having beaten back the revolution,","                            *goto greatDiscoveries","                            ","","                    *else","                        *if evil","                            *comment somebody's alive and in the way","                            You curse your planning:  if","                            *if (not(sosibius_dead))","                                Sosibius","                            *elseif (not(berenice_dead))","                                Berenice","                            *elseif (not(ptolemy_3_dead))","                                Ptolemy III","                            *else","                                *bug","                            were not alive, you might have a chance at having the boy completely","                            in the palm of your hand at this point.  As it stands, you must","                            share the prince's loyalty.  Alas!","                        *comment if not evil, we fall through and story continues","","            *else","                But Ptolemy doesn't move as you attack the guard, and","                you realize too late that he doesn't quite trust you","                enough to do what you say.  The guard","                *goto attackGuardAlone","        #I allow Ptolemy to be struck down.","            The royal guard drives his spear through Ptolemy's chest,","            and blood wells from the young monarch's mouth as he crumples","            to the ground.","            *set ptolemy_4_dead true","            *set alexandria_strength -1","","            You flee, saddened that this is the ultimate end of your relationship","            with Ptolemy IV.","","    *if (not(ptolemy_4_dead))","        *comment Exit the prince because we might encounter Nefertari next","","        \"You must have a good hiding place in the palace from when you were young,\"","        you say to Ptolemy IV.  \"Could you go there now, to wait out this revolution?\"","","        Ptolemy IV nods and runs off.","","*if (egyptRevolt and nefertari_dead) and (not(ptolemy_3_dead))","    *goto egyptians_vs_p3","","*if egyptRevolt and (not(nefertari_dead))","    *page_break","    *if (not(ptolemy_3_dead)) and (not(serve_nefertari))","        *goto nefertari_vs_p3","    You explore the palace, making your way past the scattered corpses of guards and Egyptian","    commoners.  The place has been thoroughly looted already, but gold","    isn't what you seek.","","    *label nefertari_is_here","","    \"Well, if it isn't the librarian.\"  You turn and","    see Nefertari, flanked by two Egyptian guards.","    The pirate queen is wearing her usual white Egyptian priest's robe, along with","    large gold earrings, a gold torc, and a gold headdress that all once","    belonged to Berenice.  \"How do you like the revolution I engineered?\"","","    *if serve_nefertari","        You admit, now that you have seen it, that there is much you do not like","        about it.  The wonders of Alexandria aflame, the senseless death…","        and Nefertari is responsible for it all.","        *choice","            #\"I don't like it at all.  This is my civilization you're destroying.\"","                *set nefertari_rel %- 10","                \"Well, someone woke up grumpy,\" Nefertari says.  \"Come now,","                you wouldn't have been faithful all this time only to realize","                that fire is bad and killing is wrong!  Now, what say you?  Are","                you willing to join me and become my Head Librarian after all this time?\"","            #\"It is delightful to see this city of snobs burn.\"","                *set nefertari_rel %+ 10","                Nefertari laughs.  \"That's the spirit!  So, are you ready to","                become my Head Librarian?\"","","            #\"I'm not sure how I feel.  This is a confusing time.\"","                \"Very understandable,\" Nefertari says lightly.  \"But not","                so confusing that you are no longer willing to be my Head Librarian, I hope.\"","    *else","        \"What are you doing here in the palace?\" you ask.","","        \"I am looking for those who would be loyal to me in a new regime, and","        killing the rest,\" Nefertari says.  \"How about it?  Would you be willing","        to serve me as Head Librarian?\"","    *label nefertariLibrarianChoice","    *choice","        #\"I will gladly serve you as Head Librarian.\"","            *label agreeNefertari","            You agree to serve Nefertari as Head Librarian.","            *if plotToKillN","                Though you intend to kill the woman, you have no hope of","                doing so while her guard is up; better to let her get used","                to you first.","","            \"Splendid!\" Nefertari says.  \"You won't regret your decision.","            You are a treasure, to be sure, and I will take good care of you,","            as I take care of all valuable spoils.  Now come with me.\"","","            *if plotToKillN","                You feign meekness and follow, waiting for your opportunity.","            *elseif (not(serve_nefertari))","                You gamely follow your new master.","            ","            Through the rest of the night, you see Nefertari visit the","            important captains of her command structure,","            and you come to appreciate just how much organization Nefertari has","            brought to the normally chaotic business of piracy and revolt.  ","            The revolt apparently is only meant to seem chaotic on the surface,","            while its targets are carefully chosen one by one.","","            *comment \"Try to kill Nefertari\" splits here for good","            *if plotToKillN","                Which opportunity shall you seize?","                *choice","                    #I gather some ingredients from a sacked vendor, and poison Nefertari's water.","                        As Nefertari is talking to some of her lieutenants,","                        you scrounge through an herb vendor's sacked stall,","                        looking for poison ingredients.","                        ","                        *if medicine < 7","                            You have enough","                            time to get the ingredients for a basic poison,","                            but not enough time to find ingredients that would","                            mask the bitter taste.","                        *else","                            Your skill in medicine allows you to quickly","                            identify not only the ingredients necessary for","                            poison, but just the right ingredients to mask","                            the bitter taste.","","                        \"What are you doing over there, librarian?\" Nefertari","                        says irritably, dismissing her lieutenant.","","                        *if rhetoric < 4","                            \"Just, ah, preparing for an…experiment.\"  You","                            have never been particularly good at lying, which","                            you had hoped this plan would not involve.","","                            Nefertari scowls at you, marches over, and","                            grasps your wrists, revealing the poisonous herbs.","                            \"What sort of experiment?\"","","                            You freeze, your mind blank.  What sort of","                            experiment, indeed?  \"Ah…it's a bit","                            complicated….\"","","                            \"Eat it,\" she says coldly.  ","                             ","                            *page_break","                            *if medicine >= 7","                                You raise to your lips one of the peppermint","                                leaves that would mask the bitter taste of the","                                poison, and pop the whole leaf in your mouth.","                                You grin.  \"See?\"","","                            *else","                                You raise one of the less poisonous herbs","                                in your hands to your mouth, hoping that","                                a small taste will not kill you.  You chew","                                reluctantly.","","                                But Nefertari sees the fear in your eyes.","                                \"More.\"  She pushes your hand to your mouth.","                                \"All of it.\"","","                                You suddenly surprise Nefertari by shoving your ","                                hand toward her own mouth.  The herbs fly","                                everywhere, but you feel some enter her open","                                mouth before she can react.  Surprised, she","                                shrieks and tries spitting out the herbs,","                                and you take the opportunity to make a break","                                for it.","","                                Unfortunately, you are old, and","                                Nefertari's guards are not.  Two of them quickly","                                run you down and shove you to the ground,","                                holding spears to your neck.","","                                \"What was that?\" Nefertari demands.  \"What","                                did you do to me?\"  The poison ","                                must not have had its full effect, or you","                                would be dead by now.","","                                \"Just an experiment,\" you say softly.  \"But","                                it looks as though I will not live to see the ","                                outcome.\"","","                                \"Kill ${phim},\" Nefertari says.","","                                \"But the old","                                *if male","                                    coot","                                *else","                                    witch","                                might know the antidote,\" says a guard.","","                                \"You think I would drink something that","                                traitor made?\" Nefertari says.  \"No.  The","                                librarian dies.\"","","                                The guards stab you in the neck, and you are","                                done.","                                *set mc_dead true","","                                The Egyptian revolt is successful.","                                But a week later, Nefertari dies of your poison.","                                *set nefertari_dead true","                                Without a strong leader, Alexandria falls","                                again to chaos, its golden age thoroughly","                                over.  And time marches on.","                                *set egypt_wins true","                                *set alexandria_falls true","                                *set archimedes_dead true","                                *finish Chapter 7: The Test of Time","","                        *else","                            \"Just thought I'd restock my spice shelf while I was","                            waiting for you,\" you say.  \"Too bad the expensive","                            ones are already gone.\"","","                        \"Hmph.  Fine.  Follow me, and no more","                        looting unless I say you can.\"","","                        You breathe a sigh of relief and follow.","","                        The next time Nefertari is distracted, you use a war hammer","                        and a shield as a makeshift mortar and pestle, pretending","                        to idly play with the weapon as you actually grind the","                        herbs.","                        ","                        Finally, there is the matter of putting","                        the poison in her drink.  Nefertari drinks from a wineskin","                        at her waist—difficult to get off her person.","","                        \"May I have a sip of your water?\" you ask Nefertari as","                        you are walking down the Boulevard Aspendia toward the","                        Serapeum, where other librarians have holed up against","                        Nefertari's revolt.","","                        \"Fine.\"  She gives you the waterskin, and watches you.","","                        You remove the cap, then take a drink, then another.","","                        \"That's enough,\" she says, putting out her hand.","","                        \"Wait, I'm very thirsty.\"  You take another drink.","","                        Nefertari rolls her eyes.  It's not much of an opening,","                        but you quickly stuff your ground poison into the cap","                        with your free hand, as you drink with the other.  You","                        replace the cap quickly, then shake, mixing the poison","                        in.  \"See?  Still plenty left.\"","","                        Nefertari takes her wineskin back.","                        *page_break","                        *if nefertari_rel >= 60","                            *set nefertari_dead true","                            An hour later, Nefertari is dead at your feet.  You","                            think she suspected in her last moments, judging from","                            the incredulous looks she gave you, but thankfully,","                            she did not order her guards to kill you—perhaps","                            because she was too busy fighting for air.","","                            Nefertari's two guards clearly don't know what to do,","                            so you tell them, \"I imagine you'll need to report this.","                            I'll be at the library if you need me.\"","","                            Stunned, they nod.","                            *page_break","                        *else","                            A moment later, Nefertari pours the water onto","                            the ground, holding her torch close to the stream.","                            You, too, can see ground bits of poisonous herbs ","                            floating in the water.","","                            \"Really, librarian?\" Nefertari says, draining the last of","                            the water and throwing the wineskin to the ground.","                            \"Really.\"  Nefertari draws her sword.","","                            \"I'm not certain what you're talking abou—\"","","                            Nefertari interrupts you with a slash across your neck.  ","","                            [i]That could have gone better[/i], you think as you marvel","                            at the amount of blood gushing from your wound.","                            *set mc_dead true","                            *set egypt_wins true","                            *set alexandria_falls true","                            *set archimedes_dead true","                            *finish Chapter 7: The Test of Time","","                    #I talk Nefertari's guards into turning on her.","                        While Nefertari is speaking to some of her lieutenants,","                        you turn to her two personal bodyguards, a","                        man and a woman who are watching you.","                        \"Nefertari certainly wears a lot of jewelry, don't","                        you think?\"","                        ","                        \"Not as much as she could,\" says the male","                        bodyguard, frowning at your implication.","                        \"She is a fair and generous captain.\"","","                        \"Oh, very generous, I agree,\" you say.  \"After all,","                        she offered me a thousand silver staters for coming","                        on as librarian.\"","","                        The female bodyguard looks to the male one, frowning in","                        disbelief.  Perhaps it was a bit much to claim","                        you were being paid in silver, when silver coin","                        is so hard to come by these days.","                        *if (rhetoric >= 7) or serve_nefertari","                            But then she says to the man, \"I don't suppose","                            you ever got paid such a bonus, did you?\"","","                            \"Never,\" the other guard grumbles, and you","                            realize that they believe you.  Excellent.","                        *else","                            But, having chosen your tactic, you are determined","                            to see it through to the end.","","                        As the night wears on, you continue to ply the","                        two guards with tales of Nefertari spending money","                        on everyone but them.  Finally, as Nefertari is off","                        conferring with another lieutenant, you open your","                        mouth, and the man seethes, \"Enough!  I don't want","                        to hear it!  We have been loyal servants of Nefertari","                        since before she had a ship, and I don't want to","                        hear ","                        *if (rhetoric < 7) and (not(serve_nefertari))","                            these lies about","                        how every man and dog in Alexandria has been","                        treated better than we have!\"","                        ","                        Now or never.  You take the leap and say softly:","","                        \"You know, I wouldn't tell a soul if you decided to kill her.\"","","                        *if (rhetoric < 7) and (not(serve_nefertari))","                            As the man snarls in rage and impales you with his","                            spear, you realize that Nefertari actually","                            inspires a great deal of loyalty in her servants,","                            and that your tongue is not so silver as all that.","                            *set mc_dead true","                            *set egypt_wins true","                            *set alexandria_falls true","                            *set archimedes_dead true","                            *finish Chapter 7: The Test of Time","                        *else","                            The guard's eyes widen.  He freezes.  For a moment,","                            you think he might strike you.  But no:  he's","                            considering it.  And so is the woman, who is","                            watching you impassively.","","                            \"Just think,\" you say softly.  \"As her trusted","                            bodyguards, you know where all her riches are","                            hidden.  Act now, while everyone is distracted,","                            and you could live like kings for the rest of","                            your days.  I'll never tell, you have my word.","                            I ask nothing but my freedom.  Do it tonight,","                            while everyone is distracted.  Your life need","                            never be hard again.\"","","                            The guards nod behind you, and you see Nefertari","                            approach.","","                            \"Sorry, that took longer than I thought,\" Nefertari","                            says.  \"Shall we go to the next encampment?\"","","                            Nefertari never makes it there.  When she tries","                            to take a shortcut through an abandoned alleyway,","                            her guards stab her to death from behind.","                            They stand over her body a moment, in awe of","                            what they have done, before quickly swiping the","                            gold bracelets and anklets that adorn her.  You","                            take the opportunity to flee before they decide","                            they do not want witnesses.","                            *set nefertari_dead true","                            ","                    #I will convince Nefertari we need to speak alone, then knife her.","                        As you, Nefertari, and her two bodyguards are traveling","                        from one of her camps to the next, you ask Nefertari","                        if you can speak alone with her.","","                        *if nefertari_rel < 55","                            \"Whatever you wish to say to me, you can say to","                            my bodyguards as well,\" Nefertari says.","","                            \"But this is a sensitive matter…I am not","                            sure it is a good idea for many ears to hear.\"","","                            \"Hmm.\"  Nefertari whispers something into one of","                            her guards' ears.  \"Very well.  Come with me.\"","                        *else","                            \"As you wish,\" Nefertari says, and you","                            congratulate yourself on having developed the","                            Egyptian woman's trust.  \"Pawara,","                            Bunefer, stay here.  ${name}, come with me.\"","","                        Nefertari leads you to an alley, just around a","                        corner so that you are out of sight of","                        the guards.  \"Now, what is it you wished to talk about?\"","","                        In answer, you draw a knife you had concealed in your","                        sandal and lunge at Nefertari.","","                        *if nefertari_rel < 55","                            But Nefertari seems to have anticipated your","                            attack, as she leaps backwards.  Her guards'","                            spears impale you from behind.","                            Apparently, she had instructed them to follow","                            you into the alley.","","                            \"Foolish librarian, was killing me worth","                            dying for?\"  Nefertari scoffs.   \"I was ready","                            to make you Head Librarian, and you had to","                            suddenly imagine yourself a Greek hero.\"","","                            Nefertari and her guards leave you to die","                            in the alley.  Perhaps if she'd trusted you","                            more, things wouldn't have ended this way.","                            But with the life you knew gone, you felt","                            you had to at least try to serve the Ptolemies","                            one last time.","                            *set mc_dead true","                            *set egypt_wins true","                            *set alexandria_falls true","                            *set archimedes_dead true","                            *finish Chapter 7: The Test of Time","                        *else","                            She seems genuinely surprised, as if witnessing","                            a dog speak, when you thrust the knife into her belly.","                            She tries to bring her pointed staff to bear, but","                            you are already too close for it to be effective,","                            and she merely beats at your back with the staff","                            as you drive the knife deeper.","","                            *set nefertari_dead true","                            Finally, Nefertari musters the strength to call for","                            help.  You drop her, and flee as she crumples to","                            the ground.  With such wounds, she is as good as","                            dead.  You can hear her guards behind","                            you as you lose them in the maze of alleys.","","                            You keep running and changing hiding places until","                            morning, when the last of the fighting is dying out.","","                *comment Nefertari plots all fall through here if successful","                *if not(nefertari_dead)","                    *bug","                Without Nefertari, the Egyptian revolution fails.","                Thanks to you,","                *if (not(ptolemy_3_dead))","                    Ptolemy III retains","                *elseif (not(ptolemy_4_dead))","                    Ptolemy IV retains","                *else","                    the Greeks retain","                control of Alexandria.","                Though history may remember you mostly for your","                scientific achievements, stopping a revolution is not a bad","                legacy to have, either.","                *set archimedes_dead true","                *finish Chapter 7: The Test of Time","            ","            The Alexandrian military, unused to urban combat on such a","            grand scale, collapses under the pressure from Nefertari's","            volunteer army.","","            By morning,","            *if (not(ptolemy_3_dead))","                Ptolemy III is dead.","                *set ptolemy_3_dead true","            *if (not(ptolemy_4_dead))","                Ptolemy IV has fled Alexandria.","            *if (not(berenice_dead))","                Berenice is imprisoned.","            Nefertari rules Alexandria.","","            True to her word, Nefertari allows you to ","            *if head_librarian","                remain","            *else","                become","                *set head_librarian true","                *achieve head_librarian","            Head Librarian.","            *comment The following could apply to winning with serve_nefertari,","            *comment but it's kind of burying the lede and not essential","            *if (not(serve_nefertari))","                But many","                of the other librarians, and many of the scholars and lecturers of the Musaeum,","                she replaces with Egyptian substitutes.  The replacements are clever but","                lacking in traditional Greek knowledge, being mostly Egyptian priests or friends","                of Nefertari whom she found clever, and the ousted old Greek men as well","                as the remaining scholars bitterly resent what appears to be a purely political","                takeover of the Great Library.","                ","                You think you see value in what Nefertari is doing—the former priests","                must have some knowledge that the Greek scholars do not—and you do your best to","                quell the dissent among the Greek scholars while quietly providing the Egyptian","                scholars with supplementary instruction in Greek language, philosophy, and","                literature.  As you hoped, they in turn teach you things you did not know:","                about medicine, history, hieroglyphics, and even some Egyptian mathematics.","            ","            *set egypt_wins true","            *set alexandria_falls true","            *set archimedes_dead true","            *if serve_nefertari","                But there is another surprise in this brave new world: though you have","                long been Nefertari's","                *if nefertari_lover","                    lover,","                *else","                    faithful servant,","                you are still surprised when Nefertari names you her chief advisor.","                With your help, Alexandria is rebuilt to greatness.","                *set alexandria_falls false","                *set good_egypt_end true","                *achieve egyptian","","                *if nefertari_lover","                    Moreover, all your time spent in the throne room pays off in another way.","                    Five years into Nefertari's reign, you and she are married.","                    *if (not(male))","                        Of course, it is most irregular for two women to marry in Alexandria.","                        But you two make the rules now.","                    You reign as","                    *if male","                        king","                    *else","                        queen","                    and queen for the rest of your days.","                    *achieve pharaoh","                *finish Chapter 7: The Test of Time","                        ","            *else","                Like many things about you, your work to bridge the divide between Egyptian and","                Greek will be seen by future historians as a way in which you were ahead of your","                time.  But it is also a full-time effort that, in the end, consumes the rest of","                your days.","","            *finish Chapter 7: The Test of Time","        #I agree to help, but then attempt to kill Nefertari at the earliest opportunity.","            *set plotToKillN true","            *goto agreeNefertari","        #I try to convince Nefertari to call off the attack.","            \"You must call off your attack,\" you say.  \"Take what spoils","            you like, but the people of Alexandria are its true treasures,","            and they are dying in the streets.\"","","            \"My ambition is to rule, not merely to take spoils,\" Nefertari says.","","            \"Then perhaps recognize that you have already won.\"","","            Nefertari considers this, shrugs, and says something in her","            Egyptian tongue to one of her guards, who leaves.  \"He will","            do what he can.  But will you not join me?\"","            *choice","                #\"Very well.\"","                    *goto agreeNefertari","                #\"No.\"","                    \"As you wish,\" Nefertari says.  She nods to the","                    swordsman next to her, but you are quicker, and","                    you flee the palace.","","                    As the chaos in Alexandria continues, you quietly","                    pack everything you can carry into two bags, then","                    pay handsomely for passage on a ship out of the city.","                    Alexandria was nice while it lasted, but all good things","                    must come to an end.","","                    You head west to Syracuse, hoping to live with Archimedes.  But","                    by the time you arrive, you are heartbroken to find that the Romans","                    have attacked the island of Syracuse and killed Archimedes,","                    along with many of the other Syracusians.  You do not stay long.","","                    You eventually head east to your original home of Cyrene.  Without","                    the Library and Musaeum of Alexandria, you find it difficult","                    to pursue any great discoveries, but you are old, and there is","                    value in simply enjoying the company of family and old friends. ","                    You will never know everything, you reason, and here is as good","                    a place as any to stop and be content.","            ","                    *set egypt_wins true","                    *set alexandria_falls true","                    *set archimedes_dead true","                    *finish Chapter 7: The Test of Time","","*label alexandriaFate","*if alexandria_strength < 3","    *set alexandria_falls true","","    The looting eventually stops, but not before great damage is done","    to the palace and many civic buildings.","    *gosub listTheDamage","","    Years later, historians will choose the night you just experienced as","    the night Alexandria went into decline.  The city guard, having shown","    *if egyptRevolt","        weakness in the face of the Egyptian revolt,","    *else","        duplicity and lack of loyalty to Ptolemy ${ptolNum},","    is no longer trusted by traders to protect their commerce, and they take their business","    away from Alexandria.  Taxes become far less profitable.  The Musaeum, forced to cut its budget,","    can no longer afford first-rate minds, and must settle for merely adequate teachers.","    *if library_safe","        The Great Library begins selling its scrolls to make ends meet.","","        Though the library was not burned down, many of your scholars and staff","        perished in the riot, and they must be replaced.  Your duties","        become largely administrative as you take over many duties of the deceased and","        try to hire new scholars and staff, all on a hugely reduced budget.  ","        It becomes clear to you in retrospect how Ptolemy III's easy flow of money","        toward you and the library was in no small part the reason for your earlier","        success; now, thoughts of budget woes drown out any great thoughts","        of discovery.","    *else","        Without the library, you scrounge for work tutoring the children","        of nobles, who seem to think","        *if petty > 50","            for some reason","        that Ptolemy IV turned out all right.","        *if ptolemy_4_dead","            (Besides his untimely demise, that is.)","        Feeling that perhaps you neglected Ptolemy IV's tutelage more than you should","        have, you throw yourself into the tutoring of these young men (and one woman).","        Perhaps, you hope, the glory of Alexandria can be restored to greatness if these","        young ones can rise to greatness themselves; after all, a city can only be","        as great as its people.  Your new life as a teacher keeps you quite busy,","        and you only occasionally have the time to daydream about a great problem as you","        once did.","","    Since you are an old","    *if male","        man","    *else","        woman","    now, there is not much left to say about your life, except","    that when Alexandria went into decline, you did your best to not go into decline as well.","    But it would take a charitable observer to declare that you avoided that fate entirely.","","*else","    As the night continues, the armed forces of the city rally, and","    the revolt is beaten back, although not before much damage is done.","    *gosub listTheDamage","    ","    Despite the damage, Alexandria does not fall, and it remains ","    the finest city in the world.","    *set alexandria_falls false","","    Now that the revolt is over,","    *goto greatDiscoveries","","*set archimedes_dead true","*finish Chapter 7: The Test of Time","","*label listTheDamage","*if (not(palace_safe))","    The palace is torched and destroyed,","    *if (not(berenice_dead))","        although Berenice escapes.","    *else","        its treasures looted by the mob.","*if ((not(colossus_safe)) and colossus_built)","    The construction site for the Colossus is in shambles.","*if (not(lighthouse_safe))","    The great lighthouse mirror is shattered.","*if (not(library_safe))","    Worst of all, the Great Library burns, destroying many irreplaceable scrolls.","*if (library_safe)","    But at least the Great Library is safe.","*return","","","*label libraryPrelude","You hurry to the Great Library, where your fellow librarians are standing on","the steps, keeping watch for the","*if egyptRevolt","    revolting Egyptians.","*else","    revolting royal guard.","*if euclid_dead","    You half expect to see Euclid frowning over the proceedings, but","    you remind yourself that she is dead.","*else","    Euclid is with them, moving from librarian to librarian to whisper","    words of encouragement.  When she sees you, she shuffles over to","    you.","","    \"Aren't you a little old to participate in this fight?\" you ask.","","    \"I could say the same to you!\" Euclid says, poking you in the","    ribs with her cane.  \"Don't you dare tell me you plan to fight","    in the melee with the rabble if they come.  You will get yourself killed","    for sure.\"","","    \"What are you doing here, then?\" you ask.","","    \"I've been trying to bolster the other librarians' courage by","    reminding them that death is not so bad,\" Euclid says.  \"But I'm apparently","    not as good an inspirational speaker as I am a mathematician.\"","    ","*return","","*label saveArchimedes","","You visit Archimedes regularly as the years go ","*if kid","    by, often bringing ${child_name} with you.","*else","    by.","On one of these trips to Syracuse, as you are walking on the beach with Archimedes,","he tells you that the Romans have attacked Syracuse with a small","expeditionary force and will likely send more ships to attack in earnest.","","\"I must stay to defend the island,\" he says, stroking his great white beard","pensively.  \"I know you would want me to run away to Alexandria, but this","is my home.\"","*if kid","    He gestures to ${child_name}, now fourteen, who is squatting on the sand, sketching a seashell","    on papyrus.  \"But you should take this little one away.\"","","Archimedes is even older than you are—who knows how he will fare when the Romans come","to the island?","","*label archChoice","*choice","    *hide_reuse #I try to convince Archimedes to come away to Alexandria.","        *if rhetoric >= 7","            \"The world needs your genius,\" you say.  \"You will surely die","            when the Roman soldiers invade.  Come to Alexandria.  You","            could do so much good there.\"","","            Archimedes looks anguished in making the decision, but he finally","            says, \"Very well.  Let us leave what defenses we can, and then","            I will come with you.\"","","            *gosub claws","","            Archimedes then gets on a boat with","            *if kid","                you and ${child_name},","            *else","                you,","            and you sail for Alexandria.","            *set archimedes_dead false","            *set withArchimedes true","            *goto backInAlexandria","        *else","            \"Come away with me,\" you say.","            \"A city under siege is no place for an old man.","            Alexandria will be safe.\"","","            But Archimedes shakes his head willfully.  \"This is my home,","            and King Hiero is my friend.  I must protect Syracuse.\"","            *goto archChoice","","    #I will help Archimedes set up defenses for the city, then I will return to Alexandria.","        \"I cannot stay,\" you tell Archimedes, \"but I will help you with","        the city's defenses.\"","","        *gosub claws","        ","        Having done what you can for Archimedes, you make your way back","        to Alexandria","        *if kid","            with ${child_name}.","        *else","            alone.","        *if techne >= 7","            *set archimedes_dead false","            You feel confident that the Claws of Archimedes will be sufficient to protect","            Syracuse—and in fact, within the month, you receive word","            that the city beat back the invasion.","        *else","","            Unfortunately, you receive word within the month that Archimedes","            did not survive the siege of Syracuse—your inventions were","            not enough to save him.","            *set archimedes_dead true","        *page_break","","        *goto backInAlexandria","","    #I will help Archimedes set up defenses for the city, then I will stay for the fight.","        \"I won't abandon you to the Romans, Archimedes,\" you say.","        \"If you will stand by your home, then I will stand by it, too.\"","        ","        \"Splendid!\" Archimedes says.  \"Let's get to work.\"","","        *gosub claws","","        Having finished with these defenses, Archimedes apparently thinks","        his work is done—he goes back to his house, where he begins","        drawing circles on the dirt floor with chalk.","","        *if kid","            $!{child_name} joins Archimedes and asks him what he's working on.","            Archimedes begins to answer, and then just keeps going.","","        What will you do now?","        *choice","            #I write and deliver a rousing speech to the Syracusian military.","                You write a speech, then go before King Hiero of Syracuse","                to give a demonstration.","                *if rhetoric < 4","                    But he is unimpressed with your words, and he tells you","                    to go home.  Reluctantly, you go back to Archimedes,","                    who is where you left him, drawing circles on his floor.","                    *goto circles","                *else","                    King Hiero is impressed, and he calls for the military","                    to assemble to listen to your speech.","","                    \"You are not just fighting for yourselves, or for your","                    families,\" you say.  \"You are fighting for civilization","                    itself.  Archimedes and his inventions will one day","                    be seen as the pinnacle of our age's achievements.\"","                    (You modestly do not mention your own achievements.)","                    \"Like Alexandria, Syracuse is a symbol of all that is","                    good with Greek civilization.  It must not fall to the","                    Romans!\"","","                    This elicits a cheer, the first of several throughout","                    your speech.  Your speech is cut short, however, by the","                    sighting of the Roman fleet.  Envigorated, the soldiers","                    run to their posts.","                     ","                    *if techne >= 7","                        As the enemy ships get close, the Claws of Archimedes","                        grab them by the keels, lift them up, and dash them","                        to the water, leaving the soldiers to shed their armor","                        as they struggle to stay afloat.  ","","                        The Syracusan soldiers are so good operating the claws,","                        in fact, that the Romans give up.  After losing","                        four ships to the Claws of Archimedes, the Roman ships turn around","                        and leave.  You have successfully defended Syracuse","                        from the Romans!","","                        *set archimedes_dead false","","                        *page_break","                        *achieve saved_archimedes","","                        When you return to Archimedes, he is very excited.","                        \"While you were gone, I invented a new kind of","                        mathematics, involving the square roots of numbers","                        less than nothing!\"","","                        \"Excellent,\" you say.  \"Perhaps you would care to","                        return to Alexandria and share your discovery.\"","","                        \"Perhaps,\" Archimedes says, warily.","","                        *gosub convinceArchimedes","","                        *goto backInAlexandria","                    *else","                        You can see them trying to grab the Roman ships with","                        the Claws of Archimedes, but you didn't quite design","                        the claws right, and they can't grab the ships in","                        the way you anticipated.","","                        Eventually, the Roman ships land, and you decide","                        to make your way back to Archimedes, whom you expect","                        will be unprepared for the Romans.","","                        Indeed, you find him in his home still contemplating","                        the circles he has drawn on the floor.","","                        \"Archimedes, the Romans are coming,\" you tell him.","","                        \"Hmm,\" he says, still examining his circles.","","                        Try as you might, you find you can't get Archimedes","                        to budge, until finally, a Roman soldier bursts into","                        the room.","","                        *goto doNotDisturb","","            #I help Archimedes with whatever he's doing with those circles.","                *label circles","","                *if kid","                    \"Can I have the condensed version of the explanation","                    you gave ${child_name}?\" you ask, pointing to the circles.","                *else","                    \"What are you doing there?\" you ask Archimedes.","","                \"I have an idea for a new way of thinking about waves,\"","                Archimedes says.  \"As I trace my way around this circle,","                you can see how the distance from this line through the center","                waxes and wanes.  Like so,\" he says, and with one hand","                he traces his way around the circle, while with the other,","                he makes a squiggle back and forth.  \"I think the circle","                and the wave are connected, and I just need to think further","                to understand how.\"","","                You become engrossed in the mathematics of the circle and","                its relationship to waves; in the process of your conversation","                with Archimedes, your conversation ranges even to the concept","                of negative numbers and their square roots.  So engrossed","                are you that you are surprised when the door bursts open and","                a Roman soldier barges in.","                ","                *label doNotDisturb","                The armored man raises his sword.","","                \"Do not disturb our circles!\" Archimedes says.","                *choice","                    *if (kid) #I jump in front of ${child_name}.","                        You jump in front of ${child_name}, but it's","                        Archimedes the soldier attacks.  The poor old","                        man is skewered clean through.","                        *set archimedes_dead true","                        ","                        \"Run, ${child_name}!\" you say, and the two of","                        you flee from the Roman soldier.","                        *goto fleeing_syracuse","                    #I jump in front of Archimedes.","                        You jump in front of Archimedes, and the Roman","                        soldier thrusts his sword into your belly.  Pain","                        blossoms from your wound, and you slump to the ground.","","                        *label dyingWithArchimedes","                        \"Stay away from ${name}!\" Archimedes says,","                        and he tries to defend you.  But you are both old,","                        and the soldier makes short work of both of you.","","                        Thus were two great geniuses slain at one time.","                        *set mc_dead true","                        *set archimedes_dead true","                        *finish Chapter 7: The Test of Time","                    #I try to convince this man he must not kill us.","                        \"Wait!\" you say.  \"Archimedes is a treasure alive,","                        but worthless dead.  Surely you want to bring back","                        treasure in a way that keeps it valuable?\"","","                        *if rhetoric >= 7","                            Reluctantly, the soldier sheathes his sword.","                            ","                            \"I will bring you to Marcellus,\" he says.","                            ","                            The two of you are brought before the Roman","                            general Marcellus, who wears brightly polished","                            armor and speaks more eloquently in Greek than","                            any other Romans you've heard.  He seems delighted","                            to have captured Archimedes, and indifferent to","                            your capture.  You are allowed to leave for","                            Alexandria, albeit without your old friend.","                            *set archimedes_dead false","                            *page_break","                            *achieve saved_archimedes","                            *goto backInAlexandria","                        *else","                            But the Roman soldier will have none of it.","                            He runs his sword through you.  Pain blossoms","                            from your belly, and you slump to the ground.","                            *goto dyingWithArchimedes","                    *if (not(kid)) #I flee out the back.","                        *goto begin_fleeing_syracuse","                    *if (kid) #I flee out the back with ${child_name}.","                        *label begin_fleeing_syracuse","                        You run out the","                        *if kid","                            back with ${child_name}.","                        *else","                            back.","                        You hear Archimedes scream behind","                        you, but you keep running.","                        *label fleeing_syracuse","                        Unfortunately, the Romans","                        have blockaded the island, so you have little hope of","                        leaving until the siege ends.","                        *if kid","                            The two of you","                        *else","                            You","                        hide in a small cave","                        in the south of the island.  Eventually, the","                        Romans win, the blockade ends, and you","                        *if kid","                            and ${child_name}","                        return to Alexandria,","                        *if kid","                            glad that ${child_name} was not hurt, but","                        *else","                            ashamed of your cowardice in the face of the Roman soldier and","                        saddened by the death of your friend.","                        *set archimedes_dead true","                        *goto backInAlexandria","","            #I make a miniature version of the Claws of Archimedes for the defense of Archimedes's house.","                On the roof of Archimedes' house, you construct a small crane","                with a claw at the end, suitable for grabbing people.  You","                holler to ask Archimedes to be a test subject, but he seems","                engrossed with his circles.","                ","                In the distance, you see the large Claws of Archimedes","                *if techne >= 7","                    picking up Roman ships easily and dashing them","                    into the water.  Success!","                *else","                    having trouble picking up the Roman ships—they","                    fumble and snatch at the ships' keels to no avail.","","                Eventually,","                *if techne >= 7","                    a few of the Roman ships","                *else","                    most of the Roman ships","                land.  You see the fight play out on the docks and in the","                streets, Romans fighting Syracusans.  The Romans are fewer","                in number, but they fight fiercely.","","                Finally, a Roman soldier walks up to Archimedes's house.","                Still on the roof, you operate your claw, which","                *if techne >= 7","                    successfully grabs the Roman by the helmet.  You winch","                    him up, then dash him to the ground, then repeat the","                    process a few times.  The Roman is dead, and you think","                    you have probably just saved your friend's life.","                    *set archimedes_dead false","                    *page_break","                    *achieve saved_archimedes","","                    The battle is eventually won by Syracuse.  With your friend's home safe, you","                    begin to think it is time to return to Alexandria.","                    *gosub convinceArchimedes","                    *goto backInAlexandria","                *else","                    grabs the Roman by the helmet, but doesn't have enough","                    power to lift him off the ground.  The Roman irritatedly","                    removes his helmet, then enters Archimedes's home.","                    ","                    You follow after the Roman.  Archimedes is still there","                    with his circles.","","                    *goto doNotDisturb","            *if (invented_optics) #I install a giant mirror assemblage with the rest of the city defenses and use it to burn Roman ships.","                With fond recollection of your experiments on optics in Alexandria,","                you re-create your original assemblage of mirrors on one of the city's ramparts.","                ","                When the Roman ships finally come, you set their sails alight","                with your beam of light, even as the Claws of Archimedes","                pick up other ships and dash them into the water.  Between","                the two technologies, the battle is a rout, and the Romans","                never even make landfall.","","                When you return to Archimedes, he is excited about what he","                discovered by scrawling circles everywhere.  But once you","                manage to break him out of his mathematical reverie, he is","                also pleased to learn that Syracuse is safe.","","                You, meanwhile, unhappily contemplate the fact that you have duties to","                attend to in Alexandria and will need to leave your friend","                yet again.  How long will old Archimedes still be there for you to visit?","                *set archimedes_dead false","                *achieve saved_archimedes","                *gosub convinceArchimedes","                *goto backInAlexandria","        ","","            ","","*finish Chapter 7: The Test of Time","","*label claws","","With the help of Archimedes, you design giant cranes equipped","with claws that can pick up enemy vessels and then drop them from","a great height.  Everyone calls them the \"Claws of Archimedes,\"","you suppose because he's the more famous of you two.  You install","these all along the docks and along the beaches where ships might","try to land.","","*return","","*label backInAlexandria","","Having returned safely to","*if withArchimedes","    Alexandria with Archimedes,","*else","    Alexandria,","*label greatDiscoveries","what will you attempt to do next?  You don't have many years left in you;","this could be your last contribution to civilization.","*choice","    #Invent the steam engine.","        *if withArchimedes","            With the help of Archimedes, you","            *set techne +2","        *else","            You","        *if techne < 10","            try for many years to come up with a way to harness the power of","            steam, to no avail.  The best you can do is a little","            toy you call an aeolipile, a little drum that spins by emitting","            steam at a tangent.  It's nowhere near efficient enough to be","            a source of power; slaves will remain the primary source of motive","            power for years to come.","        *else","            successfully invent an engine that runs on steam power.  For","            your first demonstration, you delight students with a cart","            that drives itself from one end of a lecture hall to the other,","            guided by wooden track.","","            Your track demonstration captures the imagination of Ptolemy ${ptolNum},","            who orders such carts placed at the major gates of the city,","            and wooden track laid to connect the gates.  Soon, people and","            goods are being cheaply carried from one end of the city to the other,","            much to the chagrin of Alexandria's palanquin bearers.","","            Meanwhile, you develop more uses for the engine.  You show that it can","            turn the paddles of a boat, and you drive a demonstration boat around","            Lake Mareotis.  You show that human-shaped automata can be set to","            move on their own indefinitely.  Not content to have the automata move in","            repetitive patterns, you even develop a means of encoding basic instructions","            for these automata, using the shapes of the gears to guide the shapes","            of their motions.  Though the human form is a bit awkward to work with, you feel","            you must make the point that your engine could replace slaves, at least in","            basic repetitive tasks.","            ","            None of these applications seems to capture the official imagination as deeply","            as your automatic carts","            on tracks.  Representatives from Rome come to study your steam engines","            in action; you hear they apparently have plans to create track from one end of their","            empire to the other.  You suppose that once you have made an invention public, there is","            little hope of keeping it secret from other nations; besides, it is for civil","            use, and would need more work to be turned into a weapon of war.","            You see no reason to deny the Romans access to good transportation.","","            You are pleased with your invention, and you are relatively certain it will make the","            world a better place.  You spend the rest of your days fascinated by how best","            to deliver complex instructions to your automata—but you begin to suspect","            that this is a problem for a younger mind.","","            *set invented_steam_engine true","            *page_break","            *achieve steamed","    #Write an epic poem.","        In the halls of the Great Library, you settle down to your desk","        and begin to compose your great epic.","","        What is your epic about?","        *choice","            #A struggle between gods and men for supremacy.","                A classic tale in a classic style.","                *set epic_type \"gods\"","            #A simple tale of a woman's life from birth to death.","                A revolutionary idea: that an ordinary life is worth writing","                about.  You are far ahead of your time.","                *set epic_type \"woman\"","            #The life of Archimedes.","                You decide to write about your dear friend, Archimedes,","                *if archimedes_dead","                    and his tragic death at the hands of the Romans.","                *else","                    including your own role in helping him escape the Romans.","                *set epic_type \"Archimedes\"","        And what is your great work called?","        *input_text epic_title","","        Your composition takes years, but you eventually finish in your old","        age.  When you do, you hold a public reading of ${epic_title} at the Musaeum.","        ","        *if (not(ptolemy_3_dead))","            Ptolemy III, now very old himself, attends.","            *if (kid and ptolemy_3_romance)","                ${child_name} sits beside him.","        *if (not(berenice_dead))","            Berenice, who looks hardly a day over forty despite being rather older,","            *if berenice_romance","                could not be happier for you.","            *elseif ptolemy_3_dead","                attends with her young new beau.","            *else","                holds his hand.","            *if (kid and berenice_romance)","                ${child_name} sits beside her.","        *if (not(ptolemy_4_dead))","            Ptolemy IV watches from the","            *if petty > 50","                back row, arm slung over a chair, as aloof toward you as ever.","            *else","                front row, as adoring of you as ever.","        *if (not(archimedes_dead))","            Even Archimedes, now ancient, makes the trip out for the premiere.","","        *if rhetoric < 7","            As you read your epic poem, you know that it's unlikely to","            become a classic—you never quite honed your Rhetoric skills enough","            for that.  But still, you made something uniquely yours.  A scientific","            discovery might have been made by anyone, but you have contributed your","            unique voice to the choir that is humanity, singing its song of creation","            to anyone who will listen.","            ","            Yes, judging from the audience, you see there are some word choices that ring false,","            some allusions that pass over their heads, and some plot points that don't sit well.","            But you can see at least one audience member nodding enthusiastically, a","            young man whom you've never met.  For him, it seems, the poem is the right thing","            at the right time, and you are pleased that he enjoys it.","            If you're lucky, perhaps he will write an essay about your work, or write","            a work inspired by you—and in that way, the song of creation will","            carry on.","        *else","            You hold your audience rapt until the very end, when the audience as one","            leaps from their seats and bursts into thunderous applause.","","            That performance of ${epic_title} proves to be the first of many.","            From Alexandria, word of your writing spreads to the corners of the","            earth.  All cultured Greeks begin to seek out your","            work, and adaptations are performed to large audiences.","            You are not sure, but you think you have created something that will stand the test","            of time.","        *page_break","        *set wrote_epic true","        *achieve epic","        ","    #Attempt to understand why disease spreads.","        *if withArchimedes","            With the help of Archimedes, you","            *set medicine +2","        *else","            You","        attempt to understand the origins of disease.  You interview","        the families of plague victims, attempting to determine whether","        there was any pattern in their behaviors.  At first, you ask","        questions about the temperaments of the diseased, thinking to","        link the disease to the balance of humours in the afflicted.  It soon","        becomes apparent, however, that","        plague affects the jovial, sad, and angry equally.","","        In your trips to the interviewees' houses, however, you notice that victims","        often live close to one another.  From this, you come to the","        conclusion that there must be some physical substance that","        carries the disease from one place to another, rather than the disease","        being spontaneously generated.","","        *if medicine < 9","            You name your hypothetical disease substance \"pneumahaeme,\" or \"air-blood,\"","            and proceed to write a scholarly paper about it.","            You send a few copies of your paper to practicing doctors, but without","            actionable advice, they don't quite see how it relates to their work, or","            why they should care if pneumahaeme exists.","","            The other scholars of medicine at the Musaeum take more interest,","            and vigorously debate you in the refectory about what the details","            of pneumahaeme might be.  Why couldn't it be an invisible one of the four","            humors, they ask?  And if it is one of those humors, which is it?  Blood?  Bile?","            Disappointingly, they treat your idea as just another bauble to toy with","            on the academic playground.","","            You find you simply don't have enough background in medicine to convince","            them of your theory right away.","            *if library_safe","                But at least your work will live on forever in the Great Library.","            Perhaps someone will extend the idea further.","","            And of course, you'll still be the first to have thought of the principle.","            Perhaps the details are incorrect; you believe in the basic idea.","        *else","            You surmise that the likely reason the substance is never seen is that","            it is very small, similar to Democritus's idea of atoms.  But while","            atoms are often inert, you think disease must be spread by","            particles that are themselves alive—and thus take time to multiply in","            the host, or can die in response to a shock.  You tell physicians","            in Alexandria to heat their tools to high temperatures to kill","            the organisms on them.","            ","            Soon, infections drop, and you are hailed as a hero for your revolutionary idea.","            Your paper detailing the likely attributes of \"germs\" is hotly","            debated and discussed among library and Musaeum scholars, but as the","            years pass and Alexandria's population is clearly healthier, your work","            becomes accepted as canon.","","            *if evil","                You are amused by this quirk of fate: that you, having","                originally planned to take over Alexandria with your schemes,","                should now be hailed as this hero.  But why not accept the","                accolades?  You spend the rest of your life continuing","                to build on your great discovery, inventing vaccines and","                cures.  To exert such power over thousands of lives is,","                in a way, to rule them.","","                It feels strangely good.","            *else","                Though your discovery will not save you from old age, you are pleased that your","                contribution will save many lives in the years to come.","            *set invented_germ_theory true","            *page_break","            *achieve germ_of_an_idea","","On the whole, you have had quite a good life.  But all good things","must come to an end.","","*finish Chapter 7: The Test of Time","","*label makeItSafe","*if defendedLocation = \"Great Library\"","    *set library_safe true","*if defendedLocation = \"palace\"","    *set palace_safe true","*if defendedLocation = \"Colossus\"","    *set colossus_safe true","*if defendedLocation = \"lighthouse\"","    *set lighthouse_safe true","*return","","","*label howDefended","How will you defend the ${defendedLocation}?","*choice","    *if (invented_optics and (not(usedOptics))) #I install the giant mirror assemblage Archimedes and I invented and set the mob on fire.","        *set usedOptics true","        You retrieve the mirror assemblage that you and Archimedes invented and","        install it on top of the ${defendedLocation}.  Just as the mob","        approaches the ${defendedLocation}, you swivel the mirrors to focus","        their bright beam of light on one of the rabble.  After a few moments, the unlucky man's","        hair catches fire, and his panicked screams set the rest of the mob","        on edge.  You move the beam to another man, and after a beat, his hair catches fire,","        too.  The mob panics and scatters, unnerved by your strange magic.","        The ${defendedLocation} is safe, though you leave your mirrors with","        one of its defenders in case the rabble should return.","        *gosub makeItSafe","","    *if (invented_fire_engine and (not(usedFireEngine))) #I hose down the mob with my fire engine.","        *set usedFireEngine true","        As the mob approaches, you pump your fire engine's central lever ","        and aim the hose at the rabble.  Water gushes from the hose and","        drenches the gathered crowd, who yell in surprise.  They retreat from","        the ${defendedLocation}, frightened by your strange magic.","        ","        You leave your fire engine with another defender of","        the ${defendedLocation}, in case the rabble should return.","        *gosub makeItSafe","","    *selectable_if (rhetoric >= rhetoricThresh) #I give an impassioned speech to dissuade the mob from attacking. (Requires Rhetoric: ${rhetoricThresh})","        \"Friends, let us not destroy this beautiful ${defendedLocation},\" you","        begin.  The crowd is enthralled as you ","        *if (defendedLocation = \"lighthouse\")","            talk about how the lighthouse serves as a shining symbol of hope for the world.","        *elseif (defendedLocation = \"Great Library\")","            begin telling a story from a play within the Great Library.","        *else","            tell the story of the brave engineers who built the ${defendedLocation}.","        When you are done, some people in the crowd clap, and the mob","        then disperses, ashamed of what they had been about to do.","        *set rhetoricThresh +2","        *gosub makeItSafe","    *selectable_if (medicine >= 4) #I will tend to the wounded who fall defending the ${defendedLocation}. (Requires Medicine: 4)","        The great mob surges to attack the ${defendedLocation}, but a few stalwart","        souls come to its defense.  You hang back, and each time a defender falls,","        you drag the brave fighter to safety and tend to their wounds.","","        With your help, the defenders of the ${defendedLocation} fight more","        valiantly, confident that someone will be there to help if they fall.","        After a long battle, the mob is driven off, and the battle won.","","        *gosub makeItSafe","        ","    *if ((not(usedBallista)) and (techne >= 4)) #I bring over ballistae to defend the ${defendedLocation}. (Requires Techne: 4)","        *set usedBallista true","        You bring some large ballistae from your workshop that can be used","        to defend the ${defendedLocation}.  The defenders of the ${defendedLocation}","        are delighted once you show them how the contraptions work.","","        When the mob comes to the ${defendedLocation}, it only takes a few","        shots from the ballistae to cause a panic—which is good, because","        your ammunition is limited.  The mob flees.  You leave the ballistae","        at the ${defendedLocation} to ward off any future rabble.","        *gosub makeItSafe","        ","    #I will fight, risking my life to save the ${defendedLocation}.","        *gosub makeItSafe","        You decide it is worth your life to ensure the survival of","        the ${defendedLocation}.  You find a sturdy knife, then take your","        place with the other defenders of the ${defendedLocation}.","","        When the mob does come, you find yourself quickly fighting tooth","        and nail for your survival.  A ragged man burns your face with his","        torch, but you stab him before he can make the burns any worse.","        An Egyptian man swings a scythe inches from your face, and you","        slash his cheek, sending him running as he clutches the wound.","        The torrent of foes seems endless.","","        The battle is winding down, and you are fighting the last few ruffians who","        have not realized their companions have fled,","        when one of rabble stabs you with a spear.  ","","        Immense pain blossoms from your belly as you sag to the ground,","        holding your hand to the wound.","        ","        [i]At least the ${defendedLocation} is safe[/i], you think.","        *set mc_dead true","        *set alexandria_falls true","        *set archimedes_dead true","        *finish Chapter 7: The Test of Time","    #On second thought, I think I want to run away.","        You're not a fighter, and you can't think of an option for the","        defense of the ${defendedLocation} that is likely to work.","        You reluctantly return to your home, where you wait out the night","        of riots.","","        *goto alexandriaFate","*return","","","*label mobKillsBerenice","All at once, the mob gains its courage and surges forward.","The last you see of Berenice is when she is pushed to the ground","and lost beneath the feet of the mob.","*set berenice_dead true","*if berenice_romance","    Your heart breaks: the one woman you ever loved is dead.","*return","","","*label nonpettyChanges","","*if idealist < 50","    Ptolemy IV has adopted your pragmatic attitude and applied it to the Great Library.  Scholars,","    he announces, will no longer have free room and board unless they can demonstrate the","    usefulness of their study to the kingdom.  Additional stipends, meanwhile, will be provided","    to those who provide service directly to the kingdom.  The engineers at the library, long","    treated as inferior to the philosophers, celebrate; the poets and playwrights groan.","*elseif elitist < 50","    Ptolemy IV has adopted your populist attitude and applied it to the Great Library.","    While the Serapeum was once the only branch of the library open to the general public,","    soon the Great Library will be open to all as well.  You regard this openness","    as a great success of your tutelage of Ptolemy.","*else","    Adopting your elitist and idealistic attitude, Ptolemy IV increases the funding for","    a program that hires the best and brightest scholars from afar, so that Alexandria can","    truly have the brightest minds in the world.  To free up the funds for this venture,","    Ptolemy tasks you with finding the worst scholars in Alexandria and firing them—a task","    you pursue with relish.","","*if elitist >= 50","    Regarding the Serapeum, Ptolemy IV sees no reason to have any branch of the Great Library open to the","    general public, on whom the knowledge would be wasted.  He restricts access","    to the Serapeum's scrolls, so that only scholars and the Serapis faithful","    can access them.","    *set serapeum_type \"elitist\"","*elseif idealist >= 50","    *comment idealist >= 50 and elitist < 50","    Regarding the Serapeum, it too shall remain a public branch of the Great Library,","    but with an enhanced educational focus.","    *if invented_auto_doors","        Instead of pretending your automatic doors are a miracle, the staff there will be","        instructed to explain their workings to any and all observers, as a way of building","        interest in knowledge and techne.","    *else","        Every night, a scholar will be commanded to deliver a talk of general","        interest to the public in the Serapeum.","    *set alexandria_knowledge +1","    *set serapeum_type \"idealist\"","*else","    Regarding the Serapeum, Ptolemy believes it should be a bookstore","    for the excess holdings of the Great Library, instead of a lending branch.","    You are tasked with performing an inventory of all the holdings of the","    library, finding the least useful or important scrolls, and setting appropriate prices for","    each.  It is an enormous undertaking, but it does help keep the library system in the black.","    *set alexandria_strength +1","    *set serapeum_type \"bookstore\"","","*if (idealist >= 50) and ((elitist < 50) or (not(tutoring_ptolemy)))","    *if (not(tutoring_ptolemy))","        Inspired by his own education at the Musaeum,","    Ptolemy IV also decides to fund a Musaeum education for every young citizen of Alexandria","    who can pass the entrance examination.  It is an enormous drain on the treasury, but","    Ptolemy believes it is worth it to have the most educated citizens in the world.","    *if egypt_unrest > 50","        (Egyptians, however, are still excluded.)","    *else","        *achieve universal_education","*elseif idealist >= 50","    Ptolemy IV also sets up a generous program whereby the most talented students at the Musaeum","    can be pulled out of school to be tutored directly by scholars from the Great Library, following","    the model of his own education.  The teachers at the Musaeum start to complain that they never","    get to teach the best students anymore, but you think the budding scholars appreciate the","    opportunity.","*else","    *if (not(tutoring_ptolemy))","        Uninspired by his own Musaeum education,","    *else","        Turning his pragmatic attention to the Musaeum,","    Ptolemy IV goes about dictating an entirely different curriculum of study to the","    institution.  Astronomy, geometry, and music are out, and the study of techne is given","    additional attention.  Poetry survives the cuts, you note.","","*if idealist < 50","    Finally, one of Ptolemy IV's less popular changes is to sell most of the animals in the","    Alexandria zoo to foreign traders, keeping only the most common and cheap animals for","    public viewing.  Children don't know the difference, he reasons.  But he does buy","    a crocodile for himself.","*elseif elitist >= 50","    Finally, one of Ptolemy IV's less popular changes is to close the zoo to the general public,","    opening it only to scholars from institutions like the Great Library.  He reasons that research might be","    easier if the general public is not always tromping through the zoo.  The scholars support","    his decision, but the regular citizens of Alexandria are less happy about it.","*else","    Finally, one of Ptolemy IV's most popular changes is to greatly expand the zoo,","    which he himself has always loved since he was young.  Besides the exotic animals of Africa,","    the zoo gains such exotic animals as monkeys from India, pandas from China, and polar bears","    from the Arctic Circle.  The polar bears don't last very long, but the king's heart was in","    the right place.","*return","","","*label pettyChanges","*if (not(sosibius_dead))","    Sosibius begins to increasingly isolate Ptolemy IV from his other advisors, including","    you.","*else","    *if evil","        You find that Ptolemy IV is every bit the easily manipulable puppet you'd hoped him","        to be.","    *else","        Despite the death of Sosibius, Ptolemy continues to lead a life of debauchery.","*if evil","    While the prince is busy partying, he leaves the administration of the kingdom to","    *if (sosibius_dead)","        you.  As you order around the prince's ministers, the power is intoxicating.","    *else","        Sosibius.  You seethe with jealousy at the advisor's power; Sosibius seems","        to be running much of the kingdom now.","    But the prince is still able to exert his power in petty, arbitrary ways.","*else","    When you try to get the king's attention, you are turned away at the palace gate,","    even as music drifts from a window, signaling Ptolemy's latest party.","    Meanwhile, young women in diaphanous gowns are allowed through; later at night, the sounds emerging","    from the palace include more than just music.","    *if agathoclea_lover","        Though Agathoclea remains Ptolemy's favorite mistress, he is not at all exclusive.","","At the Great Library, scholars are told to study and write commentary on Ptolemy IV's own","works.  Scholars who are honest about the works are executed.","","Ptolemy reasons that if his great-grandfather could invent a god, so can he:","himself.  He orders construction of a temple called the Ptolemarium,","a temple to himself located alongside the Serapeum.  Instead of offering","its visitors books, the Ptolemarium offers its visitors wine—so long as","they bow down before the giant statue of Ptolemy IV.","*if invented_auto_doors","","    On learning of your automatic doors for the temple, Ptolemy has them moved to his private","    bedroom, and he instructs you to begin making one for every door in the palace.","    You suppose it is nice that he appreciates you, although you wish that Ptolemy would","    refrain from his amorous adventures while you are in the same room.  (This problem is not","    limited to the bedroom.)","","At the Musaeum,","*if (not(tutoring_ptolemy))","    Ptolemy's least favorite former teachers are executed.","*else","    the children are made to memorize poems Ptolemy wrote when he was their age.","","And Alexandria's zoo is relocated to behind the palace and made private.  Now,","Ptolemy has all the animals, and he need not share.","*page_break","","*return","","","*label ptolemy_3_changes","Under the continued reign of Ptolemy III, Alexandria remains prosperous.  Ptolemy III hires","more scholars from afar to come work at the Great Library.  He has gained a renewed interest","in supporting the study of","*temp bestStat \"techne\"","*if medicine > techne","    *set bestStat \"medicine\"","*if (rhetoric > medicine) and (rhetoric > techne)","    *set bestStat \"rhetoric\"","${bestStat}, thanks to your own research, and he invests heavily in new scholars who can","work in this","*if bestStat = \"rhetoric\"","    timeless","*else","    unconventional","field.  The Serapeum, zoo, and Musaeum all prosper, getting new books, animals, and teachers,","respectively.","","*if ptolemy_4_dead","    But you can tell that ","    *if berenice_dead","        the deaths of Ptolemy IV and Berenice have","    *else","        the death of Ptolemy III's son has","    affected him greatly.","    *if ptolemy_3_romance","        Still, your romance provides the king with a great deal of comfort when his moods","        turn dark.","    *else","        The old man now seems dark and brooding as he holds","        *if berenice_dead","            court.","        *else","            court, and no amount of consolation from Berenice seems to lift his funk.","        Ptolemy III has several other possible heirs, but he had built up a dream around","        Ptolemy IV, and this outcome is most disappointing to him.","*else","    Without the throne, Ptolemy IV seems restless, unable to quite decide what to do.","    *if agathoclea_lover","        One thing that is going well for the young man, however, is his romance with","        Agathoclea.","        *if sosibius_dead","            Without Sosibius pulling the strings, Agathoclea is now free to love","            Ptolemy IV unconditionally, and you are glad for them.","        *else","            Sosibius and his friend Agathocles seem to still hang about and exert","            some influence on Agathoclea and Ptolemy, but without the younger Ptolemy","            on the throne, their involvement is moot.","    *else","        *if sosibius_dead","            Without Sosibius around, the wind seems to have been taken out of Ptolemy IV's","            sails.  Regardless of the man's other failings, he was the closest thing to a longtime friend ","            that Ptolemy had, besides yourself.  You suppose you feel slightly","            sorry for the boy, even as you are glad Sosibius is gone.","        *else","            At court, Sosibius still hangs around the boy like a shadow, but the older man's patience","            seems to be wearing thin.  You worry that he may try something again.","","    Ptolemy's main interest","    *if agathoclea_lover","        besides Agathoclea","    is still poetry, and he often comes to you for advice on his latest love poem.","    His work is uniformly terrible.  But you dole out the criticism in small, digestible bits,","    and you think that little by little, he is improving.","","*if ptolemy_3_romance","    As for you and Ptolemy III,","    *if male","        you have heard that there are cults in Alexandria that will","        marry two men, but Ptolemy will have none of it.","        ","        \"Marriage is about political power and babies,\" Ptolemy tells you one","        day in bed.  \"If it happens to include love, that is just a happy accident.\"","","        \"Are you saying you love me?\" you ask, because Ptolemy avoids the word with you.","        It rankles, because you know he has said it of Berenice.","","        \"I do,\" he says.  \"I will love you until the end of my days, my librarian.","        Are you happy now?\"","","        In truth, you don't really care about marriage.  That's just not how","        men in love work in Alexandria.  It's rare enough to find a man as remarkable","        as Ptolemy, and you are glad he's yours.  \"I am,\" you tell him.","","        \"On the other hand, we could tell that","        *if (not(serapis_believed))","            new","        priest at the Serapeum to marry us.  Assess his reaction, see","        if he's willing to put your words in Serapis's mouth.\"","","        Ptolemy III looks delighted.  \"You are clever, aren't you.  I do","        like that idea more than all the miserable strumpets the nobles","        are putting forth.  For Serapis, then.\"","","        Indeed, the priest of Serapis is entirely willing to marry the two of","        you.  The ceremony draws the attention of many men around Alexandria","        who are eager to make their ties to each other more official,","        and the cult of Serapis is all the stronger for it.  But mostly,","        you are happy that you are now officially married to Ptolemy.","        *set married_p3 true","","    *else","        he does eventually agree to marry you, shortly after ${child_name}'s fifth","        birthday.","        *gosub p3_wedding","","*return","","","*label convinceArchimedes","*page_break","On an early-morning fishing expedition, you attempt to convince Archimedes","to come back with you to Alexandria.","","\"I know you love Syracuse,\" you say, \"but what about your love for an old friend?","Surely that is worth something.\"","","*if (arch_rel >= 55) or (rhetoric >= 6)","    Archimedes's look softens.  \"Yes, of course.  That should mean something, after all these","    years.  We should make the most of our time together while we have it.  If I were to find","    one day you had passed away, far across the water, I should think myself a fool.\"","    He nods resolutely.  \"I will tell King Hiero my service to him is at an end, for now.\"","","    You smile and hug Archimedes.  Despite your friend's usually gruff demeanor, this hug lasts","    until even you wonder when you ought to break it off; the only sounds are the distant","    cries of seabirds, and the quiet lapping of the waves, and the beating of your old heart.","","    *set withArchimedes true","*else","    Archimedes gives you a look askance, then casts his line again.","    \"Still obsessed with greatness, ${nickname}?","    I'm an old man.  Let me live out life in the home I love.\"","    ","    You find you're unable to convince Archimedes to return with you to Alexandria.","    Your friendship has drifted apart over the years, and you cannot hide this fact","    from astute Archimedes.","","*page_break","","*return","","*label skip_to_nefertari","You run through the hallways of the palace looking for Nefertari.","At first, all you can see is carnage: murdered guards, the slashes","across their bellies more like the work of assassins than an unruly mob.","But soon, you hear a familiar voice.","*goto nefertari_is_here","","","*label berenice_and_kid","*comment As quickly as possible, try to set up how the rest of the","*comment heirs die and Berenice and MC get married.  Go!","","*if not(ptolemy_3_dead)","    *bug","*if ptolemy_4_dead","    *bug","*if berenice_dead","    *bug","*if not(kid)","    *bug","By the time you arrive at the palace, it is already a blazing inferno.","Flames dance along every tower and parapet.","The mob must have decided to torch the place instead of fighting its way","in.  Horrified, you realize that Berenice and ${child_name} may be","trapped inside, if they are not dead already.  Ptolemy IV and his","siblings are probably trapped inside as well.","","You know where Berenice and Ptolemy IV can be found.  Their rooms","are on opposite sides of the palace.  Ptolemy's siblings,","the other heirs to the throne, live elsewhere still, but you discount","them.  There is no way you would save them instead of your longtime","pupil, your lover, or your son.","","It is not lost on you that if Ptolemy and his siblings die,","Berenice is probably next in line to the throne, followed by","${child_name}.  ${child_name} could be king.","","*if invented_fire_engine","    Then it occurs to you:  one of your fire engine prototypes is","    permanently stationed next to the palace.  Whoever was","    supposed to operate it is probably dead by now.  You could save","    everyone.  All the heirs.","","    And ${child_name} will never be king.","","*choice","    #I save Berenice and ${child_name}.","        *if invented_fire_engine","            You [i]could[/i] save them all.  But in the end, you cannot resist the allure of power.","        *else","            Your choice is clear.  You save your lover and child.","","        You race into the palace, fight your way through the flames, and find Berenice in","        the nursery, wielding a knife against","        *if egyptRevolt","            an Egyptian swinging a khopesh sword","        *else","            a sword-wielding, shield-bearing hoplite","        while holding ${child_name} in her other arm.  With neither reach nor a second free hand,","        no wonder Berenice could achieve no better than a stalemate.  The man hasn't noticed you yet.","","        You ponder for a moment whether Rhetoric, Medicine, or Techne would serve you best here,","        then just decide to jump on the swordsman's back and tackle him to the ground.","        It works fabulously, and Berenice finishes the job by quickly slicing the man's throat.","","        \"He did not know when to quit,\" Berenice says testily.  \"Let's get out of here.\"","","        You, Berenice, and ${child_name} all escape the palace just before a major structural","        support gives way, collapsing half the place.  The half where Ptolemy and his","        siblings would have been.","","        \"Oh, gods,\" Berenice says forlornly.  \"My babies.\"  A tear appears in her eye.","        \"I should have saved them.  I was never there for them, and now…\"","","        \"It's not your fault,\" you say, hugging her close.  \"It's mine.\"","","        *set ptolemy_4_dead true","","        Berenice gives you a serious look.  \"You do realize that we're the royal family now,","        right?  We're the heirs.\"","","        \"Well, you two might be,\" you say, and you regret the biting words the moment","        they leave your mouth.  \"I'm sorry.\"","","        \"No, you have a good point,\" Berenice says.  She takes your hand.  \"Do you take","        me to be your lawfully wedded wife?\"","","        *if not(male)","            *bug","","        You chuckle a little.  \"Of course.  You can perform marriages.\"","","        \"Say 'I do.'\"","","        \"I do.\"","","        Berenice nods.  \"Welcome to the royal family, ${name}.  Your first royal","        responsibility is helping me put down this rebellion.  Think you can do that?\"","        *achieve royal","        *set married_berenice true","        *set royal_heir true","","        \"Yes, Your Highness,\" you say.","","        \"Don't call me that. We don't call each other that.\"","","        *comment We don't quash the good ending based on alexandria_strength here","        *comment because the ending is obscure enough (I think?).","        You and Berenice do put down the rebellion that night, thanks to a combination of","        your","        *if techne > rhetoric","            terrifying inventions","        *else","            eloquent speeches","        and Berenice's ability to mobilize the loyal guards.","","        And when you wake up the next morning, you are King ${name}.","","        So that's rather nice.","","    #I save Ptolemy IV.","        As much as you love Berenice, you cannot turn your back on the young man","        you worked so hard to raise.  He is, if anything, more of a son to you than ${child_name}.","","        You enter the palace and fight your way through the flames to the bedroom of Ptolemy IV.","        You find that some","        *if egyptRevolt","            Egyptian rebel","        *else","            traitorous hoplite","        has pinned Ptolemy to his bed with a spear.  The king is quite bloody but still alive,","        and gawks at you in surprise when he sees you enter.","","        \"${name}?\" he says.  \"You would come for me?\"","","        \"I came to Alexandria to serve you,\" you say.  \"And I will see this through to","        the end.\"  You pull the spear","        *if medicine >= 3","            free and administer what first aid you can.","        *else","            free.  The boy's wound bleeds more emphatically, but there's little you can do","            about that.","","        You throw Ptolemy over your shoulder and run out of the building, leaping through a final wall","        of fire in your escape.  You and Ptolemy cry out in pain, and you fall to the ground.","        You are too old to be leaping through walls of fire.  You feel you can do nothing now","        but lie here and pant.","","        After a moment, Ptolemy rises.  Examining your state, he then throws you over his shoulder.","","        \"Ptolemy!\" you say.  \"You're in no condition to carry me!\"","","        \"I never did one nice thing for you, ${name},\" Ptolemy IV says, tears in his eyes.","        \"Let me do this.\"","","        \"The mobs are looking for you, Ptolemy!\" you insist.","","        \"If they see a man helping another man, they won't know it's me,\" he says, and he sniffles.","","        You want to tell him,","        [i]Fine, but don't leave yet!  Berenice is in there!  My son is in there![/i]  But","        you know what he would do in his present state.  He would enter and die like a fool,","        and your sacrifice would be for nothing.","","        *set berenice_dead true","","        So you let the prince carry you back to the Musaeum, where doctors treat your burns.","        And in the end, Ptolemy is right.  No one expects the prince to be carrying a wounded old","        man.  The mobs fail to find the king, the revolution founders, and Ptolemy lives to be older","        and wiser.","        *set alexandria_falls false","","    *selectable_if (invented_fire_engine) #I save everyone. (Requires Invention: Fire Engine)","        *set idealist %+ 20","        You go to the fire engine by the side of the palace, and pump the piston","        until water comes gushing out.  Steam hisses from the palace as you wave the","        water jet this way and that.  You wheel the fire engine a little to the left, and repeat","        the process.  Slow and methodical: that is how one becomes a great engineer.","        Nevermind the voice in your mind screaming that your lover and child may be","        dying even now.","","        But they do not die.  When you are done, Berenice emerges from the palace","        carrying ${child_name} in her arms.  She gives","        you an intense hug and a thankful kiss.  Trailing Berenice are Ptolemy IV and","        his brothers and sisters:  Magus, Lysimachus, Alexander, Arsinoe.  Ptolemy IV","        is clutching an intense spear wound and breathing heavily, but he is standing.","","        \"I have fallen in love with a magician,\" Berenice declares.","","        \"Natural philosopher,\" you correct.  \"There is an important distinction.\"","","        *if egyptRevolt","            \"Those Egyptians will pay for this night!\" Ptolemy says angrily.","        *else","            \"Those traitorous guards will pay for this night!\" Ptolemy says angrily.","","        \"Good to see you too, Ptolemy,\" you say.","","        Abashed, the young man says, \"I mean, thank you, ${name}.\"","        *set petty %- 10","","        *if alexandria_strength >= 4","            The revolt is put down in the end, and Berenice decides it is high time","            for you and she to get married.","            *if (not(male))","                (There are Alexandrian cults that will do that for women.)","            *if petty >= 50","                Ptolemy IV continues to rule somewhat unwisely, but Alexandria","                is still a fine environment for ${child_name} to grow up in.","            ","                You never wanted to be king anyway.","            *else","                Ptolemy IV rules with a little more mindfulness of","                *if egyptRevolt","                    how he treats Egyptians,","                *else","                    how he appears to the common people.","                but of course he is still not perfect.","                ","                You suppose you and ${child_name} would not have been, either.","                ","            *set married_berenice true","            *achieve royal","            *set alexandria_falls false","        *else","            *set alexandria_falls true","            The revolt succeeds in taking Alexandria, but it does not take the lives","            of you, Berenice, or any of the children.  You all take refuge","            in the Seleucid kingdom to the east, where the king promises","            to retake Alexandria for Ptolemy IV with your help.  Ptolemy IV","            is interested but inept at raising support, and the proposition goes nowhere.","            Meanwhile, you start","            a successful business in the capital city of Antioch, based on your inventions.","            You and Berenice never marry, but you are certainly very fond of each other","            until the end of your days.","","            You were sad to leave Alexandria in the end, but happy to have saved","            some of its greatest treasures.","","*finish Chapter 7: The Test of Time","","","*label ptolemy_and_kid","*comment same song and dance as above, except with Berenice and P4 both","*comment dead, we pretty much have to do it over.  (Woo, word count...)","*if not(ptolemy_4_dead)","    *bug","*if ptolemy_3_dead","    *bug","*if not(berenice_dead)","    *bug","*if not(kid)","    *bug","*if not(married_p3)","    *bug","By the time you arrive at the palace, it is already a blazing inferno.","Flames dance along every tower and parapet.","The mob must have decided to torch the place instead of fighting its way","in.  Horrified, you realize that your beloved Ptolemy and ${child_name} may be","trapped inside, if they are not dead already.  ${child_name}'s","half-siblings are probably trapped inside as well.","","You know where Ptolemy III and ${child_name} can be found.  The throne room","and the nursery are on opposite sides of the palace.  Berenice's children,","the other heirs to the throne, live elsewhere still, but you discount","them.  There is no way you could save them instead of your","your lover or your son.","","It is not lost on you that if Ptolemy and Berenice's children die,","${child_name} is probably next in line to the throne.","","*if invented_fire_engine","    Then it occurs to you:  one of your fire engine prototypes is","    permanently stationed next to the palace.  Whoever was","    supposed to operate it is probably dead by now.  You could save","    everyone.  All the heirs.","","    And ${child_name} will never be king.","","*choice","    #I must save my husband, Ptolemy III.  He is in greater danger in this rebellion.","        After an agonizing moment, you decide to ensure your husband is safe first.","","        You race past burning tapestries and leap over walls of flame to reach","        the throne room.  There, Ptolemy III is circling","        *if not(egyptRevolt)","            *bug","        *if (not(nefertari_dead))","            the pirate queen Nefertari,","        *else","            an Egyptian rebel,","        each fighter just out of range of the other's spear.","","        \"${name}, get out of here!\" Ptolemy III says urgently.  \"Save the children!","        Save ${child_name}!\"","","        \"${name}?\"","        *if nefertari_dead","            The Egyptian rebel","        *else","            Nefertari","        turns to look, giving Ptolemy III the opportunity he needs.  He pounces","        on the","        *if nefertari_dead","            rebel,","        *else","            pirate queen,","        knocking the Egyptian to the ground, and drives his spear through","        *if nefertari_dead","            his","        *else","            her","        chest.","","        *if (not(nefertari_dead))","            \"You were supposed…to save…${child_name}…\" Nefertari croaks to you.","            She coughs up blood and dies.","            *set nefertari_dead true","","        \"Come on,\" Ptolemy III says.  \"Let's get ${child_name}.\"","","        \"What about Berenice's other children?\" you say.","","        Ptolemy gives you a puzzled look.  \"${child_name} is just a baby.","        Come on.  Let's go.\"","","        With Ptolemy's help, you manage to save ${child_name},","        and all of Berenice's children as well.","","        Without Nefertari's leadership, the Egyptian revolution stands no chance","        against Ptolemy III.  The revolt is crushed that night, and your throne is safe.","","        *if (not(sosibius_dead))","            Meanwhile, Sosibius seems to have disappeared completely.  Whatever plans","            he had were dashed for good that night.","        *page_break","        Within a month, Ptolemy names ${child_name} as heir to the throne.","","        \"I don't understand,\" you say to Ptolemy when the two of you have gone to bed.","        \"The other children are older.  They must have a better claim to the throne.\"","","        \"None of them are the queen's son,\" he says simply, and then his face clouds.","","        \"I know you still miss Berenice sometimes,\" you say.  \"You're sure you","        don't want one of hers on the throne instead?\"","","        \"No,\" Ptolemy III says firmly.  \"I loved Berenice, but she still killed a king","        when she had the chance.  You saved one instead.  That is the blood I want","        in the next ruler of Alexandria.\"","","        You and Ptolemy rule happily together until ${child_name} is of an age","        to corule with his father.  Together, you ensure that Alexandria","        remains a city of wonders.","        *set royal_heir true","","        *finish Chapter 7: The Test of Time","        ","    #I save my son, ${child_name}.","        *if invented_fire_engine","            You could save everyone.  Or ${child_name} could be king.","","        You race into the burning palace, running past burning tapestries and bounding","        over flaming rugs, until you reach the royal nursery.  You pull wailing ${child_name}","        from his cradle, and begin to run out the way you came, when the ceiling","        collapses in front of you and fiery rubble blocks your exit.","","        *page_break","","        *temp got_arsinoe false","        *if (not(sosibius_dead))","            \"${name}.  My old nemesis.\"","","            You whirl to see old Sosibius before you, holding a dagger in one","            hand and Berenice's youngest, Arsinoe, in the other.","            \"Do you know of a way out?\" you ask.  \"Which exits are blocked?\"","","            \"I have always had a ladder in my room, just in case I needed to make","            a quick getaway,\" Sosibius says.  \"But there's something I need to","            do first.\"  He lunges at ${child_name} with the dagger,","            but you quickly turn to shield the child with your shoulder,","            and he stabs you instead.  Pain lances through your shoulder.","","            \"You're mad,\" you say.","","            \"We both have the same plan!\" he snarls.  \"But soon only one of us","            will be holding an heir to the throne!\"","            *comment uh, this was supposed to be a clone of the other path,","            *comment but now I like where this is going?","            *choice","                #I work out a deal with Sosibius: my child lives, but Sosibius becomes regent.","                    \"You win,\" you tell Sosibius.  \"Let ${child_name} live,","                    and you can be regent.\"","","                    \"Excellent,\" Sosibius says.  He beckons with his knife.","                    \"Come with me.  I have some legal documents for you to sign.\"","","                    \"You have them already drawn up?\" you say, surprised.","","                    \"My dear,\" Sosibius says, \"I have always played the long game.\"","","                    *set ptolemy_3_dead true","                    ","                    That night, Ptolemy III and Berenice's other children die in the fire,","                    while Arsinoe quietly disappears shortly thereafter.  The revolution","                    abates almost as quickly as it began, as if the whole point were to","                    kill most of the royal family and nothing more.","","                    In time, ${child_name} does become king, but only after an extensive","                    regency by Sosibius that drains the treasury and sends Alexandria","                    into a slump it will have trouble recovering from.  You remain","                    *if head_librarian","                        Head Librarian","                    *else","                        a librarian","                    and the mother of the king, but ${child_name} falls under the thrall","                    of Sosibius, and the empire is never again as strong as it was.","","                    *set alexandria_falls true","                    *finish Chapter 7: The Test of Time","","                #I risk Arsinoe and ${child_name}'s lives to attack Sosibius.","                    *comment Largely a paper tiger.  Who picks the riskiest option?","                    *comment Someone who really wants to see it succeed.","                    Your anger gets the better of your fear, and you move to punch","                    Sosibius in the face.  To the surprise of both of you, your","                    blow connects!  Sosibius is sent sprawling to the floor.","                    His grip loosened on Arsinoe, you grab the child in your free","                    hand and run for Sosibius's room.","                    *set got_arsinoe true","","                #I risk ${child_name}'s life to charge past Sosibius.","                    \"Coming through,\" you say, and you charge past Sosibius.","                    Though he slashes at you with the dagger, causing pain to","                    blossom along your arm, you are soon past him.","                #I call for Ptolemy's help, hoping he is still in the palace.","                    \"Ptolemy, help!\" you call out.","","                    Sosibius laughs.  \"What have you become, librarian?  They told","                    me you could do everything, and now you call meekly for Ptolemy's","                    help?  You should be ashamed.\"","","                    And with that, Sosibius slashes your neck with the dagger.  ","                    Immense pain roars through your being as blood gushes everywhere.","                    You collapse to the ground, and Sosibius takes ${child_name} from","                    your nerveless hands.","","                    Whatever happens next, you will not be there to see.  But you","                    are certain it will not be good for ${child_name} or Alexandria.","                    *set mc_dead true","                    *set alexandria_falls true","                    *finish Chapter 7: The Test of Time","","                #I offer to marry Sosibius, satisfying his ambition once and for all.","                    \"You need not do this,\" you tell Sosibius.  \"Marry me.\"","","                    Sosibius blinks.  \"What?\"","","                    \"You can marry a queen, take control of ${child_name}, have it all,\"","                    you say.  \"Your claim to power will be cemented once and for all.\"","","                    Sosibius frowns, suspicious.  \"What's in it for you?\"","","                    \"This is a truce,\" you say.  \"Deal?\"","","                    Sosibius considers.  \"And would we…you know…\"","","                    \"Not on your life,\" you say.","","                    Sosibius shrugs.  \"I'm sure I can find other ways to satisfy that","                    particular hunger.  It is done.\"","","                    *set married_sosibius true","                    *set royal_heir true","","                    *set ptolemy_3_dead true","                    Indeed, Berenice's other children and Ptolemy III perish in the fire","                    that night, but you and Sosibius combine your wits to retake the","                    city from the revolutionaries.","                    ","                    In time, you keep your word and marry Sosibius.  You can't say","                    you're enthusiastic about the plan, but ironically, you think it's the best","                    way to keep the man from bothering you again.","","                    *page_break","                    The funny thing about Sosibius is that, in his own way, he is as easy","                    to manipulate as Ptolemy IV ever was.","","                    As queen, you raise ${child_name} to be a good ruler.  Meanwhile, now that","                    Sosibius has all the wealth he could want,","                    he has grown lazy.  He spends all his time and money on women and good","                    food, and has lost interest in the art of manipulation.  You encourage","                    this behavior.  You think of the funds that go toward","                    Sosibius as defending Alexandria: they keep him out of trouble.","","                    Sometimes, one must make sacrifices for the really important things.","                    *set alexandria_falls false","                    *finish Chapter 7: The Test of Time","            ","        *comment escape through Sosibius's old room","        You search the burning palace until you find Sosibius's","        *if sosibius_dead","            old room, which the palace staff have always balked at finally cleaning out.","        *else","            room.","        Sosibius is apparently a hoarder, and piles upon piles of scrolls","        are raging with flame.  But Sosibius always thoughtfully kept a path free","        to the window, where an unburned rope ladder awaits you.  You push out the","        *if got_arsinoe","            ladder, set Arsinoe down so that you have a hand free to climb,","        *else","            ladder","        and climb out, holding ${child_name} in one arm.","        *set ptolemy_3_dead true","","        *if got_arsinoe","            Will you go back for Arsinoe?  Her claim to the throne may be stronger than ${child_name}'s.","            *choice","                #Yes, it is only right.","                    *set idealist %+ 25","                    You sigh.  What does it matter whether ${child_name} is king, if you are responsible","                    for a child's death?","","                    \"Stay right there,\" you tell ${child_name}, and you quickly retrieve Arsinoe from","                    the burning palace as well.","","                    *if library_safe","                        You protect both children in the Great Library through the night.","                    *else","                        You protect both children at a scholar friend's house through the night.","                    With the palace apparently burned down, the revolution peters out without a clear","                    target.","                    ","                    In the morning,","                    you discover what you had feared:  Ptolemy III and Berenice's children perished in the fire,","                    and the revolution was apparently successful.","                    *if egyptRevolt","                        *if nefertari_dead","                            An Egyptian","                        *else","                            Nefertari","                    *else","                        A high-ranking officer among the traitors","                    now claims to rule Alexandria.  But when word gets out of your story, how","                    you saved Arsinoe instead of your own child despite the chance at the crown,","                    a counter-revolution quickly ensues.  You become queen again and rule","                    Alexandria.","","                    When she is old enough, you ask Arsinoe whether she would like to be the heir anyway.","","                    \"No, thank you,\" she says, and that is how ${child_name} becomes heir to the throne.","                    *set royal_heir true","                    *finish Chapter 7: The Test of Time","                #No, I can't leave ${child_name} alone again.","                    *set idealist %- 15","                    You cringe at the thought of the dying child, but you can't bear","                    abandoning ${child_name} again.  You leave the wailing child in the palace.","                #No, I will see ${child_name} become king.","                    *set idealist %- 25","                    This is how politics works in Alexandria, you think.  Last heir standing.","                    You ignore Arsinoe's screams and flee the palace.","        ","        You stay the night at","        *if library_safe","            the Great Library.","        *else","            a scholar friend's house.","","        In the morning, you discover that the palace has burned thoroughly, and Ptolemy III and","        Berenice's children are presumably among the dead.","        *if (not(sosibius_dead))","            It is little consolation, but you think Sosibius probably did not escape the fire,","            either.","            *set sosibius_dead true","","        Though the revolutionaries briefly claim they have taken Alexandria, when","        you emerge from hiding, a counterrevolution puts you on the throne instead,","        with ${child_name} as heir.","","        *set royal_heir true","        *if library_safe","            With the palace burned down, you find you need a new base from which to rule Alexandria","            while a replacement is constructed.","                ","            So of course, you choose the Great Library.","        *else","            You have many priorities as ruler, but you know your first order of business.","","            \"Divert all necessary funds to rebuild the Great Library,\" you tell your ministers.","            \"I will not have ${child_name} inherit a kingdom without books.\"","            *set library_safe true","","        *set alexandria_falls false","        *finish Chapter 7: The Test of Time","","    *selectable_if (invented_fire_engine) #I save both. (Requires Invention: Fire Engine)","        What good would power be if your husband were dead?","","        *set idealist %+ 20","        You go to the fire engine by the side of the palace, and pump the piston","        until water comes gushing out.  Steam hisses from the palace as you wave the","        water jet this way and that.  You wheel the fire engine a little to the left, and repeat","        the process.  Slow and methodical: that is how one becomes a great engineer.","        Never mind the voice in your mind screaming that your lover and child may be","        dying even now.","","        When the flames are out, you race inside.  In the royal nursery, you find ${child_name}","        wailing like mad.  \"Shh, shh,\" you say, picking him up.  \"It's all right, we're going to go see","        Daddy.\"","","        Ptolemy rushes into the nursery behind you.  \"Oh good, you're here,\" he says,","        panting.  \"If all is well, I need to check on my other children.\"","","        \"You came to see ${child_name} first,\" you say, touched.","","        \"He [i]is[/i] the baby,\" Ptolemy says sensibly.  \"Did you doubt I loved him","        as much as the other children?\"","","        \"I was foolish,\" you say.  \"Let us go check on the others, together.\"","","        Berenice's children are all right as well: Magus, Lysimachus, Alexander, Arsinoe.","        You form a little train as you gather them from their rooms.","","        \"Children, whoever is the heir tonight is in great danger,\" Ptolemy III says.","        \"I cannot wish that burden on any of you.  That is why I am naming ","        ${child_name} the next in line to the throne, with ${name} regent.  I will tell all the","        palace staff.\"  The children nod numbly; they had become used to the idea of","        not being heirs while Ptolemy IV was alive.","","        Ptolemy III turns to you.  \"And I trust you to be resourceful enough to escape","        the city tonight.  Even if I die, I am sure you will be able to muster an army","        and retake the city.  You have always been the most clever woman I will ever know.\"","","        *if (not(library_safe))","            \"But the Great Library is still in danger!\" you say.","","            \"You can rebuild when you return,\" Ptolemy says.  \"Go!\"","","        \"Yes, my liege,\" you say.  Your head is spinning.  ${child_name} will one","        day be king.","        *page_break","","        *set royal_heir true","        You escape Alexandria that night with ${child_name}.","        But the revolution does fail; Ptolemy III is able to muster the","        *if guardsRevolt","            loyal members of the","        royal guard and beat back the","        *if guardsRevolt","            traitors.","        *else","            Egyptian mobs.","        You return to the palace and find yourself more and more busy with the duties","        of being queen and regent.","        *set alexandria_falls false","","        *if (not(library_safe))","            The Great Library sustained much damage that night, and many scrolls burned;","            it would be centuries before its collections recovered.","            *set alexandria_knowledge -2","","            But you're relatively certain: the next king will value knowledge highly.","        *else","            When you visit the Great Library again, you are treated as a hero","            for having helped protect it on the night the fires raged.","            \"How do you do it?\" one scholar asks.  \"How do you always manage to","            find the time to do everything?\"","","            \"I don't know,\" you say.  \"I just do what must be done, one thing","            after the other.\"","","","*finish Chapter 7: The Test of Time","","*label p3_wedding","Ptolemy III promises that your wedding celebration will include a parade","that is every bit as elaborate as the one that was thrown for Berenice.","You think little of this until you see the parade.","","At its head is a wagon twenty-one feet high and twelve feet wide,","drawn by one hundred eighty men, and bearing statues of you and Ptolemy III","that are fifteen feet high and that wave to the crowd by themselves,","the motion presumably conveyed by gears from the wheel axles.  Then comes","the menagerie:  twenty-four chariots drawn by four elephants each, twelve","chariots drawn by antelopes, six chariots drawn by ostriches, eight","by zebras, thirty by lions, and fifteen by buffalo.  As if this were","not elaborate enough, the trailing wagon of the parade has an","enormous cask of wine that slowly, wastefully pours its contents into the","street.","","On the wagon in the middle of the parade, you murmur to Ptolemy III,","\"How much did all this cost?\"","","\"About 2,700 talents,\" he says, and when he notices your","shocked expression, he adds, \"I know!  My father's coronation was nearly","identical, save that we gained some lions and lost some ostriches, ","and his was a mere 2,239 talents and 50 minae.\"","","The sum spent on your wedding could employ about a thousand librarians","for a year.","","\"Look happy, dear,\" Ptolemy III says, and he turns to wave at the crowds.","*page_break","*set married_p3 true","*achieve royal","*return","","*label nefertari_vs_p3","You find Ptolemy III in the throne room, where he is facing off","against Nefertari.  In one hand the king bears a heavy-looking bronze shield","emblazoned with the crest of Alexandria, an eagle bearing a lightning bolt;","with his other hand, he jabs at Nefertari with a long hoplite's spear.","Nefertari dances out of the way of a jab and brings her curved sword","down on Ptolemy, but the king raises his shield to block the blow in time.","The bodies of the two leaders' personal guards are strewn about the throne","room; only Ptolemy III and Nefertari remain.","","*if ptolemy_3_rel >= 50","    \"${name}, leave us!\" Ptolemy III shouts.  \"You are no fighter.\"","*else","    \"${name}, leave us!\" Ptolemy III shouts.  \"And never show your face","    in the palace again.\"","He jabs at Nefertari, but she parries the blow.","","*if nefertari_rel >= 50","    \"${name}, I have no quarrel with you,\" Nefertari says, continuing to","    swing her sword at the king, who blocks the blows.  \"In fact, I plan","    to","    *if head_librarian","        keep you as Head Librarian when the revolution is complete, so you","        should have no quarrel with me, either.\"","    *else","        make you Head Librarian when the revolution is complete, in light","        of your friendliness to the Egyptian people.  So you should have","        no quarrel with me.\"","*else","    \"Leave now, librarian, or I will slit you from groin to gullet,\"","    Nefertari says.","","How will you interfere with this duel?","*temp helpingNefertari false","*choice","    *selectable_if (medicine >= 6) #With a poisoned dagger, I stab Nefertari.  (Requires Medicine: 6)","        You coat your dagger with some poisonous herbs; then, while Nefertari","        is distracted by an attack from Ptolemy III, you stab her in the back","        with the poisoned dagger.","","        She freezes, and then her body collapses to the ground, spasming.","","        *if nefertari_rel >= 50","            \"I never should have trusted you,\" she pants.","        *else","            \"You win, librarian,\" she pants.  \"You win.\"","        ","        Nefertari dies.","        *set nefertari_dead true","","        *goto helping_p3_end","","    *selectable_if (medicine >= 6) #With a poisoned dagger, I stab Ptolemy III.  (Requires Medicine: 6)","        While Ptolemy III is distracted with a flurry of blows from Nefertari,","        you stab him in the back with a poisoned dagger.","","        Within seconds, the king's body seizes up, and he collapses to the","        ground.  He begins to convulse.","","        *if ptolemy_3_rel >= 50","            \"${name}!\" Ptolemy III says.  \"How could you…?\"","        *else","            \"I told Berenice you were a mistake…\" Ptolemy III says.","        He dies.","        *set ptolemy_3_dead true","","        \"Well!\" Nefertari says.  \"I appear to owe you a debt of gratitude,","        ${name}.  Would you like to be Head Librarian in the new Alexandria?\"","        *set nefertari_rel %+ 20","","        *goto agreeNefertari","    *selectable_if (rhetoric >= 6) #I convince Nefertari to spare Ptolemy III and make him an advisor.  (Requires Rhetoric: 6)","        \"Nefertari!\" you shout.  ","        *if nefertari_rel >= 50","            \"You are willing to make me Head Librarian for my experience.","        *else","            \"You will no doubt need many civil servants to remain in","            the government when you take over.","        Why not benefit from the experience of Ptolemy III as well?","        Make him your advisor.  Take his throne and his knowledge, too.\"","","        \"That is a delightful idea,\" Nefertari says, and with one powerful","        stroke, she bats the king's spear out of his hand.  Holding her","        sword at the king's nose, she says, \"What say you, king?  Willing","        to advise me as I learn the ropes?\"","","        \"Take the deal, Ptolemy,\" you urge.  \"I know you may be tempted","        to fall on that sword, but the future of Alexandria","        depends on your decision.\"","        ","        Ptolemy III sighs.  \"Very well.  I shall be your thrall.  So be it.","        My father would be mortified, but he would also want Alexandria","        to continue.\"","","        *if ptolemy_3_romance","            You breathe a sigh of relief.  You honestly were not sure at all","            whether your lover would agree to the deal.","        ","        By morning, Nefertari's forces have taken control of the city.","        In recognition of your cleverness, Nefertari makes you Head Librarian","        in her new regime.","        *if (not(head_librarian))","            *set head_librarian true","            *achieve head_librarian","        *if (not(berenice_dead))","            Berenice is allowed to live.","        *if (not(ptolemy_4_dead))","            Ptolemy IV survives, but remains relatively useless.","        And through the combined advice of you and Ptolemy III,","        the new Egyptian empire of Alexandria does all right for itself.","        *finish Chapter 7: The Test of Time","","    *selectable_if (((rhetoric >= 6) and berenice_dead) and (not(married_p3))) #I convince Ptolemy III to offer marriage to Nefertari.  (Requires Rhetoric: 6 and a single Ptolemy III)","        \"Ptolemy!\" you shout.  \"There is an obvious political solution to","        this.  Marry Nefertari, and forever rid Alexandria of the strife","        between Greeks and Egyptians.\"","","        Nefertari laughs.  \"You know, I would take that instead.  I would.\"","        The pirate queen and the king cease their attacks, and each","        circles the other warily.","","        *if ptolemy_3_romance","            \"But ${name}, you and I…\" Ptolemy III looks pained.","","            \"You told me once that marriage was for naught but politics and","            babies,\" you say.  \"Nefertari can offer you both.\"","","            \"We'll see about the babies,\" Nefertari says, frowning.","        ","        Ptolemy III sizes up Nefertari, then nods.  \"It would create a","        lasting stability for Alexandria that my grandfather would be proud of.\"","","        \"We could learn much from each other, I'm sure,\" Nefertari says.","","        The two leaders shake hands.  It is not the most romantic beginning","        to a relationship you have ever seen, but in the end, you think","        it is perfect for them.","        *if ptolemy_3_romance","            (And in time, you will learn that Ptolemy III has no qualms about","            liaisons on the side when his marriage is strictly political.)","","        Nefertari calls off the revolution, and what follows is a great","        period of peace between the Greeks and the Egyptians of Alexandria.","","        Having brokered peace between the Greek and Egyptian people,","        *goto greatDiscoveries","","    #I run and get help for Ptolemy III.","        *set helpingNefertari false","        *goto runForHelp","    #I run and get help for Nefertari.","        *set helpingNefertari true","        *label runForHelp","        *comment Both run and get help options unlikely in a first","        *comment playthrough, since the poison option","        *comment was available and will seem better.","        *comment This option largely exists to make the player feel","        *comment happy about the other options.","        You run through the palace looking for help.  In the courtyard,","        you find some of the royal guard fighting off an Egyptian mob,","        led by some of Nefertari's best soldiers.","","        \"Come quickly!\" you shout to","        *if helpingNefertari","            the Egyptians.  \"Nefertari","        *else","            Ptolemy's guards.  \"Ptolemy III","        is in danger!\"","","        Unfortunately, both groups hear you, and the chaotic mess of a fight","        follows you back to the throne room.","        ","        On your return, you find that Nefertari has slain Ptolemy III.","        No matter how good a fighter the king may once have been, the pirate","        queen is quite experienced in swordplay.  As you enter, she","        picks the laurel crown from the king's bloody body.","        *set ptolemy_3_dead true","        *if ptolemy_3_romance","            Your heart breaks to see your lover so thoroughly broken.","","        With the guards demoralized and the Egyptians invigorated by","        Nefertari's triumph, Nefertari's force makes short work of the royal","        guards, who soon lie dead before their former king.","","        \"Thank you for bringing reinforcements, librarian,\" Nefertari","        *if helpingNefertari","            says.","        *else","            says, not realizing you had intended to help Ptolemy III instead.","        \"I have heard much of your knowledge and wisdom, and I would","        be glad to have you as Head Librarian in my new regime.\"","        *goto nefertariLibrarianChoice","","*finish Chapter 7: The Test of Time","","","*label egyptians_vs_p3","You find Ptolemy III in the throne room, where a mob of Egyptians","bearing torches and knives has surrounded him.  Backed up against the throne,","the king bears a giant bronze shield with Alexandria's crest in one hand, and","a spear in the other.  The Egyptians have their backs turned to you.","","\"You would kill me, after all I have done to try to unite the Greeks","and Egyptians?\" Ptolemy III shouts.  \"You have no idea what my family has done","for you!  The Egyptians of Alexandria would be nothing without us!\"  He then","notices your entrance.  \"${name}, get out of here!  You are no fighter.\"","","The mob looks back, almost as one.","","*if nefertari_rel >= 50","    \"It's the traitor!\"","*else","    \"It's the librarian!\"","says one of them.","","*if male","    \"He","*else","    \"She","is the reason Nefertari is dead!\"","says another.","","The mob seems to understand the role you played in Nefertari's death,","and now, they want to kill you.","","With no inventions at hand to save you, your last chance is to talk your","way out of this situation.","","\"Friends, Nefertari was no ruler,\" you say.  \"She was a pirate who wanted","power, simple as that.","*if rhetoric < 6","    Ptolemy III may have made some mistakes, but…\"","","    You get no further than that.  The mob surges forward,","    stabbing you with knives and burning you with torches.","    *set mc_dead true","    *set ptolemy_3_dead true","    *set alexandria_falls true","    *set egypt_wins true","","    You had hoped to avoid revolution by cutting off the head of the snake.","    But a revolution without a leader turns out to be rather difficult to","    negotiate with.","*else","    Will you let her manipulate you even now?  Here you are in the throne","    room, and all you can think to do is kill?  You have an audience with","    the most powerful man in the empire.  Speak, and he will listen.\"","","    Ptolemy, taking his cue, nods.  \"You are my people, and I have only","    wanted unity of the Egyptians and the Greeks.  Tell me your complaints,","    and I will see justice done.\"","","    The mob hesitates.","","    \"I applied to be a guard in the palace, but you only take Greeks,\"","    a man shouts.","","    \"Show me I can trust you now, and that will change,\" Ptolemy III counters.","","    \"The temple taxes for Egyptians are too high,\" shouts a woman.","    ","    \"They shall rise for the Greeks, and fall for the Egyptians,\" Ptolemy ","    III says.","","    Your plan works:  because you cast the situation as an audience with Ptolemy","    III, the mob becomes convinced that its demands have been met.  ","    Ptolemy gives amnesty to those present in the throne room, so long as","    they go out and convince their friends and neighbors to stop the revolt,","    now that its objectives have been achieved.  You back up Ptolemy, persuasively","    arguing that he has always been a man of his word.  The Egyptians leave","    convinced that the revolution was a success, despite Ptolemy III remaining","    alive.","","    As the last of the mob leaves, Ptolemy III","    *if ptolemy_3_romance","        kisses you and","    congratulates you on your amazing speaking skill.","","    \"I hope you will do what you have promised,\" you say.  \"To avoid","    future revolts.\"","","    \"Of course,\" Ptolemy III says.  \"I spend a great deal of the treasury","    every year on that temple to Serapis, hoping it will bring unity.","    It is somewhat embarrassing that I never simply ask the Egyptian","    people what they want.\"","    *set egypt_unrest %- 20","","    As everything goes back to normal,","    *goto greatDiscoveries","","*finish Chapter 7: The Test of Time","","","*label helping_p3_end","Ptolemy III laughs, picks you up,","*if ptolemy_3_romance","    and kisses you hard on the mouth.","*else","    and spins you around with glee.","\"That was brilliant, ${name}!  Thanks to you, the Alexandrian empire","still has a king, and the so-called Pirate Queen is","*if nefertari_dead","    defeated.\"","*else","    defanged.\"","","\"What about the rest of the revolution?\" you say.","","\"We'll stamp it out,\" Ptolemy III says confidently.  \"So long as I am","king, no harm will come to Alexandria.\"","","And indeed, the rest of the revolution peters out that night.","Ptolemy III continues to rule wisely and","*if ptolemy_3_romance","    justly, and your romance continues to be the stuff of legend.","*else","    justly.","","Having saved Alexandria from Nefertari,","*goto greatDiscoveries",""], "labels":{"choosedefended":209,"defendthelibrary":338,"begin_palace":369,"fightsosibius":534,"attackguardalone":588,"nefertari_is_here":740,"nefertarilibrarianchoice":773,"agreenefertari":776,"alexandriafate":1277,"listthedamage":1345,"libraryprelude":1363,"savearchimedes":1393,"archchoice":1414,"circles":1571,"donotdisturb":1595,"dyingwitharchimedes":1614,"begin_fleeing_syracuse":1652,"fleeing_syracuse":1660,"claws":1757,"backinalexandria":1768,"greatdiscoveries":1775,"makeitsafe":1989,"howdefended":2001,"mobkillsberenice":2099,"nonpettychanges":2109,"pettychanges":2201,"ptolemy_3_changes":2256,"convincearchimedes":2365,"skip_to_nefertari":2397,"berenice_and_kid":2405,"ptolemy_and_kid":2639,"p3_wedding":3070,"nefertari_vs_p3":3103,"runforhelp":3255,"egyptians_vs_p3":3299,"helping_p3_end":3396}}